{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vliAJpHltPo-SL6tGz5A3g", "review_id": "QaRFtzgIK0PUQOepmfr2-w", "stars": 4, "date": "2010-10-21", "text": "New to a city and need car repairs- is my middle name. Its hard not being a car guy but having your own and you're wives car to take care of. I always feel like I cant trust anyone who has the ability to repair anything on our vehicles since I wouldn't know any better. I need an oil change fast so I took in my VW Jetta. The guys we're really friendly. Read a lot of mixed reviews all over and talked to the manager about them when I got there. They fixed Thompson (my car) up real nice and no problems after like I was nervously expecting. I'd go there again.", "type": "review", "business_id": "QiI73966zZ0H6-ojFdbcOw"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "648OlBnPCh9eg1tZSo9Ycg", "review_id": "qjQdRLqRsKEdSew6ca5uyQ", "stars": 5, "date": "2008-02-05", "text": "One thing to say about this place...You MUST get the Meat & Potatoes appetizer.  Hands down one of the best appetizers I've ever had anywhere, and paired with a salad, I could contemplate just eating this for dinner.  This place is SUPER cute and \"romantic\".  They offer BYOB service which is great...you can bring your own favorite wine/beer!  \nThe food was wonderful and the waitstaff seemed knowledgeable in what they were serving and made some good recommendations.  \nI can't wait to go back!", "type": "review", "business_id": "LzpR_jE6VIutJ08s2cdRrw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T-SKJo372IHScyKTlgpJhA", "review_id": "SA97yaEy2JTQoidOgJs8rQ", "stars": 5, "date": "2011-06-27", "text": "I just wanted to give my two cent. I have been going to dawn studio for years. I like the fact that Dawn studio  is a small business phoenix az owned good for the economy..all of us. I like the classes I feel I get a great workout everytime. I do wish they had classes wtih the cool air..but then it would be call Hot Yoga..lol. I also would like to see more pilates classes. \nI met Dawn when she still had a regular job and a weight problem she has taught me more about staying focus working hard to getting in shape since she know what it take to keep it together. I would recommend Dawn classes in a heartbeat.!", "type": "review", "business_id": "L2PpaD1BEW_zKCt5GRLvPg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IVuTqZSQ-DHemW7gNazGNw", "review_id": "oKyszD6fQ6jfogD9eNLTAA", "stars": 4, "date": "2011-10-12", "text": "We've now been to Greekfest a half dozen times. Basically any time we go through Phoenix. The food is authentic and everything is homemade. The place is a bit pricey, say $40 per person but very good. We have had most everything on the menu by now and it's all good. As others have posted, you can't go wrong with the lamb.", "type": "review", "business_id": "KLaxBc83JnxyGf7GP7enYA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Zs_onFcHrIBeg0G52iWbbg", "review_id": "MQJ5bitI0uvZ2u-Fa6fNmw", "stars": 5, "date": "2013-01-30", "text": "I have been going to the Village for years -- I have used every service from the spa to the wonderful yoga program , the amazing zumba classes as well as the pilates room. The village always offers a new way for you to play and have fun and the staff is so helpful. I consider myself so lucky to be a part of the village! Try it you will love it!!!", "type": "review", "business_id": "sR9lSQiTuBg8zsIw9Zd-Dg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "MBhvsi8dJTHuaKn4v98XRw", "review_id": "FDa6LCQuPcgMC1jOlW7flw", "stars": 4, "date": "2012-07-15", "text": "The simple fact that they make their own tortillas makes all the difference in the world. I am so glad that El Bravo is in my central neighborhood while the suburbs are jammed full of lousy chain restaurants. El Bravo does fill up during the dinner rush so arrive early to place an order to go.", "type": "review", "business_id": "flUKBy7WHqYdfOrwU1A2SA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5v-2WRegOeMiUt-COZhVfw", "review_id": "DqqyAGaD3SJg5hLcwy7FLw", "stars": 5, "date": "2013-07-05", "text": "Central Car Care is the most honest,  trustworthy, and reliable auto repair shop I've come across in a long  time.  I found them on Yelp and I'm really glad I decided to take my car there.", "type": "review", "business_id": "xJ9kdujal0bSGlZ9tsvrYw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u9dVWjLiddkScHuvZOeq2w", "review_id": "ZwVUQXKnd9ImuDh_o60W4Q", "stars": 5, "date": "2012-12-20", "text": "They certainly have everything, from tiaras to bottles of that stuff you use to create real-looking wounds. A little on the pricey side, but excellent stuff overall.", "type": "review", "business_id": "bbFWQng4nd0P083xUEiShA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r7PHMvn3SK-XqzWQbgstDw", "review_id": "B8PxGhsLM6F9hIwpuiiqDQ", "stars": 3, "date": "2013-11-01", "text": "So the food is good, a bit pricey if you ask me.  There are no pleasantries here, just take your order and push it out to you.  And really what is the deal with charging $0.38 for a thing of BBQ, I would think if you got onion rings or fries and you did not get ketchup you could pass over one free tub of BBQ, I mean is that really going to cut that much into your profits?", "type": "review", "business_id": "FKoqqNLG47bl_AjMwg3PjA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vwdl_-TZ1qdsw6bX0YLVjw", "review_id": "4jBlV9MMQOj0NjAgvWHZ2Q", "stars": 5, "date": "2011-03-18", "text": "This is a neat family owned business with two locations in the southeast valley. This particular location has a slightly older crowd and a very relaxed but fun atmosphere. The baristas are always high energy and very friendly, half the fun is ordering your coffee. \n\nThe coffee isn't exactly the best quality and they only serve in disposable cups despite the high amount of regular customers. But they have so many coffee and non-coffee options so everyone is sure to find something they'll love. \n\nAlso a good spot to study except for the music selection (kinda dated and distractingly so). Open very early and open the latest out of any coffee shop I know.\n\nIt is also in a nice strip mall with a grocery and several restaurants AND an artificial lake with DUCKS ! I love ducks and feeding them so I'm always enthusiastic to come here.\n\nI love you Coffee Rush ! But please start using ceramic mugs or start selling reusable coffee mugs (preferably not made in China). Thanks!", "type": "review", "business_id": "l1MZjZK2tLxfFRB62lQmsg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eBwBjylS66qPcHs2_ajLag", "review_id": "pNmqGF1M9lJ7wjsXjH5jUw", "stars": 4, "date": "2009-11-11", "text": "Scale of 1-10 (multiple visits):\n8 Food\n9 *Drinks*\n9 Service\n9 Atmosphere\n6 Value\n\nHonestly, the cornbread is so good I don't even care about the entree by the time it gets to the table.  And the margaritas are great, but expensive.  However, if you go the Martini-Rita route, you get some generous pours!", "type": "review", "business_id": "z1Np8_oQECKWGCwJJ8864w"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "DMCGCo1D88u61SBx8jXAWg", "review_id": "Lqir-9K3Fw3wqKz2sbLRZw", "stars": 2, "date": "2009-08-30", "text": "Going to Houston's either on Scottsdale or on Camelback is like throwing dice. Sometimes its good and sometimes its not at all. Over the years and I have been eating there for years the staff has become less and less polished. I've watched it go from slacks to jeans and very attractive staff to just ok. \n\nIt's not cheap to eat there and you expect the food to be consistent but it always isn't. My wife loves the fall vegetable plate but the last two times it was not good the fish that I ordered was very overcooked. I sent it back and the wait staff rolled her eyes. \n\nOne other time (years ago) I was waiting with my wife and another couple and we waiting for 30 mins which was normal and person came in with his friends and handed the front person 100.00 it looked like and they were seated right away. I asked the wait girl how much she made a week and she looked shocked that I caught her. She said excuse me walked away I didn't see her for the rest of the night another person seated us 10 mins after that. I wrote a letter to the corp office and never got a letter back. \n\nThe real money they make is made off the snowbirds that come in for the winter. So during the winter I would avoid this place. \n\nGood Luck.", "type": "review", "business_id": "jBb5KHHAj4s8hcXVS6QXDg"}
{"votes": {"funny": 2, "useful": 5, "cool": 4}, "user_id": "4_YfcfHkCem1onJFkItxjA", "review_id": "KwaNwOcc3hs_7euw9ASUQg", "stars": 4, "date": "2007-12-31", "text": "I think I was imagining cigarette stained walls, low-slung ceilings and trashy looking people, but I was WAY off.  Casino Arizona is a really gorgeous casino.  I haven't been to many casinos here, but if you closed your eyes, fell asleep and woke up on the casino floor [not that I've done that or anything] you might think you're in Las Vegas.  Everything you can find in casino there, you can find here - slots, betting,  roulette, you name it.\n\nI was here for a company Christmas party a couple of weeks ago and schmoozed, boozed and nibbled on appetizers.  The food was delicious.  I wasn't surprised though, because I've heard their fancy restaurant, Cholla, is critically acclaimed. I recall all the food served cocktail-style as being delicious - the highlights being the coconut fried shrimp, foccacia pizza, charcuterie plate and roasted veggies.  And all the cocktail waitresses walk around Vegas-style mumbling \"Cocktails? Cocktails?\"\n\nYou can get your Beatles cover band fix every few months or so when Beatlemania performs.  Yes, it does sell out every time too. Besides that and Showstoppers, you can find the comedian circuit or occasional big-name performer stop here.  Don Rickles was performing last week. \n\nIt's not Las Vegas, and shouldn't be considered as such.  But for the serious gambler or the tourist who might be itching to throw down a few, Casino Arizona might just do the job.", "type": "review", "business_id": "v76uEBa0jkRl8AH28piX4w"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "eYQRLJ5I9JaCWUbrJUAtzw", "review_id": "sDak3Y6f5yk0n_HBJwK55Q", "stars": 5, "date": "2014-03-03", "text": "FUN, fun and FUN! No matter what you consider entertaining, this place will have it! One room is karaoke, another is a live band, a room for dancing and of course a bar area with general stereo music. The drinks are relatively inexpensive and the service is great. The only downfall was the tight outside patio space and having to side walk past another group for an open standing space.", "type": "review", "business_id": "64IrwpAlZKQ-Pd70gNmiOQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "i2QqqRhuc20r27y_fx59KQ", "review_id": "sKUhxVxy8pOT8R2dZrndXg", "stars": 4, "date": "2014-03-27", "text": "Yes this is a chain Mexican Restaurant.  But I find it better than South of the Border or other such fare.  It seems a step ahead of the other chains.  \n\nThere seems to be a bit more inspiration with the dishes then the typical beef enchilada en red sauce.\n\nFor example Spinach enchiladas or bacon wrapped shrimp.  Or even the salsa choices are bit different.  \n\nWe went with a party of 6 On Sunday lunch.   No problem getting seated, though they were busy.  I have to admit our waitress while very nice was a bit slow on the take.  would constantly bring me a new iced tea, but never removed the empty glasses.  At one point we bussed our own table to prepare to make room for the entrees.  Oh yeah, one of our entrees did not show up with the rest.  It took about 15 minutes for the kitchen to get that one steak out.  Credit to the manager who took it off our bill.  \n\nWe paid with $25 gift cards bought at Costco for $20 each.  Worked very easily.\n\nthere is more than enough food per person.  No one even thought of ordering dessert. \n\nIn the past we have had the Margaritas and they were not as sweet as some places sell, which for us was a big plus.  though they tasted just like the Kirkland Costco 'Golden Margaritas\" (which we buy and love).\n\nAll in all, for a group with more Conservatives Mexican food tastes, this is a safe bet.  Way too much to choose from, which means everyone will get something they will like.  \n\nAs for the wife and I, we continue our quest for more authentic more adventurous Mexican food in Phoenix.", "type": "review", "business_id": "BpWeAIGCrl5jxt-sMJgDsg"}
{"votes": {"funny": 1, "useful": 6, "cool": 2}, "user_id": "EWpD3onsQwf4xOGx0agVkQ", "review_id": "B3M4ZEDdR44KwWXI5Djhjg", "stars": 4, "date": "2008-02-15", "text": "I've found a new beauty supply to swear fealty to! This store is packed with both well-known and hard-to-find hair care and beauty products, along with hairpieces & wigs, styling appliances, accessories, tools, skincare, men's grooming, and a couple of drugstore cosmetic brands. \n\nIf you haven't been able to find that extra-gentle shampoo you used to love, they might have it here. And if they do the price will be lower than you're expecting. (Example: a scalp treatment I had to go to the dreaded Wal-Mart to find last week was almost a full dollar cheaper at BSW. And this is a product that is only around $4 to begin with. 25% less? Score!)\n\nI could knock off half a star for the somewhat gritty feel of the location. The area feels a little run-down and the store itself has a plain cement floor and industrial style shelving throughout. Take the 'warehouse' part of the name very literally. The aisles and displays are also a little too close together, resulting in a mildly claustrophobic feel. The same goes for the parking lot. I imagine the narrow spaces barely hold larger trucks or SUVs.\n\nBut the 'cons' are minor quibbles compared to how frustrating it can be when you're searching for one specific product and just can't find it. BSW is easy to get to from Highway 15; check it out.\n\nEDIT TO ADD: I checked the price of the scalp treatment mentioned above at a local CVS this weekend. $6.50! This means Beauty Supply Warehouse is almost $3 cheaper. And that is insane.", "type": "review", "business_id": "wndccLJ8zbhlwhwYrfEWNg"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "seZUmOBVw9swD9RdBbsFUA", "review_id": "eJLjNj1p8Fj7NU3n_EIG6A", "stars": 1, "date": "2013-06-18", "text": "I call this place Ghetto Walmart.  The stuff is always strewn all over the place.  Nothing is organized.  You have to pick up items and bring them to checkout to find out what they cost because they are not priced on the shelves and are not put back where they belong.  At any given moment there are about a dozen carts of goback items blocking the front of the store and you have to wonder if any of them are perishables.  The lines are always long and there are never enough checkers especially at night.  They shut down almost every aisle including the self check aisle after about 8pm so forget it.  Also after 10pm they have pallets of stuff blocking every aisle making it near impossible to shop.  When you enter the store you feel like you are going to get mugged.  I'd drive 10 miles to another Walmart to avoid this place.  The car repair shop is rude and gives you an attitude about changing your car battery if you are lucky enough that they have it in stock.  I went there a month ago to get a BlueRay DVD Player and there was not a single DVD player in the entire store.  There are never any carts and the rude customers leave empty cars directly behind your car when you are inside the store.  I have been to many Walmarts in Las Vegas and this probably the worst.", "type": "review", "business_id": "WwRUawFNTDzh3bQ-wZIGEw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TIF8tPC_VuKm26BhtwBKJA", "review_id": "J3Y8DzufogtrEqAMOgEiBg", "stars": 5, "date": "2013-12-24", "text": "We found this place through yelp..let me tell you it is delicious! You get tired of steaks and potatoes after a couple of days and if your craving for some real authentic asian food this is the place to go...not to far from the strip and worth it...they make their own ice cream highly recommend...our waiter was super cool and attentive...we will definitely visit again in the future...", "type": "review", "business_id": "KwLfgeylp9d8zY3KacREiw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "b6zxvmCa1a-ggWxObSweZw", "review_id": "Ys1wPQoA_emz57A9wyKWOQ", "stars": 5, "date": "2009-12-04", "text": "Excellent assortment of soaps, lotions.  \nWonderful, kind staff.", "type": "review", "business_id": "k4tomQpZKZJEQ9tzvLoE3w"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "c4Xt1A_vRF7jLiFV7LoPRQ", "review_id": "8MPYhglFmc-iyU5qf_oUVA", "stars": 1, "date": "2012-03-22", "text": "I'm in Wisconsin for a month for business and the first place I intended to go was Ians, based purely on Yelp.  I've gone to a few other places but finally decided to go down to see Camp Randall and get some Ians and see if it really is what many people call the best pizza in Madison.  I arrived and despite the fact that the shop was practically empty was ignored for about 10 minutes by the guy making the pizzas.  Yes he obviously saw me but didn't so much as say \"Be with you in a second\" or anything.  Some young college students came in and a girl came out and waited on them promptly.  It was as if they knew I was from Columbus and Buckeyes were second class citizens or something!  I even joked about this later and they did not find it funny.  Despite me talking about how highly they were rated and the like they pretty much were very standoffish and very unwilling to talk.  Ok, so much for customer service, but hey even the best food places can have totally rude help if the food makes up for it right?  \n\nWell not here my friends.  I had one slice of the famous mac and cheese pizza.  I LOVE Mac and Cheese and I love Pizza so it seemed like a hard thing to mess up...but it was not what I thought it could have been.  Looking at pictures on Yelp the recurring thing I kept thinking by looking at the Mac and Cheese pizza slices is how dry they looked. I hoped that once I bit into it that there would be cheese sauce or something that would prove me wrong.  But the slices just looked dry and not very cheesy at all.  However, photos can be deceptive, it's the taste that matters.  Well biting into the Mac and Cheese pizza I realized all of my worst fears.  It was tasty macaroni but the slice was very dry and did not taste cheesy in the least.  This is not Mac and Cheese pizza so much as Mac and dough pizza.  As you can see from my picture I sprinkled a dash of hot sauce at the end at the advice of the woman at the counter.  I found out why after tasting the slice that she recommended I do that, because it added some much needed moistness and taste to the slice.  \n\nThe bottom line is that I threw away about 30% of the slice.  I *NEVER* throw out food, you can ask my girlfriend and/or look at my waistline for proof of that, heh.  But that indeed is what I did in this case.  In hindsight I guess I should have just coated the whole slice in the hot sauce (which was great tasting hot sauce btw) but I didn't want to dilute the purity of the taste of it by doing so and skew my review.  I really wonder if maybe you do have to be kind of drunk and in the moment at 2am for this pizza to taste good because to me it made me question how this place stays in business.  It's certainly not their friendly employees or their tasty food if the Mac and Dough...er Mac and Cheese slice, is any representation.\n\nTo be fair Ians does have a LOT of other combinations and I'll bet if I were to try some others I'd be much more impressed but at $3.50 a slice I'm not going to be trying that anytime soon.  Honestly if I lived here I'd probably give them one more chance and that'd be about it.  Maybe I'm too old, maybe I'm too much of a pizza traditionalist or maybe Ians just is highly overrated.\n\nAfter throwing the last part of my slice away I got into my car and drove back over to Pizza Di Roma, a place that has vastly superior pizza in my opinion.  Sorry Ians, you may be a landmark but you're not on my places to visit if I return to Madison anytime soon!\n\nP.S. - One reason I waited to try this place for so long is I knew it was on campus and I wondered if there'd be a place to park within reasonable walking distance.  There are plenty of places to park in front of the building (about 8 to 10) but they are all metered so have your change ready.  So don't let the fact they are on campus stop you from visiting here if you do want to give them a try.", "type": "review", "business_id": "hSl4HdPdu6ohwFKJPfj93A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "D9WIDdPgbOk8-ChvH_hUfQ", "review_id": "s3z75YJXeaZmBEJqzlcEEw", "stars": 4, "date": "2012-02-15", "text": "This is not bar for the majority. It's a dive bar in tiki's clothing. There are no tiki drink menus as it seems the crowd that frequents this place does not drink them. However, the bar tender was game to use his app to make the requested drink and it came out well. High five, bartender!\n\nIt is an eclectic mix of customers. There were metal heads playing pool in their bedazzled and ironed on denim jackets. There were first daters. There were drama friends singing along to the DJ's awesome mix of cover songs. Fun times were had by all.", "type": "review", "business_id": "cqIHyZ3Q0D4vBi-vb4mi-g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "49zOPRrFCHvQOKZ0bRohew", "review_id": "n7RKhL3-Y_ABGAUNqPi_3g", "stars": 5, "date": "2012-09-27", "text": "This restaurant literally was a deciding factor when my husband and I purchased a house in the adjacent neighborhood. The staff are so friendly, and the food is so delicious. It's our favorite place. This location is completely separate from other Thai Ramas in the valley--way better than the one in Tempe. Try the angel wings and yellow curry!", "type": "review", "business_id": "PXmR1MgOAWB066XH20HjxQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "BlivVzHUCuCIzMngqlauWg", "review_id": "YdzGNb1OIKDtovVTZ8_zrA", "stars": 1, "date": "2014-04-02", "text": "If you're under 50, or older with a poor memory, you likely don't know that in the early 1970s Arby's was known as \"Arby's Real Roast Beef\", and it was real. The 'real\" part was actually on the bottom of their outdoor sign, and perhaps even underlined.  You won't find ANY reference to this under their Wikipedia \"history\" page - strange?  Back then, the restaurants intentionally placed their slicer containing a huge chunk of genuine roast beef where everyone could see it.  Their sandwiches were, as you would guess, superb.  \n\nI can't remember exactly when the chain made the 'conversion' to pressed and formed imitation roast beef, but the current product is nothing more than a poor man's lunch meat ala Subway.  Several years ago, it occurred to me to ask a store manager why they had stopped selling genuine roast beef and he gave me some fairy tale story about a shortage of \"quality\" beef.  I do on rare occasion fool myself into buying one of their \"roast beef\" sandwiches, but more than one visit every few years reminds you of why you stopped eating them.  The dead-gray flaps of \"roast beef\" under the bun are quite unappetizing, so it goes down a little easier if you don't look.  \n\nI couldn't - in good conscience  - recommend eating these faux roast beef sandwiches to anyone.  It is a shame some entrepreneur hasn't opened a chain of restaurants replicating the real roast beef sandwiches of back when.  I would pay $6 - $7 for the real thing. But I can still choke down one of the current Arby's offerings - about once every Leap Year.", "type": "review", "business_id": "iAHNZo6GF4C3N-z8u2C_ww"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5NCOOJMcY8S-aNzbWqTB-A", "review_id": "FpHL6nC9a05jD3QuNQKvFA", "stars": 1, "date": "2012-11-13", "text": "Horrible service!  Walked in and was told there was a 10-15 minute wait. Sat down and saw people getting seated that came in after I did. Walked up and the hostess. She said, sorry you're next. The service sucks here. Night was ruined before I got my food.", "type": "review", "business_id": "OIBrslaVxFxaaGUsYFUujg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "x3DxLHnALCciVGP3SDwcmg", "review_id": "tY7aIHr6wCFGn1gk934jKw", "stars": 5, "date": "2014-02-02", "text": "I'm a novice to the car world, and....\n\nBarrett-Jackson is a wonderland of beautiful cars, and a nostalgic walk down a mile of American history. From the Great Gatsby style Duesenberg's to the 60's era Impalas to the Batmobile,you'll be impressed and thrilled with the experience!\nSome great options for cheap & quick eats and fun vendors to shop while you walk.\nBe sure to spend some time in the auction hall, it's a sight to behold!\nYou can even hire a pedi cab for a ride from the parking lot!", "type": "review", "business_id": "COvyT9UCD8duDjMjuyBeig"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "k2I677-DJXfvkLyU_iinMA", "review_id": "6yOscAsUE-FF_NbmyLrqfw", "stars": 4, "date": "2014-03-29", "text": "I tried Village Tavern for the first time  last week. We were promptly and politely greeted when entering .\n\nOur waitress was very nice and offered up suggestions since it was our first time . She also was very attentive with our drinks.\n\nThe nachos were good . A lot of food though and our waitress warned us of that. Our entrees were really great as well. \n\nThe environment was nice and quiet . The building itself pretty cool too because it has the wood beams showing on the ceiling . I would definitely go back here.", "type": "review", "business_id": "2JZv-P1lDKOPKvefQlYDEQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "PmDSDjaZUhNeo6XiqtoSFw", "review_id": "oapcuMpoGUy2WZS67z7ZtA", "stars": 5, "date": "2013-07-29", "text": "Amazing steaks served extra hot on a sizzling plate. Sides and appetizers are decadent and everything is chock full of great flavor.\nThe Cowboy Cut steak is enormous and simply the best steak I have ever had (several times now).\nThis place is where I splurge for celebrations, it's not cheap, but quality never is.\nOur waitress the last 2 trips was incredibly intuitive in filling our needs.\nIf given the opportunity, this is my last meal...", "type": "review", "business_id": "sbjb1qNUcqQomJvcgPuJCg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yXa1HFUJ3BtSqkDwTHdAUQ", "review_id": "2LHGD8jakJiAE3KQEXTbcw", "stars": 4, "date": "2013-11-18", "text": "I love playing both courses at Tonto Verde any chance I get. The course is always in good shape and I've never had a complaint about the experience in the handful of times I've had the opportunity to play it! If you have time it's always fun to play the putting course as well.", "type": "review", "business_id": "is-olmqaSZ0KCoe-_ftW5w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nyHh14Vb9S269-kGKaUelg", "review_id": "j_cCcN2vJpxUP09zyykiSA", "stars": 4, "date": "2011-08-05", "text": "I'l make this concise. Great beer. Good atmosphere. Good service. Decent location, although the parking situation can be challenging. The food is good (it used to be great). \nI remember when Four Peaks had the brew tanks inside the actual restaurant and they had a service where you could make your own beer inside the brewery, they even helped you bottle it and make a label. All that is gone as they have grown in popularity. \nThe wings used to be some of the best ever: grilled, not fried. Now, they are just fried but still good (not great). For bar food, this is still a really good place to eat. \nThe place is clean as well (one of my big pet peeves). From what I am able to observe at the Scottsdale location, they have taken the high cleaning standards required for the brewery and kept them in place for the bar/restaurant. \nThis location will get busy during happy hour, on game day, or anytime after 5pm. Be prepared to stand and bump shoulders with beer in hand until a seat opens up. \nThe crowd is an eclectic mix of post college grad's, professional's, and nine to fivers just getting off work. However, that changes during the winter months when more touristas are in town and the resorts filter their customers into the restaurant.\nA great place for a beer after a round of golf or shopping at Home Depot.", "type": "review", "business_id": "JokKtdXU7zXHcr20Lrk29A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PBxgmhVs6eW67xgL5sL85A", "review_id": "VI0NtsVXkl27FlgrIbe9XQ", "stars": 5, "date": "2010-05-28", "text": "Let me start off by saying that there are several Slices restaurants in the Valley. The one on Mill is by far the best. They have the most amazing and original selection of pizza.  No matter what you pick, it will be good.  If your favorite isn't available when you walk in, no problem! They will make it for you! If you are looking for a slice of heaven, you MUST try the salad pizza.  No, its not lettuce on crust!  It is simply the most unbelievable creation that includes artichokes, red pepper, and spinach.  It is great by itself, but ask for them to put balsamic dressing on top.  The balsamic takes it from being amazing to last meal quality :-)", "type": "review", "business_id": "cUaaIk_3UdeSJ54CLvrW8A"}
{"votes": {"funny": 1, "useful": 6, "cool": 0}, "user_id": "n1BWg2ZfGb8zemNMnBZFDA", "review_id": "_LF5nLLmwqLELJdC9UltLA", "stars": 1, "date": "2010-12-09", "text": "I am a local here in Las Vegas and always rent cars to travel to LA to visit family. \n\nSo I rented a car through price line how I normally do got the confirmation and went on my merry way. Something told me to call and see all the paperwork they would need since all companies have different rules. Come to find out if you rent with Alamo they require you to have a round trip plane ticket no matter what. \n\nI had to fight to get my money back and wait 6 days for it to go back on my card. \n\nSince ALAMO gave us locals the big finger I will do the same FU ALAMO!", "type": "review", "business_id": "Fin1rBze29S5b-fqfRZ4kQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pDIlq9wKmgB9XfMmW7qQGg", "review_id": "5E93OdzM8OiwgK0bdBbkYw", "stars": 3, "date": "2014-05-22", "text": "The Golgen Gate Hotel and Casino is one of the oldest facility, established in 1906. If the case apply and price is the main criteria when sorting hotels, this is quite an honest choice. The room itself is quite small, about 15 feet x 15 feet. Although, all the furnitures have been updated, from the bed setting to the flat screen tv. DO NOT GET ROOM 337, It overviews the rooftop. Ask for a room that looks out onto the Freemont Street Experience. A dissapointing feature about the room, the shower!!!!! Its a locker room shower!!!! Dont forget to bring your flip-flops! It is conveniently located but if you plan a walk to the Strip, its a 30-45 min walk just to get to Circus Circus. If you have not been to Vegas in awhile, it has changed and not necesarely for the best.", "type": "review", "business_id": "9Vr8jxyP6eP9HQcEbg1awg"}
{"votes": {"funny": 1, "useful": 5, "cool": 0}, "user_id": "mlGB7I3te-o3XTR5z98_Qg", "review_id": "INC-u9h8H_blASQeGjUpyQ", "stars": 5, "date": "2011-01-20", "text": "Atomic Liquor, one of Las Vegas's last remaining links to its Rat Pack Mondo Atomic past, has been closed since the beginning of the year (1/2011) !! \n\nStella Sobchick who ran the bar with her husband Joseph, passed away on Jan 15th at the age of 91. Joe passed away 3 months earlier also at 91 years. They had run the business for 55 years. I was glad to have met them one of the times they were both in the bar. \n\nMy understanding from talking to one of the bartenders at the El Cortez, is the Sobchick's son has no interest in running the place. Hopefully, he can lease out the bar to someone who understands its historic significance and will continue its legacy. In the meantime this is really really depressing news.", "type": "review", "business_id": "it1cP71lWcRaUkr4IwuUNw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ER53FoKMKsPD7D20cH37Pg", "review_id": "rimEotXcNzeXTAWSogGYug", "stars": 5, "date": "2013-12-28", "text": "AMAZING!!!!  \n\nHusband and I can't remember if we have been here in recent years.  This was the first place that I brought him 14 years ago when he came to visit me in my hometown for Christmas break.  So, last night for our 12th wedding anniversary, we decided to take a walk down memory lane and kick Vegas old school.  \n\nFirst of all, the service is incredible.  You are consistently (in a good way) being checked on by the various servers.  You never have a moment of wanting.\n\nThe food was O M G!\n\nWe shared the lobster bisque.  I took the first bite, turned to husband, and said, \"THIS is what lobster bisque is supposed to taste like.\"  Great flavor and chunks of lobster.\n\nThe wine sommelier recommended a nice half bottle of pinot grigio for me to accompany my salmon.  I had it sauce nantua, which had a nice sauce with bay shrimp and crab meat.  I liked the accompanying veggies.  Husband had the Beef Wellington.  While we both enjoy our meals, husband does prefer his meat well, which is not possible with the Wellington.\n\nEnded the beautiful meal with a house cappuccino.  ;-) \n\nComplimentary salad is outstanding, as is the chocolate covered fruit.\n\nThis is a classy, old school Vegas place that is worth the trip to the Four Queens.  Husband's favorite part is that he does not leave hungry, unlike some of the other \"upscale\" places in town.", "type": "review", "business_id": "foDMwBRGJvKw791v0AT7OA"}
{"votes": {"funny": 1, "useful": 3, "cool": 0}, "user_id": "POuaJicO1plXLpixnWr_4w", "review_id": "I-7Se0U5XT1u-WiG7C1Buw", "stars": 4, "date": "2008-07-10", "text": "For a group of four people, this was ideal. Very clean room with two comfortable fold-away beds.\n\nThe guys liked the scandalous outfits on the drink girls with the dance interludes, and the girls liked the Starbucks shops inside so we could suck down iced green teas at all hours.\n\nCalled for extra towels one morning and within five minutes there was a guy knocking on the door with a whole stack. \n\nBut no microwave. \n\nFREE SHUTTLE to sister casinos, which meant we could get to the strip for free. Nice. A little smoky, and a little trashy, but, well, what do you expect?", "type": "review", "business_id": "8IMEf_cj8KyTQojhNOyoPg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NO-Rs-80i2ZF6AJ9PLzxIA", "review_id": "FAidJ_dOV318yF2aRZRqhw", "stars": 2, "date": "2010-10-14", "text": "They have monthly free poolside concerts, yay. They have no consideration for the disabled, boo. The problem with these shows is that every show has different rules and the Rio nor the radio station promoting them let anyone know the changes until you get there.  The best example is my girlfriend is disabled and cannot sit on the hard ground.  The first 2 shows we went to there was lounge chair seating, the next show we were told we couldn't sit in the loungers, the next show after that we could, then couldn't.  Last month we tried to go and was told no seating but we could bring our own chair to use.  I asked security \"Any chair?\" and was told \"Yes\" but I know for a fact if we came back with just any chair they would not allow us to bring it in so we had to leave.  The other things they change is one show you can swim, the next you can't swim but you can use the jacuzzi, the next show both are off limits, the next show the pool is open again, what the heck?  And the last reason not to go is the alcohol, they offer an \"open bar\" which consists of 1 free drink of whatever they decide that night whether it be flat, warm, foamy beer or watered down who knows what.  The Fosters big can is the best deal but one show it is x ounces for x dollars, the next show the same can goes up 2 dollars, the next show the price goes back down but the can is smaller, the next show the price is higher for the smaller can.  Its been 3 years that I have been trying to attend these shows and nothing has changed in that time, still inconsistent and just plain wrong.  If you want a good pool party/free concert with open bar go to Hard Rock on Fridays in the summer, its always righteous and a good time without all the frustrations of the lame a$$ed Rio.", "type": "review", "business_id": "8IMEf_cj8KyTQojhNOyoPg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9VVofbiaxgjqZYK4U6b3kw", "review_id": "TXq_m7nrFJe1s7h1oHpUWA", "stars": 4, "date": "2010-01-22", "text": "Good Mexican.  I love the \"chicharrones\" crispy pork simmered in salsa.  And the shrimp with the chile de arbol sauce.  Fast/friendly service and the strong margaritas hit the spot.", "type": "review", "business_id": "TCX33pPlZzWKkqLG07wvUg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NYYOlhgRHhpnK_ZHOEBl0A", "review_id": "EPgVuFUdJVsVAZCLhZbsKQ", "stars": 3, "date": "2013-09-06", "text": "It could be nice for a special occasion place. When there's no real occasion except to hang out and eat great food and catch up, it works except it doesn't exactly count as a place to just hang out.", "type": "review", "business_id": "LOef7o-dnn7Z5qGMZCi6pw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Eumuk3UYYpkR6s6SBllVEQ", "review_id": "gZUNWAvPBGM0c_98GDX6Lw", "stars": 5, "date": "2009-05-22", "text": "Attention all Brides To Be!\n\nThis place is great for a reception dinner. Great photo ops, and great food.\nWe had a private room upstairs overlooking the canal shops. The food was amazing!\nMoist Chicken Breasts, and Grilled Salmon. Crusty bread with olive oil/balsamic vinegar dip, and tiramisu. There was also a pasta course which is normally Penne alla Vodka, but we requested it changed to Pomodoro sauce and they were all to happy to make the change. Soft drinks are not included in the dinner, but once the first was ordered it was free refills. (A feature most restaurants we looked at did not offer).\nWe orginally were going to pay for alcohol on consumption, but our waiter suggested wine for the tables and beer. He pointed out that this discourages excessive mixed drink ordering. The fact that he was trying to SAVE us money surprised me, but impressed me too! We had 3 small kids in the party, so the restaurant was accomodating in letting them order a la carte. No kids menu, but they enjoyed their pizza and pasta. They set up our cake table, and even placed family photos with TLC on there as well. Music from the restaurant could be heard in our room, with a knob to adjust volume as we wanted it. Lowered for the Best Man's toast, and raised so that we could have our dance. \nBelieve me, we searched EVERYWHERE for the best place to have this dinner, and the price, service, quality of food and atmosphere didn't disappoint. It was a great memory we'll treasure always!", "type": "review", "business_id": "TwxHMCcRdF_CQb_EZ6kPQQ"}
{"votes": {"funny": 4, "useful": 2, "cool": 2}, "user_id": "WEmlezNzUnOs2O6F24q0SA", "review_id": "cgvQVn-8m-yMtdzCIMaIrw", "stars": 5, "date": "2009-07-15", "text": "We had one of the high end suites and my god, this place is classy! We had our own private entrance and elevators. Definitely felt where the dollars went! The room was $2300 or so per night and it had 3 tv's and an 8 to 10 person dining table, wet bar and two bathrooms. The view was toward the strip and it was spectacular! The concierge was very nice and the hookers were top of the line (lol JK about the last part).\n\nThe only place to stay IF:\n1. You are a baller\n2. You want to feel like a baller\n3. You just took out 5 credit cards just to stay here\n4. All of the above", "type": "review", "business_id": "u9wjRhUjySkHPa_hG3kFOg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pG25KnatbloNtKMXbO01AQ", "review_id": "2S1mprtlelbO9AuF0ogEAA", "stars": 5, "date": "2013-08-19", "text": "overall great hotel. Clean rooms, huge pools but most of all awesome buffet! My favorite in Vegas!", "type": "review", "business_id": "u9wjRhUjySkHPa_hG3kFOg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0SViI18xubu9lk-_U9uFYg", "review_id": "0LaV-ZyyFtcmZief37YSrw", "stars": 4, "date": "2010-11-09", "text": "We asked the front desk for recommendations near our hotel, and headed out on a Friday night with no particular expectations. Turns out that this is a divey little casino and bar.\n\nOnce I got past feeling way overdressed, my friends and I enjoyed the $5 blackjack, $1.75 draft beers, and karaoke with some talented locals. The song selection is fairly rich with classics but is a little hit or miss with Top 40 nonsense. For example, they had Paparazzi and Poker Face but nothing by Ke$ha and not a lot else from the charts.\n\nYou're better off sticking with a crowd pleaser, anyway. Try Total Eclipse of the Heart, as long as you don't accidentally start singing the literal version instead. (Ask me why I say that...)", "type": "review", "business_id": "tqu42L0qXzkvYKSruOz0IA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "4MRX1sz_4HGy4zYjKfH0Zw", "review_id": "seRkv13pjWRrefss6pWgPw", "stars": 3, "date": "2010-11-23", "text": "Go for the beer, stay for the...beer\n\nAfter a dismal fail on the part of Benihana at the hilton the night before, we asked a cab driver what was a good place to get a steak in vegas and he told us about Ellis island, so off we went the next night.\n\nThe place itself is on the whole, completely unimpressive.  Old decor, run down tables, and plugged with ripped red vinyl.  It kinda has the feel of what you would get if you crossed an old folks home for cigarette smokers with a casino.  At 36, I was well below the average age by a couple decades.  Not exactly \"happening\"..\n\nAnyways, during the long wait for our table (suprising considering the number of empty tables at the restaurant) we attempted to order a beer at the bar but got yelled at by the bartender for apparently daring to tread on the oh so sacred ground of the \"server station\".\n\nB$%## bartender aside, the hef was delicious - I don't normally go for foofier beers like that, but it really hit the spot, and at 1.75 for a 20 ounce microbrew, you just can't go wrong.\n\nOnce we got seated, our server didn't really speak english, but that was fine since apparently nobody orders anything but the prime rib there anyways.  I ordered my prime rib rare and it came out damn near still cold, so I was happy with that aspect of it, but I was not happy with the fact it was about 60%fat and gristle, and only about 40 percent actual meat.  The others at my table got better cuts tho, and hey, for 13 bucks including a 20 oz beer, you can't really complain.\n\nAl in a, a decent deal, and the beer we had was exceptionally good.  I'd eat there again.", "type": "review", "business_id": "tqu42L0qXzkvYKSruOz0IA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V4wXSqeDnHqcdDzKarxlrQ", "review_id": "StLFoyXEDMJIHNbCdDO9vw", "stars": 1, "date": "2014-06-11", "text": "We went in with a party of  four adult, 3 kids and 1 baby on 6/4/14. First of all the party was not helped right away, there was no wait as it was 9 PM. We had to ask for a high hair four times, and it finally arrived. We also had to wait for crackers which never arrived. The server was ok' but the other help was not there. The kids food came out at different times. The adult food was not cooked all the way through on the burger. The birthday cupcake was dried out and crunchy. We paid 93.54 for our meal not including tip. It was awful. We had to wait for boxes, refills and napkins after a spill. The staff was so into their conversations and cleaning that  the few tables in the establishment were ignored. The pest part is the guests on the receipt list four, hum? Time of close out was 10:39 and the ticket number is 30035.", "type": "review", "business_id": "sxRI0je6hAR-MeBDxdyhug"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XELx61A7TBQEeMhDs0oXSw", "review_id": "JRjpX_p1xfd5qWJT6jlDsg", "stars": 4, "date": "2009-09-29", "text": "My boyfriend took me here for my 21st birthday. It was a really fun place to have dinner. BF made special reservations to sit by the window so we can watch the Bellagio's water show that replays every 15mins. The food was way better than I thought and the view was amazing!  The waiter was very persuasive on getting us to order more, but everything at the end was very delicious. their souffle was delicious! it was warm with melting gooey chocolate! yumm!! Also the portion was huge. I order the rack of lamb and there were 4 LARGE pieces. Very generous with the portions. also i asked for medium rare and it was actually medium rare!", "type": "review", "business_id": "ASOiJ8MmbBTgK2D1_MQrqg"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "bCLFdVfkAiZ7t1xDskb66Q", "review_id": "jSo1yxjzmfrWXnzBwYG4PQ", "stars": 3, "date": "2013-12-20", "text": "I am quite snarky when it comes to considering Mexican food outside of my home state of Texas.  My coworker is obsessed with Macayo's, mainly because she is a Vegas native and grew up eating here.  She is really fond of it.  The restaurant itself is very large, and boasts a UNLV discount but it does not apply to any of the specials and we only go at lunch so I am not sure if it really works.\n\nIt is located right next to Metro Pizza off Tropicana just east of Maryland so it is easy to get to from campus.  All celebrations surrounding her happen here, so I have eaten here more than I expected to ever.  There are plenty of reasonably priced, filling lunch specials - a whole large menu page of them - but I always stick with the combinations.  There is a choice of one or two items for $8.59 or $9.59 and it comes with rice and beans or double of whatever one (I get double rice), plus a small shredded lettuce and diced tomato garnish.  The choices include chile rellenos, enchiladas, tamales, tacos, and probably a few other options.  \n\nI typically stick with the chicken enchilada and the green corn tamale covered in spicy tomatillo sauce which is quite wonderful.  These items are covered in cheese so if you are not big on cheese, let them know.  I am never wowed by the meal but it is a good average Mexican meal if you are craving one.  I can justify anything covered in green sauce and I can assure you can find something on the menu to satisfy you here.  Service is hit or miss.  Today lunch was smooth and very fast.  Complimentary chips and 2 salsas are included.  Remember, guac makes everything better but costs extra!", "type": "review", "business_id": "tqfMTmIZuURut8PkaCrlLw"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "yRubqnQy4ExPYTel7KsNog", "review_id": "ptpC_FV_xcpybsC4L4fUDQ", "stars": 4, "date": "2012-05-15", "text": "Stephanos's has been a staple of the UNLV dining scene for years. Located right across the street, from the Student Union, Stephano's offers some great and authentic Mediterranean and Middle Eastern food for students craving more than just generic burgers and sandwiches.\n\nStephano's is a great place to be adventurous in your selections if you are familiar with Mediterranean dishes, but if your new to the scene, you can't go wrong with the Beef & Lamb Gyros, or the Garlic Chicken sandwich. However, a MUST try are the fries and the baklava. I don't know what they do, but have some of the best fries in the city. Super crispy along with a tasty fry sauce make it a must-have when stop by here. The baklava is incredibly flakey with subtle hints of honey and nuts.\n\nThe restaurant itself is pretty standard. Coming in you see a variety of chairs and tables, and you walk up to the front counter where you place an order. It's a cross of a restaurant (the food is usually brought to you and it takes a while to make it fresh) and fast food (you order off a menu board, pay right away, and get your own drinks), Tucked away in the corner is a lounge/couch area where they used to serve hookah and drink. They got rid of hookah, but the area is still open to those who wish to lounge around.\n\nI consider the prices to be a big high for the UNLV/Student budget. At about $10 for a combo meal, its definitely approaching sit-down restaurant food prices. But I think its definitely worth at-least a try, especially if you are looking for real Mediterranean fare.", "type": "review", "business_id": "LsArM1PhbqvXK3lDK-Ch_w"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "M-O0tasOl0SGiUsxdO5cZw", "review_id": "6wWnpyy6vUSz79O6XOvnLQ", "stars": 4, "date": "2013-01-29", "text": "I've been to Casa a few times.  It's solid Mexican food with a good ambiance.  On the Friday night I went they had a live singer performing so that was a nice touch.  It was packed but we were seated quickly and served within five minutes of placing our order. Their menu is incredibly extensive with the typical combo plates you find at most Mexican places.  My first time having a Torta.  Mexican sandwich as described by the waiter.  No idea I had been missing out.  It was good and I didn't leave filling stuff like I usually do after a heavy Mexican meal.", "type": "review", "business_id": "gu5Yj92bnXnxNyMdxO14VA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "zcFouCXLluclZq0xK_M47Q", "review_id": "wTm-xratMAFesZcbA8JxZQ", "stars": 4, "date": "2012-11-29", "text": "Ya know, I didn't have high hopes upon entering this magical circus land cafe.\n\nBut - they sure did surprise me.\n\nThe soup - you must get the soup.  Homemade - and delicious.  \n\nThe reviews are all over the map for this here deli - and I gotta say that my experience was really quite pleasant.  Our server (I wish I remembered her name) was top notch.  She was so sweet and friendly and really made for a great dining experience.", "type": "review", "business_id": "HpSBHeixIP2YxLy4L1f-HA"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "l0izzNMbD2lL9xcOnnMEag", "review_id": "J4GAXg5rvQJNf1AZl1vP0A", "stars": 5, "date": "2013-05-13", "text": "I am so happy we decided to do the dinner the night before our kids wedding here.  We had Saki Bombers and a choice of a rice bowl, different sushi rolls and Teppanyaki.  You could have chicken, shrimp or steak.  Service was phenomenal with all the out of towners we had.  All of our guests had a fabulous experience here.  I do not think we could have asked for a better place.  \n\nSome guests did order wine and hard alcohol and my husband was a bit nervous for the bill.  He was pleasantly surprised and may I say very happy.  I cannot say enough good things about this restaurant.  It was a Saturday night to boot.  When we left the place was packed.\nNext time I visit my kids I will be sure to stop here for a bite and a saki bomber.  Oh they are so good and fun to drink.  Plus it gives you that nice little high.", "type": "review", "business_id": "uR2aNW75R4oYs9w7aw-_kQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "38BNIi0H7C98g_AjFcepJA", "review_id": "OoEA1DUZCIb1qjef-uh07w", "stars": 4, "date": "2012-02-06", "text": "Very fun place, especially for al fresco dining.   Good service and food.  A little pricey so couldn't afford to go for lunch daily but certainly every so often.\nHave always enjoyed the food and they are good with soft drink refills.  Gets a little more \"pick up joint\" at night so I usually stick with lunch.   \nThey have also done some theme dinners where they pair wine and serve a mutli-course chefs choice menu, the one's I've gone to have been outstanding and well worth the price.", "type": "review", "business_id": "E28ht8IEiO6FZbKktSo0Xw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "VCrJ1n2Le5feDjeIopbSUw", "review_id": "PeWGewkO3IdP56WoV0vS1Q", "stars": 5, "date": "2013-04-16", "text": "The food at Lotus of Siam was absolutely delicious. This was my first visit, but I'm already looking forward to eating here the next time I come to Vegas.\n\nMy favorite dish was Koong Char Num Plar: raw prawns served with lime, chili paste,  garlic slice, mint leaf, & a flavorful fish sauce. It was a simple dish with well balanced, complex flavors. \n\nI also ordered fried fish cakes (appetizer), panang (curry), and a jack fruit dish with fish (northern). For dessert I had fried banana & coconut ice cream. The bananas were wrapped in a sheet which reminded me of fried egg rolls; it was tasty and different than expected.", "type": "review", "business_id": "lliksv-tglfUz1T3B3vgvA"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "H7EK9nebtrHCiJY4k4gFiA", "review_id": "pIhO0BlKZESoO4tlZ9oAig", "stars": 5, "date": "2014-01-12", "text": "I just love this place. The drinks, food and atmosphere are perfect, and their Moscow Mule was the best I've ever had. \n\nWe stopped in for a drink before heading into Light, and wound up having some apps, a couple more drinks, and dessert. Everything was awesome! Will definitely be back asap. \n\nIf you're at Mandalay Bay, its definitely the meet up place.", "type": "review", "business_id": "rP76z9iDOFczywAiee-l7A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y05bv65OCTcZgB0GhO8_sA", "review_id": "2fzn3EYW-Ury0KfNa9GNMg", "stars": 5, "date": "2011-11-29", "text": "Love this place, walking into the front desk area, takes my breath away every time.  Seeing all the rich marbles and mosaics, love the look.  Here for a conference, and appreciated it in this venue, so I could stroll through one of my favorite casino's on the strip.  Perhaps one day I'll get to stay.", "type": "review", "business_id": "34uJtlPnKicSaX1V8_tu1A"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "dVfHA1-N2bM15R2c4Cthxg", "review_id": "lBM2MjkBbQxsrh3x80xzrA", "stars": 1, "date": "2014-07-03", "text": "I stayed at the Venetian for my birthday talk about horrible idea. The people were unbelievably rude.they had bed bugs I have a disgusting rash from staying there .they overcharged my credit card . It's overrated not worth the 2800 I spent staying at Venetian.  wish I would've stayed somewhere else not worth it the food is supposed to b delicious not even close horrible if u want to wait forever and be asked what you want then be ignored be my guest. I expected more . This place is full of people that don't care about you just trying to get a tip I agree the people at Wynn are nicer going to try it at the Wynn it seems not to have that dog eat dog attitude that everyone has at venetian has. the rash burns so bad should've listened to the people handing out flyers saying 88% of the beds and hotel rooms had bodily fluids . They tested sheets from Venetian 8 different peoples bodily fluid in one room save your money don't stay here", "type": "review", "business_id": "34uJtlPnKicSaX1V8_tu1A"}
{"votes": {"funny": 4, "useful": 8, "cool": 0}, "user_id": "8VWlVg0u_pGkhC0w0qn00Q", "review_id": "8bFhVYEN3rKGCWvM3YsFEw", "stars": 1, "date": "2013-07-27", "text": "Never ever again! \nZero stars!\n\nWe arrived late on Wednesday night 07/24 around 11pm or so.  We were told there are no non smoking rooms left, and despite booking one it is merely a request. This is supposed to be the hotel with the most rooms in Vegas. After getting upset, the guy spoke to his manager and miraculously \"found\" a room.\n\nUpon entering the room - it smelled... It was bad. The carpet was filthy... So much so that when my son took off his shoes his socks turned black.  The comforter on one of the beds had stains on it. \n\nAt this point, rather than complain, I figured I would just make do. It's late and it will get better right? So I simply remove the comforter cause I generally don't use it anyway. \n\nThe next morning when I wake up, there is something uncomfortable under my sheets bothering my back... What is it? A large bottle cap, in between the sheets and the mattress. So does that mean the sheets were not removed when the last guest stayed here?\n\nThursday, we left the room early in the am around 10am  Or so and  returned around 3 pm. The room was not cleaned yet, so we left. They had almost 6 hours to do so, and it wasn't done? Well it's a big hotel, I can get over it. We came back around 6, and it was finally done. Once it was finally done, guess what? The comforter was still there! Big surprise. So again, I just kicked it to the floor. \nOn Friday, we returned again around 3 or so and it wasnt cleaned. When housekeeping came, we sat in the room while they cleaned the room and even tipped her $5.00. I didn't even bother pointing out the comforter since I won't use it, I just asked for 1 extra towel. \nAgain, I usually don't complain. But I did watch her change the sheets. \n \nFriday night, we went to bed around 11. The connecting room next door was making a horrible amount of noise at midnight. Shouting, laughing, music. Me, my wife, and my kids could not sleep. We called the front desk and they took care of it. It started again around 2 am. I called again. And again they said they would take care of it. \nIt is a little after 4 am now - and guess what? They are doing it again. I call once again and  am assured it will be dealt with. Of course, we have not slept all night. And the woman on the phone offers us a food credit for our inconvenience. \n\nAre you kidding me?\n\nWe come to Vegas 4 times a year, literally. We have stayed all over the strip. We are also a family that travels a lot.\nWeekend trips, long vacations. So we know hotels. And honestly, we haven't had an experience like this bad before. \n\nThe funny thing is, I've been to this hotel\nMany times before to eat,\nBecause it houses some of the finest restaurants   in town. And I assumed that since that is the case, the hotel\nItself must be pretty amazing. L'altilier, Robuchon, and Craft Steak are 3 of my favorite restaurants  in Vegas. I've eaten at each place multiple times. These restaurants are simply too good for this place. \n\nThis hotel  is  horrible. And the worst part, No one cares. \n\nI check out in a few hours, and I will definitely complain. \n\n5am now and the guys next door are banging on something. I have come downstairs to complain to a manger - cause clearly calling 3 times doesn't work. There is no one here, and the guy went back to get his manager... It's been almost 10 minutes. \n\nDo yourself a favor, don't stay here. I know I won't be returning.\n\n\nSo last night, the night manager Cesar promised to comp the night that I had the problem with the unruly neighbors. This morning I go to the front desk to double check... And guess what, not only did they not do it, but allegedly they can't because I prepaid through a convention group I came with. All they can do is offer me a free upgrade upon my next stay (no chance in hell that will happen). They have to go through all the convention attendees accounts, all 6,000 of them, before they can offer a credit to the convention group who will then credit me. BS. Absolute crap. The day shift manager told me,  don't store cash and we have no means of crediting your credit card.... So this casino that deals in millions of dollars a day can't give me $189.00? Why didn't she just tell me the truth which is \"we at MGM grand would like to say F-U and think you for your shitty stay!\"", "type": "review", "business_id": "eWPFXL1Bmu1ImtIa2Rqliw"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "XdjsM0IZ1xv8e7eEPHGuVw", "review_id": "mpuktetP2AI77n0neTIx1w", "stars": 5, "date": "2011-07-04", "text": "Lovely.\n\nOnion soup was the best I've ever had. Not too salty or lack of flavor. Perfect.\nEscargot was actually quite delicious. It looks awful but definitely tastes better than it looks.\nScallops were heavenly. \nRib eye was succulent.\nWine was beautiful, especially the Beaujolais.\nService was wonderful. They even gave us a small cream puff ice cream dessert for our anniversary.\n\nDefinitely make a reservation to avoid the very long wait time because this seems like a hot spot for large groups.", "type": "review", "business_id": "4bEjOyTaDG24SY5TxsaUNQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Mac3De6NAHvrkRY7FwKcxg", "review_id": "03tLtUD1Uc3dyAI22Xe64g", "stars": 4, "date": "2011-06-23", "text": "Good buffet. I didn't stay as a guest though. I like the fake vanilla smell they pump through the casino. I'm not in Vegas now, but the thought of it takes me back.", "type": "review", "business_id": "NGJDjdiDJHmN2xxU7KauuA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "FAtcKASTgFvAS4k8LGxlwg", "review_id": "SflbVPJ0koUyHo-zL__Oow", "stars": 3, "date": "2011-04-13", "text": "My wife and I stayed here on our mini-honeymoon, and overall, I was unimpressed. She didn't mind our room as much as she minded the location of the Hotel (with regard to it's proximity to anything else). This place is just too damn far from anything cool (even the Vegas Monorail).\n\nI didn't think our room was worth the money we paid either, the room was at the very end of the hall completely opposite the elevator, so it took AGES to get to the door, especially when we were trashed. On top of that the furniture was beat up and the curtains were stuck part way open.\n\nThe beach is awesome, the lazy river wasn't exactly lazy (what with all the kids and pool toys), the wave pool was nice and warm, but the life guards are overbearing (\"Get behind the blue line!!!\" Ugh! Shutup!), and I got sick from the fried chicken at the To-Go Grill. The Shark-Reef is pretty great, which is a significant compliment, especially since I've been to the Monterey Bay Aquarium and Academy of Sciences.\n\nMost of our time was spent walking away from here because there wasn't any other entertainment at our hotel while we were there, which is stupid considering they have a giant convention center complex attached. The Mandalay Place shops are pretty weak too.\n\nIf you stay here, check out the Reef, Minus5 bar, and the beach. They are all pretty cool. Bring extra money for cabs, this place is at the VERY END of the strip; or if you have an aversion to cabs bring comfy shoes, take the free tram to Excalibur, then walk across Tropicana Ave. to New York New York, then across LV Blvd. to MGM Grand and then take the Monorail ($5 a passenger). \n\nI will mention, my wife got sick on the carpet and they didn't charge us to clean up. That was cool and probably their saving grace.", "type": "review", "business_id": "TWD8c5-P7w9v-2KX_GSNZQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ozQY00OgMbqzqXF_PvVlKg", "review_id": "miaO2ntMnT3HymZOF3ufvw", "stars": 4, "date": "2011-06-13", "text": "Really nice hotel. Comfortable room. AWESOME pool...or should I say pools. The wave pool and the lazy river are 2 reasons to stay there. \n\nThe room itself was nice. We got a king bed with a view of the pool which came in handy when we wanted to see how full the pool was. FYI if you go to the pool go when it opens because it'll get mad packed. It opened at 8am and was packed by like 10am no joke. \n\nThe only thing I didn't really like IMO was the bathroom. You have to get used to no privacy. lol. The shower and toilet are separated. If you're claustrophobic forget using the toilet. And if you like privacy in the bathroom you can forget that too because who ever's staying with you can totally see you through both the window AND the door.", "type": "review", "business_id": "TWD8c5-P7w9v-2KX_GSNZQ"}
{"votes": {"funny": 2, "useful": 2, "cool": 3}, "user_id": "dOlOuHlY43omhi88wa1Mzg", "review_id": "vE1ABzotAS0ol9YG_9j3Xg", "stars": 4, "date": "2009-01-08", "text": "I have a pretty similar experience with Jenn H. in that the first time I came, I wasn't impressed at all (I'd probably say that I was disappointed), but the second time I came, I really enjoyed this funky fusion.\n\nI came here on the recommendation of a friend that had came here a few years earlier on a road trip that passed through Phoenix. Not really knowing how the menu worked, I just ordered the \"Jade Red Chicken\" rice bowl because it was supposed to be the most popular item on the menu. I was pretty disappointed when I found out that I had gone all the way to Phoenix (for the Fiesta Bowl) for a bowl of General Tso's chicken with white rice. As I was eating I saw people order eating some pretty wild stuff (like chinese bbq pork \"char siu\" quesadillas, etc.) so I was pretty adamant about coming back and trying this place again. \n\nI got a chance to go back two days later and instead of getting a rice bowl, I got the combo where you can choose two items off the menu (and turn them into a burrito/quesadillas if you'd like) along with rice of your choice and beans. So I got the jade red chicken again (this time in a quesadillas) and then I got the emerald chicken, which a buddy of mine had last time and looked good, along with jerk fried rice and black beans. \n\nBeing both a fan of chinese and mexican cuisine (in the traditional sense), I knew that this place was going to challenge my view of food marrying the two together. But I actually really enjoyed it. I should strongly stress the point that you need to \"get\" the menu before you should order. The staff is pretty nice about explaining the concept of the menu to you (it'd help if you ask, which I didn't the first time until AFTER I ordered). \n\nWith the freedom in the menu, however, I should probably warn my fellow Yelp!ers that I can see how some of these combination can go wrong and come back and blow up on you (or maybe inside of you, hahaha). Good luck mixing!!", "type": "review", "business_id": "Zx8_4zKdDBSO3qGrkukBIA"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "k5p3YP1ZjCa8ZS3xqXgBug", "review_id": "4oV_iEKPEesy42N9Lond7w", "stars": 4, "date": "2012-08-31", "text": "This was my second time at RM Seafood, but first at their downstairs (more casual) spot. After my experience upstairs I had no desire to come here again but the wife wanted to give it another try and it changed my opinion for the better. We had our kid with us and they didn't seem to mind. Of course they sat us on their \"patio\" in the hallway overlooking the escalators to Mandalay Place, but that was understandable. The inside looked too quiet for us anyway.\n\nThere's no kid menu, but they were happy to make a plain, grilled chicken breast for our son. He deemed it the best chicken he's ever had. At $17 for a kid-sized portion, it better be.\n\nOur food was excellent all around. The half dozen Kumumoto oysters ($23) were meaty, mild and delicious. My wife's order of steak tartare ($21) and ringo roll ($24 / spicy tuna, apple, jalapeños, tuna, cobia, spicy garlic ponzu, kabayaki sauce) were nearly flawless, albeit expensive even for the Strip. My black cod ($32 / bok choy, candied kumquats) was one of the best pieces of fish I've had with its flaky and fresh meat, cracker-like, crispy skin, and delectable sauce. Even the cornbread and crackers in the bread basket were great. The cornbread, by the way, came in handy for soaking up the sauce from my dish.\n\nI'd be happy to recommend this place now. But bring a fat wallet because it's not cheap. Some might even complain about portion sizes, which lean towards the smaller size, but I wasn't looking to stuff my face silly this night.", "type": "review", "business_id": "ggoYlZeQhATwb_yGSntfdw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "yYTBxv_cuoUCt1GqWCPY0Q", "review_id": "bVGj-vjSymlqZPTyV6cwkw", "stars": 4, "date": "2008-11-11", "text": "Never been here with the girls but I've been a few times with my fiance.  This place is great if you don't want to deal with some of the bigger ultra clubs.  The line wasn't long and I've always gotten in for free and my fiance has gotten in for half price cover, I think $10 bucks or so.  Make sure you grab a free pass in the lobby, just strut your stuff and should be easy.\nIt's tiny but has ample room for dancing or just watching drunk chicks make fools of themselves on the VIP tables on either side of the dance floor.  \nThe music is great & the DJ was hotttt.  Tabu has a wrap around bar and plenty of room to stand and drink.  The lower side also had a few chairs to pull up.  The bartenders (both male and female) were very nice and poured stiff drinks.  The drinks are slightly cheaper compared to other mega-clubs and other ultra lounges (like Blush).  The ambiance is cool and refreshing.  The back wall has projected images that change colors, textures and pictures.  It's a little bit of a trip after a few hours of drinking!\nI would definitely recommend this place if you are looking for an alternative to a mega-club (ie. Jet, Tao, Pure etc.).  Great place to dance and drink.  Tabu never disappoints.  Check it out if you are looking for an alternative to the usual clubs.", "type": "review", "business_id": "KZfhb_wZj1qqKMJIN0PF7Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "upkrxhgYV9MnmIVQoNu0ug", "review_id": "hGUoOIJjCkEySHzl0ZxI3Q", "stars": 5, "date": "2010-11-12", "text": "I was at TI for a conference and we were looking for a place to grab a bite to eat.  \n\nWe opted to come here because it wasn't too busy at the time and it had a warm and inviting atmosphere. \n\nWe both got chopped chicken salads and they were the BEST!!  A few beers and a glass of wine where all we needed.   \n\nLater a group of us from the conference went back in the evening AGAIN... and loved the soup as well!!!    Nachos are good with a few different salsas!!!\n\nDuring the third day of the conference I over heard some others talking about the Soup and Salads here and how they wanted to go again!\n\nI loved it!!! YUMMMMMMMMMM", "type": "review", "business_id": "Txg5Xo0njHL3-raZTqCNTw"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "tHz9cWxwSfcP4qRaPIHvww", "review_id": "O0wgKDUb0gKbCGFsHNA3Dg", "stars": 5, "date": "2013-01-11", "text": "This is one of the first places I ever tried when I first moved to the valley in 2005 and it is still one of my favorite places to get a sweet treat. I have taken numerous friends and family here to try their gelato and experience a little bit of heaven. The gelato is that good! My favorite is their Pokett Coffee as it tastes just as strong as real coffee but sweet and creamy. Mmm. It's great alone, as a shake, or in a cone.  I've also had it as a cake! The Gelato Spot makes great special occasion cakes. You can choose 1 or 2 flavors and they come out great. You'll definitely impress if you bring one of these!\n\nThe location is great as well. After finishing up a great meal at Delux Burger, head over to Gelato Spot. (I've never had dessert at Delux Burger because The Gelato Spot is that tempting!) Definitely give The Gelato Spot a try or try any of their other locations. You won't be disappointed.", "type": "review", "business_id": "seu8O6yPQ5Yz8kQv-KFnKQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "kQB4ehCN0ERRe2ZUjrnCUg", "review_id": "SoM3VLvrvZPrsgVUoYiIsQ", "stars": 5, "date": "2014-04-29", "text": "Great atmosphere. Fun place", "type": "review", "business_id": "EWMwV5V9BxNs_U6nNVMeqw"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "o7vfrGX-QW1rFafRh20kBQ", "review_id": "OdcCS_SkTaLl-9biVmisrQ", "stars": 1, "date": "2014-03-21", "text": "Horrible,  horrible,  horrible.  No minibar, no luggage rack, dirty.  As an independent female traveler, very unsafe. Gum in the peephole. Drain backed up in shower. Horrible place. Will Never stay there again.", "type": "review", "business_id": "DzL4cUt5AVYRzzT7DHOgxg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2Kl_B9GPDYGlHREZQ3BjBA", "review_id": "92RlmK0ealah0SYgmGn9FQ", "stars": 5, "date": "2013-09-03", "text": "Saw this show four times in a span of couple years.\nAlways great fun.\nThere are some new twists since they moved to the Monte Carlo Hotels and Casino.\nWill definitely attend the show again one of these days.", "type": "review", "business_id": "gRGR8p5pCFT9Pho4VXcMDg"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "SEDFpR4oMPKqXMjbJiMGog", "review_id": "FYVuUaUctLQNicNf1401iQ", "stars": 4, "date": "2012-06-04", "text": "I like short ribs...If you like short ribs have it here also?!   I would eat here more often if:\n\n1. I had more cash, can get spendy if you ate here everyday\n2. I live an hour away...\n \nI need to get a job by 40th street, this is a MUST dine location.  You should be happy with just about anything you order here.  This is on my top 10 list......", "type": "review", "business_id": "3oZcTGb_oDHGwZFiP-7kxQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "8k8NiRHw9bOLE1lEpfOzVw", "review_id": "CKWJvO88HQ0BpSvsMDSRtg", "stars": 5, "date": "2013-09-02", "text": "Went Friday night, and was very pleased with some of the minor tweaks they have made.\n\nAs usual, the best prime rib in town for under $50 a plate.  Must order Bone In (BeefEater Cut) and Cajun Blackened.  The Blackened makes your order naturally come out 1 degree more done than you order, so if you like medium rare prime rib, order rare.\n\nThey have upgraded the stemware and the wine list, points I had noted in prior reviews through the casino surveys and on yelp.  Bravo.  Its the Orleans, so its not ultra high end fine dining, but its good food at great prices, with a decent atmosphere.  Tough to beat. \n\nIf you like prime rib, you really need to try the cajun rubbed bone in.  Its just amazing.  Comes with a salad and a potato.  The \"loaded\" baked potato is prepared tableside, a nice touch.  Continuous management overseeing this place and keeping it ship shape - I have seen the same manager here for at least the 8 years that I have been coming here.", "type": "review", "business_id": "KlAARyLySLdoyT8QxJFSIg"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "AvzoWeiZ1yMZKlYU8jB2PA", "review_id": "Fm78YH2Qggw-4uDhO29Yjw", "stars": 2, "date": "2010-03-11", "text": "There ought to be a law prohibiting Greek restaurants from going corporate.  I expect my Greek restaurants to be family owned and run by ugly, hairy, overweight Greeks (this includes the men and the women).  In fact, the uglier the better, as I suspect there is an inverse relationship between the quality of Greek food and \"looks\" of the restauranteur.  Wasn't there a movie about fat Greeks who owned a diner.... wait... I need to grab some Windex I'm getting a pimple.\n\nAnyway, Daphne's proves my point.  I was in the mood for meat, bread and french fries and Daphne's was nearby.  I would call my gyro a \"styro-gyro\".  The meat was cold and tasteless and had been carved hours earlier.  The pita bread reminded me of an old sun rotted Frisbee that sat on the side of the house all summer.  It crumbled into pieces.  The french fries were hot, but I could taste the frozen bag they came in.  The only high point is that they offer this really tasty diet Soba grapefruit flavored drink at their soda fountain.  That was one tasty diet drink.  Oopah!", "type": "review", "business_id": "t4pkeGscooStLjy-Js5Byw"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "yf12P_T0AKLNzFt12zj16g", "review_id": "_gHwBM3iJZBW6X4iW4aKzQ", "stars": 4, "date": "2007-05-14", "text": "Totally not a place I'd choose to go but with lots of tequila, this place is fun. I had friends in from out of town who were staying at the Flamingo so this was considered stumbling distance to their room. It's like being on Bourbon street. Stinking drunk.\n\nPersonally, I'd rather you just pour me a damn drink and enough with the flair bartending. But I did come across an Asian bartender who poured a good shot of Patron for me so I went back there a second night and stood right in front of him for most of the night.\n\nLots of eye candy. Top 40 music. Bring your sense of humor. It's what will get you by.", "type": "review", "business_id": "XNtSLbyznmRpoTtM0v0cjg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "eelWS7zIYMM7ci7dEd7MCg", "review_id": "mDteEquawjTnClsXo0uzrw", "stars": 1, "date": "2010-04-01", "text": "As you walk in, you think that with so much seafood you can't eat anything wrong. WRONG! \n\nI have eaten here twice and ended up with the worst food poisoning each time. First time I though I was just sick but few months later when back in Vegas, we came here again since my friends wanted to do the Seafood Buffet. It happened again. \n\nI have no idea what is in the food or how fresh it is that makes me sick every time. On the second trip 2 other friends also got sick. \n\nI don't know what others experience is but I am not coming back. The casino is fun but this Buffet makes me too ill to return.", "type": "review", "business_id": "tn5SXZvWiT-uVsjXLGSrww"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "dYHC53mBpvVcaWKdosomaw", "review_id": "zGyYVjic52Nsl-6LYqthkQ", "stars": 4, "date": "2012-01-17", "text": "This place was perfect for brunch. The restaurant is pretty big and clean. Our party of 3 had to wait about 10 minutes to get seated, and we were eating before we even knew it! The portions are HUGE so sharing would be a good option. \n\nWe ordered the fried chicken & waffle (the best), the eggs Benedict that had bacon and biscuits and a million other things on it (too much, too heavy), and banana cinnamon french toast (yummy but also a huge portion). Our waitress was super friendly and helpful in making our decision and the food came out really quickly.\n\nI'd recommend this place over a buffet. Can't go wrong with a place that has tons of celebrity pictures on their wall, and they were even on Man vs. Food!", "type": "review", "business_id": "xfwRO04KbAPw_zRotCfWQQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0JC7aBkxhV8by4iVGCU5Wg", "review_id": "Fb69tzidW0YL3aK_OBlDZg", "stars": 5, "date": "2009-06-18", "text": "Joe's is about as pretty as a picnic basket in the grass! They have a wonderful pastoral outdoor seating area. The inside is redneck delux. Big Long Booths, soft lighting and a John Deer Tractor. \n\nI always get the Pulled Pork Sandwich or the pecan smoked turkey when I come here. They make really good Beans and the cheese potato thing they have is good as well.\n\nThey sell old-fashioned sodas in glass bottles, which I love. \n\nThe dining room is HUGE and this place could easily accomodate a LARGE party\n\nThe food is served cafeteria style, but the quality of the food is way beyond.", "type": "review", "business_id": "5VMajxduxfLPSyQkVFKESg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WjA6C-WiQp416mFZuw4wiQ", "review_id": "yP-Qheo57DtUh46_NzYmNg", "stars": 4, "date": "2012-11-21", "text": "I remember coming here when I was a kid and OMG it was so cool I like the fact the whole atmosphere was so different than any other place I eaten at mostly because it has the \"grown-up\" feeling. It normally a dim-lighted restaurant, and whenever it get crowded it get loud. The food were good and I can't remember their price because I couldn't help checking out the look of this place and some of the thing they have like the brew machine, bar, television, etc. Sometime I would stop by here right after the Mayday festival or just to eat.", "type": "review", "business_id": "U87W6T9vjwWnp28Zjnn4pQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CjRxbxRwXYnQvfQqe1PhSw", "review_id": "BOk6xnIcmcBEr8eP01AM2Q", "stars": 4, "date": "2011-10-07", "text": "One of my favorite places in PHX. \n\nBeer, Wine and Food menu's are always interesting. I like the coziness of the place. \n\nI've never had a bad experience here. \n\nIf you're around... just grab a drink here and judge it for yourself. Just be weary of being here on the first Friday of the month.", "type": "review", "business_id": "7cP7WFmWiTVh-raIL3N_Vw"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "J3Vn9a7ipTBYnMkbbPOYqA", "review_id": "lDxnAf2Es-igIDqbckQFRw", "stars": 1, "date": "2014-01-18", "text": "The selections of dishes offered have minimal variety, especially compared to the other buffets. \n\nThe quality of the food is basic :/. At best, it tastes like good cafeteria food. \n\nHowever my biggest complaint is that both my sister and I got food poisoning after eating there for brunch/lunch. I think it was the crab legs (which were dry and salty) :( :(", "type": "review", "business_id": "Gn7bMxhZgY0bivsthvJWJQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vj01LXtnk1DhG5erxE8uug", "review_id": "g3v68HnPtGnb9liu-Si1MQ", "stars": 5, "date": "2013-04-19", "text": "Great show.  My kids loved it.", "type": "review", "business_id": "IwFpnIKo8xCVvoUCwluoXA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GPKG4ep927r_Gtg2ac3ikQ", "review_id": "0wevWuKFgl3tJduSBh9JIg", "stars": 4, "date": "2013-04-23", "text": "Attentive and friendly service. Cheap drinks and Guinness on tap. Happy camper gotta come back for some karoake.  Not too smokey either.", "type": "review", "business_id": "cv_uJSULux8eV09k3oc3zg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Kf77TWS2HOJCRFl-fLiueg", "review_id": "upEpfh7v_rlf0UOB8RIpeg", "stars": 5, "date": "2011-10-30", "text": "I love the sports book. Not smokey.", "type": "review", "business_id": "y4Qyf4PPSOHdQFTr3Zi_KA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Mwqg2idMELX87TRGvi6bPQ", "review_id": "NLdAXopdUiTyjayPqbj83g", "stars": 5, "date": "2013-09-11", "text": "I really appreciate a place that is open 24-hours a day!! The service was friendly, and fast! They had a plethora of blended drinks, which i loved! They also offer hookah so.....if you wanted, that was definitely an option.", "type": "review", "business_id": "Pt5AYjhzoU93biVeVahLKw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lHHwLi_YZuDSfdlSShFkug", "review_id": "D6G1h7tYVVXoUpXuqDrXEg", "stars": 4, "date": "2011-07-10", "text": "Great produce selection, both common (apples, oranges, tomatoes,etc.) to the more uncommon and exotic(jackfruit, durian, lychee, dragonfruit)\n\nLike you can find everything for a house at Home Depot, you can find everything you need here to throw a Filipino Fiesta!\n\nI usually just shop here for Filipino dessert ingredients and hardly anything perishable because when we make a stop here, we're out and about and not on the way home....ALOHA!!!", "type": "review", "business_id": "bkm38p8gjvYqzNROj3oYrQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "LWAZxNJqQGLFEiO0ccMLgA", "review_id": "X4TngwQzVnx5m_s3w8W76g", "stars": 5, "date": "2014-06-06", "text": "I ordered the pine nut salad, tomato soup and also have had the mac and cheese (kids size).  Everything was delicious! The location is in the middle of a strip mall (next to orange theory) which I think is a little crowded, however the ambiance inside is great!  They have eating outside as well if you would like.", "type": "review", "business_id": "8UTQX1Yz069EFNiAYqIYPA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IE8F867_fNTcPNmj4tSoAA", "review_id": "wM88PP1U2DHNCnY6ss7c3A", "stars": 2, "date": "2013-09-24", "text": "We have been going to N. Scottsdale Pediatrics ever since our kids were little.  The reason for two stars and maybe it should be one is for one goof up.  To me a doctor can never afford to make a mistake.  My daughter went for a bunch of tests and it came back that she was Anemic so we were told to start her on Iron pills.  The week before we got all the blood work tests back the Dr. told us to start giving her an Anti- Acid which we did.  In their notes it should of shown that she was told to take an anti-acid pill and that you should never give an anit-acid and Iron pill together.  Luckily my wife read the bottle and information.  They need to be more careful.", "type": "review", "business_id": "lc6jdu6Mvix9lVrxYsMd3A"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "q09g5dIdYSDArnHjK2ov0Q", "review_id": "N_JlsFliD1_xpD0VP2TL6g", "stars": 3, "date": "2012-06-14", "text": "I would give it one star just for being Walmart. Ok during the day, the night is insane. Wild lines that cascade into the clothing section. The key machines been broken a week and they don't take returns after 10. Walmarts morals are just scary, but I'm reviewing it for what it is, a Walmart.", "type": "review", "business_id": "PTnDDyk88QsMMVedFw6YDg"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "m3yjdgsORnaY8yOkhUbTwA", "review_id": "w6lb5VwjQNb_lIQeYo90uQ", "stars": 5, "date": "2013-03-29", "text": "Being an out-of-state landlord can be stressful when you get a random phone call from your tenant saying the garbage disposal is gushing water. I jumped on CraigsList and found ad ad for PlumbSmart and gave them a call. Usually I call a couple different places but they were very nice on the phone and their price to come and replace the disposal on that very same day was very good (granted its my first go-round with a disposal).\n\nThe technician was late for the appointment, but he did give my tenant a heads up so I won't take away a star for that. Communication is key. He fixed up the disposal quickly and my tenant said he was a very nice guy.\n\nI'll keep their number handy for any future issues I may have with my rentals.", "type": "review", "business_id": "wyfK_c7Sqh4bYi2hdHOlRw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hON6ftBpdDARgE6NQSV9qg", "review_id": "9BiYPfafH4fO4VFegHxnZA", "stars": 5, "date": "2014-06-28", "text": "Still such a friendly and delicious place! The pick 3 combo is amazing and the wings and pizza are the best in town!!", "type": "review", "business_id": "rkIK55cyfE8al9yub-4YHQ"}
{"votes": {"funny": 5, "useful": 4, "cool": 3}, "user_id": "SC_bFYaDgDub7tDjKCvV_g", "review_id": "1MqCnQEb5XQCKtOfrQ-sjQ", "stars": 5, "date": "2010-03-08", "text": "This places is miles above the Filiberto's, Ariberto's, or any other widget-bertos that you come across in the great state of AZ. Like many of the reviews have said, the tortillas are soft and chewy and thoroughly delicious. I work right around the corner from this place, and it is incredibly crowded at lunchtime. May fav is the bean and potato burrito - just the tastiest thing. I know you are thinking - potato? In a burrito... but it's good I promise!\n\nI have a very sensitive stomach.. this might be TMI but my friends always make fun of \"Grandma\" that can't eat at crappy food establishments.. i.e. Jack 'n the Box because \"remember that one time we went there and then went straight to Disneyland? Michelle almost lost it on Space Mountain!\"\n\nI can't eat at a lot of mexican joints that will \"tear you up\" as my guy friends say... and this place doesn't do that! So, for that, you get 5 stars Carolinas!", "type": "review", "business_id": "oyzxIqrtzu-8sWlPhJVsLw"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "hF_7YHHEL8YJp9QlqCuzzQ", "review_id": "3Qc7rIVr_EX_N5ecYk65nA", "stars": 4, "date": "2012-03-24", "text": "Nothing fancy here -- good-sized standard Italian dinners at reasonable prices in a family atmosphere. They have a handful of basic sauces that they put on a wide variety of dishes, ranging from fish to chicken to meat, as well as their homemade pasta.\n\nA standout is the grilled vegetable salad. Sounds pretty ordinary on its face, but they do a great job with a healthy mix of carrots, zucchini and peppers. \n\nThe eggplant parm was solid -- several slices of eggplant smothered in mozzarella. Another diner at our table had the housemade sausages (sweet) with homemade fettucine, which also got good reviews. \n\nThe wine list is short (with a shortage of Italian wines with the except of three Chianti's) but well priced.\n\nOur waitress said she'd been there with Nicks for 15 years, so she knew the menu inside out and winked when we ordered things she hinted were good. Gotta like that.", "type": "review", "business_id": "2RusLQcgpQ2BajF_1zevKg"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "QPSq3SwbTZbTB1dx6Ms2Lw", "review_id": "xrkx5j-dj03gUY_OU7hRzw", "stars": 3, "date": "2011-08-16", "text": "Kinda ghetto on the outside... and inside... \n\nNo vegetarian option", "type": "review", "business_id": "8Mb6nc1Qt0cXWue67DJ1aw"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "L_yn1EAReyN75rtM90DI3w", "review_id": "bkX9IeHO5b2Q-TvSmADQLA", "stars": 5, "date": "2013-07-29", "text": "Been a patient for years. Always top notch dental service and customer service. Every time you walk in you are welcomed warmly and the facility has a nice calming and relaxing feel to it.", "type": "review", "business_id": "4_w2iK2UdW1SlAFN9v3mKQ"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "PZOSzR6fS3utCB9UlLXs-Q", "review_id": "FdJdbXj_tDmzybO0cuEhUg", "stars": 4, "date": "2011-11-04", "text": "When I am craving Greek food, this is the place I come to. The Big Fat Gyro is the best Gyro I have had in town, not lacking in anything. Have you ever had a Gyro and thought that if it only had more of something then it would be better? Not the case here, the name explains it all. Its big, its fat, and it is yummy. \n\nThere are also a lot of other sandwiches stuffed and sides. My favorite side from here is the Dolmades. There were canned Dolmades on a shelf and I'm not sure if that's what they are serving but it definitely tastes better than any of the other places.\n\nIt's not the cheapest Mediterranean food joint but it the food justifies the prices IMO. So far I haven't had anything better along the lines of Mediterranean fast food so this is my top pick for now.", "type": "review", "business_id": "cmf4fKU9D6XIvciQj7RjoQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "NLW-D52mOyOiBk6V_8PFAw", "review_id": "u9KW3gudRFpnJ5DM2S7yxg", "stars": 4, "date": "2012-07-05", "text": "All around great dry cleaners with very friendly staff! We've tried several other dry cleaners in the Anthem area and have found most to be pricey and lacking in quality /attention to detail. Thrift D-Lux has regular monthly coupons available on their website, which is a nice bonus to help keep costs down. Next day service is nice, too!", "type": "review", "business_id": "qyZem1ZjjLKhynVMeeGUtw"}
{"votes": {"funny": 12, "useful": 13, "cool": 13}, "user_id": "_46Sn7OmqF-odwJgfyPESw", "review_id": "1_PvTpm6vGAjhyLDekvgWA", "stars": 5, "date": "2013-01-07", "text": "Not much you can really review about a gas station. However, I must say that I was impressed that they had my change ready for me after I was done pumping. I didn't even have to ask. So yes, I like this place. I will return.", "type": "review", "business_id": "Bwr0I53MplzKMVXB-PBThg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JAEDSGEUmplj9E9DXsQCDA", "review_id": "HqmFpNRY_uTsX5UOkduovA", "stars": 4, "date": "2013-12-24", "text": "If you are a gambler, don't choose Trump. They don't have casino like other hotels. Other than that, trump can give you the best experience. Please book the suite. It is just amazing. There are two bathrooms in the suite. The jacuzzi is huge and the window is facing The Venetian Hotel. They have shuttle to the strip and they also have personal owner vehicle which you can just tip them instead of paying taxi fee. I have stayed with more than two hundreds hotel, but I have to say Trump has the best customer service. Trust me, you won't regret to stay with trump=D btw, they are very close to the Mall=P", "type": "review", "business_id": "eP9T-2a94ChFAl1Rd2R0jg"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "GBPEA07x_XnTi366qTrjjw", "review_id": "Y_GypnMEtmSuoNEuWGJyCQ", "stars": 5, "date": "2011-05-05", "text": "RED VELVET.  My last trip here my credit card got declined, luckily my friend spotted me for the $38 cupcape order I made.  Luckily I moved to NYC where there's no shortage of good cupcake shops.", "type": "review", "business_id": "AqbgC7Gul5Es1rRzGNLDFA"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "QXmRXXAJ7Gt0WrBiKjqGlA", "review_id": "7xvOu3tXOI7mSsqthR37_g", "stars": 5, "date": "2013-05-24", "text": "I no longer shop at Albertson's, Vons or (gasp) Walmart for my meaty needs. This butcher shop is the business! We have purchased tri-tip, filets, sausage, chicken and more from this shop and we have NEVER been disappointed in the quality of the product. Now if my boyfriend accidently burns it.....that's another issue ;)\n\nThey are a little bit pricey but you get what you pay for. If you want a filet that tastes like buuuuuu-tah then you have to shell out a little bit more. Also, I do love how they are so accommodating. If I need a certain thickness on my steak, they cut it. If I want fat trimmed off my tri-tip, they trim it off for me. If I want chicken breasts pounded out for chicken parm, they pound it out. You won't find that kind of service at Albertson's.", "type": "review", "business_id": "vzfW1a3gaIRkwfvAcwveZg"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "UH2uRtQ3dvl1HW5CaMhuCQ", "review_id": "fxjIo9KQNLB1vrkzdVOKNQ", "stars": 5, "date": "2012-07-17", "text": "I used Executive for an airport pick up when i was in Vegas for the 4th. They were punctual and the town car was in great condition. The driver was really friendly and they played good music. They also gave us cold waters which was nice because it was HOT outside. Saturday night we scheduled a pick up at TI with their Hummer Limo..again punctual and the new driver was super friendly. We picked up our group at Cosmopolitan then they dropped us off at Bellagio..since it was fight weekend and 4th of July weekend the strip was packed so we had a mini dance party in the Hummer limo on our way because it took a while. Driving that Hummer limo  would be tough but our driver was awesome and so patient. \nI actually made a booking error and scheduled a pick up Sunday morning at 9:15 when it should have been 8:15.. the company picked up on our flight time and when I called at 8 hoping they could accommodate my error the dispatch said the town car was already in route. Talk about service. Love this company. Will use them next time I am in Vegas. \nAlso, very reasonable prices!", "type": "review", "business_id": "kTbWwRo7wq0DU1KV5GbtTw"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "DBCgOkxxF3AhSKDAqQcR7g", "review_id": "amO7yTbicsQbnzDWPwnXbQ", "stars": 4, "date": "2007-09-12", "text": "I must disclose that I am involved with this restaurant. But I can still review it, I hope, since I have nothing to do with the food or the service. \n\nI was a little doubtful of how, exactly, the interior was going to work. Cool, but it can be confusing the first time around. The food was decent when it first opened, but has improved considerably! I love, love their buttermilk chicken. It's delicious. Everything is fresh and intriguing and locally grown/prepared when possible. \n\nThe staff isn't your stereotypical Scottsdale service, I think they're more down-to-Earth and welcoming, which is great. I wish I worked closer so I could pop in to pick up breakfast. \n\nI'm still wondering what they're going to do about those copper tables outside, though. They get scorching hot during the day.", "type": "review", "business_id": "voHJIbWq-lRjWpv1hlSWig"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jA-G3OhCBX89WxCGPblFTw", "review_id": "UNpynfkO8La5zMwlFw88qg", "stars": 1, "date": "2013-12-04", "text": "I like the ambiance at this restaurant.  However, the service is poor!  My sister & I  went in on Saturday, November 30 & it was not busy.  We ordered a couple of cokes & nachos.  It took over a 1/2 hour to get the nachos - when they were served to us it was served on a tiny plate.  I'm thinking really??  this is $9?  This is the 3rd time we've been there & had lousy service.  The woman who was at a table next to us had also ordered nachos & her plate was huge!  Not recommending!", "type": "review", "business_id": "rjm5zAnCJ8Cxg0wb1CxtMg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "S7ieNs_byhnXIvENIqibEQ", "review_id": "q5XyATVIOyKcbURIEd8eYQ", "stars": 5, "date": "2010-09-28", "text": "Awesome local Gelato place.  Flavors are really diverse, and quality was great!!!!", "type": "review", "business_id": "yS19qXlnvF-cWIGMIMSoRg"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "Qa2arVXyiHhxRM6HqUfEVw", "review_id": "JTzH7QLgXMwgih-Q6eswQQ", "stars": 1, "date": "2008-09-04", "text": "WORST CHEESESTEAK EVER! \n\nNote that you cannot get it without Onions or Green Peppers because, and I quote, \"it's mixed in.\" Um, OK. So, I took a shot. What I got was a cold roll with some sweet tasting, room temperature, pressed meat in it, mashed up with some Onions or Green Peppers, topped with no cheese that was apparent to the naked eye (or could be tasted), and some shredded lettuce and tomatoes. By comparison, the Steak-Um product that you can get in your grocer's freezer section is FINE DINING. \n\nSTAY FAR, FAR AWAY FROM THIS PLACE! We never throw away food, and this went straight into the trash in favor of frozen burritos.... UGH!", "type": "review", "business_id": "4oBF6f3NiCYF5VYd8WaELw"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "EGYsEnvxDxRBTk6VC1JyWw", "review_id": "NtVaQgEla3Bqeiz2EgHXYQ", "stars": 5, "date": "2012-07-02", "text": "Earl's is pretty much the only thing that can get me up in the morning after a long and crazy vegas night.\n\nThe Original sandwich is my absolute favorite sandwich on the planet. Insanely tasty bread, roast beef cooked to perfection, melted cheese, and creamy horseradish sauce (mayo and horseradish, essentially). It's simple, yet SO delicious.  I can eat this sandwich for every meal when i'm in Vegas...I say this not for dramatic effect, but because I really can...and I pretty much have.\n\nThe price is right and, though i can't speak for the quality of the rest of the sandwiches, the Original is so freaking tasty it doesn't matter what else is even on the menu.", "type": "review", "business_id": "2e2e7WgqU1BnpxmQL5jbfw"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "o5ScDaCaaXXfoNFDYzUHZA", "review_id": "cNGxQWPD8qDAJlFAcqixuA", "stars": 1, "date": "2011-11-08", "text": "1 star?  Why?  2 Words - FOOD POISONING on the night of 11/05/2011\n\nTotally ruined my last date night with my wife before I deploy for the military when you are praying to the porcelain gods hurling with nori blowing out of your nose...graphic I know...\n\n\nTo top it off, the rolls were mediocre compared to Sushi Twister and Sushi Xtreme and the service was slow for the amount of people in the restaurant.  \n\nWhat are my credentials to be badmouthing this \"highly\" rated yelp institution?  5 years living on Honolulu and knowing what sushi restaurants are supposed to taste like, but what do I know...uggh worst night ever afterwards SMH", "type": "review", "business_id": "lPh02W25cOrAz57UbTpbFQ"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "g6rlp5No6GjEDXkrjvg1kQ", "review_id": "SJTlyjqhli72hbGtqoGNrQ", "stars": 5, "date": "2009-09-02", "text": "Two words.. Garlic Fries! No one can beat this garlicky goodness. Your breath will ward off lurking vampires that i guarantee but you will not complain..soo worth the breath!", "type": "review", "business_id": "GjvIDOEhdQB1oPrFeSpxBw"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "0N0ngSQ8Njxfuvdxm1RpFA", "review_id": "_U9Z6hh9uNcorQajmSEPWA", "stars": 2, "date": "2011-09-12", "text": "This makes me sad. I'm such a Parrot-head and saying anything negative towards Buffett just makes me want to shed a small tear. Unfortunately I'm rating Margaritaville and not Jimmy, though so here we go. \nThe atmosphere is fun- the decorations cute and it's a very large restaurant. It also has a very overpriced gift shop out front. They also have people in stilts walking around making balloon figurines, which made me feel a little awkward. Also the servers just aren't ever very friendly. This last trip, we had empty drinks, stacked plates, waited forever for our check all while 5 employees, manager included were standing right behind us chatting and watching football. Customer service is not a priority here folks. \nI've been here about 5 times and never have I really enjoyed it. This last trip will however, be my last. I'm done trying to wait for it to get better.\nWe didn't have to wait as long as usual, which is rare. There usually is a long wait time, but we generally come before some event so Westgate is packed anyhow. We were sat in some weird corner booth upstairs and were facing a corner wall and it was hot as all hell. We asked to move and one would have thought we asked for a million dollars, but our waitress finally agreed. Once we could breathe at our new table, she finally got our drink order and it took forever to get them. My glass of wine was the smallest glass of wine in the world. It was about the size of a shot. I also ordered a soda and it sat empty the entire dinner experience. \nOur salads and food came out together- after about 50 minutes. The table was really crammed since it all arrived together. I didn't particularly want my salad after that long and didn't eat it because the entree seemed more appealing by this point. \nThe food was OKAY. That's the only reason for the second star. I had mac and cheese and the husband the \"Cheeseburger in Paradise\". He had wanted the \"cold draft beer\" to go with it- but they have NO draft beer. They did have Heinz 57, which was at least fun. \nThe prices here are extremely high. WAY too overpriced. Almost 60 bucks for mediocre food, small drinks, rude service and an overall lackluster experience. \nSorry Jimmy! We won't be back, but will look forward to seeing you in concert if you ever come back to AZ again. It's been a while!", "type": "review", "business_id": "YeDYa6tYL16CyqYvUVOtLw"}
{"votes": {"funny": 0, "useful": 5, "cool": 2}, "user_id": "I01EeNgRX-bqd0tbfL44vQ", "review_id": "Y_2BEFwCNDDwk_QHULf8fw", "stars": 5, "date": "2009-01-23", "text": "This nail salon deserves to be mentioned. It's probably one of the nicest and most modern nail salons I've been to in a long time and it's owned by vietnamese people too! My friend frequents this place at least once every two weeks to get her cute pedi/mani so it's clear she would rave about the great customer service and fabulous pedi's. As we walked in she was greeted formally by name by each technician (totally obvious that she was well known here). In any case, their policy is that they all needed to speak english and no speaking in vietnamese as it makes the customers uncomfortable. The room was painted in a light pink with zebra chairs lining the walls, they also had a bar where you sit while you get your nails done. I only paid $17 for a spa pedicure + an additional $5 for a french tip. My polish was perfect and never chipped! With $22, my polish stayed on for a whole month and looked fresh as it did when I came in. I give this place a 5 star rating and will definitely be back when I'm in AZ!", "type": "review", "business_id": "SLO-pJBGR_79SaD1v62JHQ"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "DHVpiCNvVVrLokPYFG-QVA", "review_id": "MP40XZzKxkvZkcn3I9K-jw", "stars": 5, "date": "2010-04-14", "text": "\"What can I do to get you to stay? This is MY restaurant and I'd like to make you happy\"\n\nYou have to give kudos to a GM who approaches two unhappy, snarky women with a warm smile and a conciliatory approach. A GM who makes you feel like they WANT you to stay (as opposed to the assistant manager who stood there shrugging his shoulders at us.) Af GM who solves the problem and so we can  move onto a really nice dinner. Our bumpy start did not belie the rest of the evening. \n\nFirst up, the food:\nWe started with the Burretta ala Panna, which is essentially a totally dressed-up-befitting-of-Scottsdale bruschetta...as in FAB-U-LOUS!  We also had the scallops which were perfectly cooked, a lot of places just don't do it right - they do. Yay! Then for dinner we split the Proscuitto and Basil Wrapped Borzino.  I have to say, I normally SKIP the fish entrees in Scottsdale (because I am spoiled rotten when it comes to fish) but THIS..THIS my desert dwellers is worth coming out of your shells for.. Interesting dish, great textures and perfectly seasoned. Memorable. It made me look up the chef..THAT'S how good it was. I figure we'll be hearing from him again. Our side of sauteed spinach was perfect and not dripping in goop, and our desert of green tea creme brulee with a totally tasty macaroon was creamy, yummy goodness.  \n\nWe didn't graze the cocktail menu, though I wish I would have. We DID have a couple of wines by the glass. I will say, I wish those offerings were a little more extensive, but we did  find a nicely balanced Paso Robles Syrah that was new to me (and I am a Paso fanatic). I suspect there are other under-rated finds on the wine list. I love that, don't you? Finding some new wine to adore?\n\nThe service was genteel and warm. My only comment about the service is that our server was new and he could have used some training on the menu. He'll be one of the best when he's been there a bit longer - go see him, he's adorable: Les. \n\nThe atmosphere is Scottsdale-lush. We sat outside on our particular evening, but the restaurant's interior is GORGEOUS. I hate to bring this up because its plain bizarre, but the bathrooms are lovely. I mean, really, gold leaf wall paper? Doesn't feel like a recession in there. \n\nHonestly,despite all the raves, the most impressive thing about this restaurant was that they turned it around. We were ready to leave and we ended up staying because they made it clear that they wanted us to..and I am glad we stayed, we would have missed out on a great night. \n\nI'm sure I'll be back. It was worth coming over the entire Pacific just for that Borzino!", "type": "review", "business_id": "ymwr8OUokLLxG89gjJ1hjw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EC1jUQCDMTnbkQjg3wlhtQ", "review_id": "2Vg-oSoJZh5SEK7jvJnA1Q", "stars": 5, "date": "2014-07-11", "text": "This was such an awesome kids' museum. My kids loved these exhibits most: \n\nThe paint castle! It was so cool and looked like wax from the layers and layers of paint. \n\nThe noodle forest! It was awesome. Such a clever idea and attendants were there to make sure my younger kids didn't get demolished by the bigger kids blazing through. \n\nThe grocery store! My son found some older kids to play with and it was so cute. They were playing loading dock and having a blast. They didn't want to leave!", "type": "review", "business_id": "FCJHirFzEtj4M1VcuaKieg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xzFZl0zzN1pmpYLFzWEjlA", "review_id": "YYEtND3Lb_8tX-qGEpWgtg", "stars": 3, "date": "2014-07-09", "text": "I saw the Burger Wars on the Food network and decided to check out all the hype. BLT won against Strip Burger & Holsteins so I was expecting a lot from this burger. As expected, service at the bar was good/efficient & overall ambiance were very cool, but sadly the Interstate 80 & fries were just OK (not great, not worth the price - but they have to pay for the expensive real estate in the Mirage). I have to try the other 2 places when I'm back next time. I don't mind paying more for GREAT food and that is what I've come to expect after all these years of coming to Vegas. It's too bad that this didn't really come close to delivering. :(", "type": "review", "business_id": "3fV9sL5LklD9ZSeONKmjkw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wVuavblHM0NixaJKtpSdng", "review_id": "5xi7lDeZJF-k-hRxjQyi8g", "stars": 4, "date": "2013-08-13", "text": "Really nice gym. Love everything they have to offer. Nice basketball, rock wall, locker rooms, pools, and workout areas on the second floor. The only things that get me about this place is how they are a little disorganized. The rock wall really needs new routes and the customer service leaves a little to be desired. The kids working the cafe need some hospitality lessons. Other than that, it's the best gym around.", "type": "review", "business_id": "b78Cnqgeb4GoHqPobBXsjw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aIqSHXiGKKl_Sye3OGk4-w", "review_id": "9guss3FuJI2X-UzYOv-IVg", "stars": 2, "date": "2012-04-15", "text": "I had high hopes but was seriously dissapointed.  A trendy atmosphere in a casino within the high end Wynn sure be a sure application for success, right?  Unfortunately, of all the places dined at within Vegas, Alexander Stratta's lower end restaurant seriously fell flat.  Sea Bass sandwiched in onion lacked punch or drive, and I almost couldnt taste the fish.  The braised beef short rib had a great sauce . . . but the but was terrible, so much fat that you couldn't even eat it.  My waitress was cold, and the bill made my wallet weep.\n\nDo not recommend.", "type": "review", "business_id": "M_b7P2IBKY6zyqDmXE1kJA"}
{"votes": {"funny": 0, "useful": 3, "cool": 3}, "user_id": "XZkRgmLHG8IVgPsGJZ5LJQ", "review_id": "TVOo2T9e3YWhUemI8O95uA", "stars": 4, "date": "2011-12-05", "text": "Executive Summary:Clean, comfortable, free wifi, though 'dated' furnishings... if you care about that kind of malarkey...\n\nI quite enjoyed my 5 nights at the Delta Kitchener... but I think my standards of what a good hotel is are skewed a bit by years of backpacking and traveling on a shoestring budget.\n\nTo wit: I'm perplexed by comments in other reviews along the lines of \"the bathroom was clean, but the room hadn't been updated in years.... though it too was clean and the bed comfortable.\"  In my mind, a clean and comfortable bed and bathroom should be the primary feature being graded in hotel reviews... I don't really care if the furnishings looked 'tired'; I'm there to sleep, not learn new cutting edge design techniques.\n\nAnyway - in addition to fulfilling the basic bed-and-cleanliness needs of a hotel-goer, there was also free wifi and the room I had was pretty big.  All this for a very reasonable price (though I did get a group rate, so there is that...). That's four stars every day of the week in my book!", "type": "review", "business_id": "-MI8qX8v-pM4vQgBlVbfzA"}
{"votes": {"funny": 0, "useful": 0, "cool": 2}, "user_id": "tMHxk7pDgXeA0ACPGcLs9w", "review_id": "xAY1LahtJ9sOP_dpKoDa0g", "stars": 5, "date": "2013-09-11", "text": "This is by far our favorite sushi place!  We've been going here since they opened their doors.  The owners are friendly, remember our names & our menu (and off menu) favorites.  \n\nEverything is always very fresh, made just right, and perfect!  No other place compares!  We've been there when the place is packed and been there on slower times.  Every chance we get, we go here. \n\nIf you let them know what you like or don't like, they'll make sure you are happy.  If you love sushi, this is the place to go.  (they do have many other options and everything we've tried from the menu is great)  I highly recommend this place over all and any others", "type": "review", "business_id": "2vQoWGEcSSBIJtUiGRKi5g"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "RH2K7RqzkGUa0pD0nSMDcg", "review_id": "-V84WgKlEwBGD1m492vT8w", "stars": 3, "date": "2013-01-16", "text": "I attend cargo for it's business lounge (upstairs) which is pretty good. Free wifi and free tea and coffee and 15% off for members using membership cards (this counts for downstairs too) \n\nI head there tuesday mornings for a networking thing which is good fun, but also because it's bright and airy upstairs. There is tonnes of natural light so that's pretty ace. I have a few issues in that I think the last few times I've been there has been sport on big tellies (generally a no for me). I also get the idea that it doesn't really know what it is. I think they might finally be on the right track with going the more businessy rather than studenty route. It's right in the middle of a massive area of urban re-generation with young professional accommodation, as well as some significantly large offices opening up nearby.\n\nI would certainly think about Cargo as somewhere to hold a largish but casual meeting, an event or just for dinner and drinks on a friday. Will check out the food and beer soon and update.", "type": "review", "business_id": "HvGG8i4asaJcwJraKrtAuQ"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "_lmmIZeJTv8roWn8qU3oIQ", "review_id": "tjJh7LaB3gnA4aIY1f-xUQ", "stars": 5, "date": "2014-02-14", "text": "OooOoOoOOOOoooo. Bangers and mash make me a happy lady. My tum is thanking me even now, eight hours later.\n\nI came here for lunch with Sally L and between us we sampled the herby sausage, plain sausage, and one of the day's specials, a pork and ale sausage; chipotle mashed potato and cheese and onion mashed potato; and tomato gravy and caramelised onion gravy. Goodness me.\n\nThe sheer enthusiasm for the menu shown by our waitress, the delight she took in recommending her favourite dishes (the venison is a winner, apparently) and helping us to choose the best combination of sausage, mash and gravy was worth the fifth star in itself. But the food didn't let this down - super flavoursome, obviously good quality, and very hot. I had a chocolate milkshake, too, which was just as a milkshake should be; ice cream based, and thick enough to stand a straw in.\n\nI'll be back for sure! I was having an iffy morning and lunch here was just what the doctor ordered to set me back on track and go into the weekend with my head held high! And my stomach held in my hands...", "type": "review", "business_id": "POTGUAjI5Ag9zRrDNgSVOA"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "A3mpjzazkSDkua4cPSayYA", "review_id": "ygC06jBIMCW-d6_DuUuTUA", "stars": 4, "date": "2012-10-22", "text": "Sweet i've found me another happy hour that is both enjoyable and not wallet busting.\n\nStarted out with a Passion Martini (Sky Passion Infused Vodka and Muddled Strawberry)\nVery girly looking drink with the reddish pink color and bits of muddled strawberry but it's light and has a pleasant sweetness to it without any bite from the vodka. Well balanced but not very pronounced in the passion fruit flavor. I tend to order drinks slightly on the sweeter side and this caught my attention because i have a soft spot for passion fruit. Had i payed attention and actually read the rest of the menu i would have ordered the Passion Fruit mojito.\n\nWe came from another nearby restaurant taking advantage of their happy hour and someone suggested that we hit up Via Brasil's since it's pretty close by so i didnt order very much.\n\nGrabbed a Asparagus Risotto that was decent at best. It tasted more of a rice in a heavy sauce with some asparagus bits instead of an actual risotto.\n\nAdditionally while browsing the menu (regular menu not happy hour) the Brazilian style kale soup caught my eye and i ordered one of those. The broth was very bland and the sausages they threw in had no flavor at all. Also the kale was julienne so there was no big chunks of kale instead there was a huge mess of kale slivers. I was in the mood for a soup and this one didnt meet my expectations but then again who orders soup in a Brazilian style steak house?\n\nI plan on coming back here in the near future. Since it was my first time here i didnt know i can order the same cuts of meat by the ounce and pay for it that way instead of doing the entire Brazilian steakhouse dining experience", "type": "review", "business_id": "V7-f6dE87cNga5dSJ4CuZw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "D2eFbbWmBdiNnL7BUT6IDg", "review_id": "psI-SXoDRh7XQsHbl7O8JQ", "stars": 5, "date": "2014-03-08", "text": "This place is so great, if it were open on Thanksgiving I'd go there for my holiday dinner. Give thanks to margaritas bitches!\n\n* try the burger, unexpectedly delicious at a Mexican restaurant.", "type": "review", "business_id": "sb4wU69LkCtC6Axqcd34WQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LeIut_vSNP36GmhO4VdjXA", "review_id": "o6JKB3q5k_eV0hcZXy1W6Q", "stars": 2, "date": "2010-08-20", "text": "Didn't feel like eating Burger King so settled on Moe's. I got the burrito which was a substantial amount of food, but $10 is a bit pricey for a burrito. But I guess that's to be expected cause your @ the mercy of Airport pricing once your behind the boarding gate.  I got everything on the burrito so I'm not sure if one of the fillings made it salty. Overall it was \"aight\" definitely not the best burrito I've ever tasted, & I'm sure you could do far worse.", "type": "review", "business_id": "0jLy2J-6omAKhBDzrNHj9g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kJqSnakTIxJ4-oxuUZethw", "review_id": "zn80tedBgLAOrd7ymz3gvw", "stars": 4, "date": "2014-02-04", "text": "I used to league bowl on the East coast.\nI don't know how many of you know this, but when you bowl out here, your average drops 20 pins from what you bowled in the East. I don't know if it's the climate, or the fact that they have pro tournaments out here pretty often.\nIn any event, I've bowled in at least 10 different hotels in this city, and the Orleans bowling alleys are by far, the most challenging lanes that I've ever played on.\nI think the main reason that they were so difficult, was that this particular league was an afternoon league, so we always bowled on freshly oiled lanes.\nI loved the challenge, and the fact that my team took first place that winter, has no bearing on this review.\nTheir pro shop is good, but they're not open for night bowlers.\nMy only problem, is that they ruined bowling for me at any other hotel, because the others are less challenging.\nOh well...so my average will just go up a few pins.\nAnyway, if you want a real challenge, bowl in the early afternoon at the Orleans.\nIt's great.\nOh...and they also have good French fries and burgers.", "type": "review", "business_id": "GjuotJEGh_qt3_fB1-cCZA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OQ48Et1ZFRBpCGQ16aWUFg", "review_id": "EapGoGCYCVbRbuOEqsa55Q", "stars": 5, "date": "2014-07-12", "text": "Love the selection of beers on draft and the food is to die for. Bruschetta is the way to go! Sever was happy and enjoyed her job. Will be coming back for sure!!", "type": "review", "business_id": "uVIbi8prW0_zKkX3Cf0FOQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "upDwccJJnMBFgEMWkoSqkA", "review_id": "YVvWH2sRmfVhR_lsJGHzcQ", "stars": 4, "date": "2012-11-13", "text": "I came here twice and only to eat at one of the restaurants. The place is gorgeous, modern and clean. Very well decorated and it has a nice smell when you go in. Tons of bars and restaurants and a very open casino floor. It's about 10 min south of the strip, so definitely not too far to stay at. The pool area and pool looks amazing. Has a very young crowd feel.", "type": "review", "business_id": "9A-yUk2Ls9_5i7wFl5TOLw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xV1hf20ZFDSoaMZmwLoHNg", "review_id": "d4S-3jGrngxBm1hU9L3Wow", "stars": 3, "date": "2012-01-04", "text": "One word...UNDER-SEASONED!\n\nWe ordered the following on a Tuesday at 10:15 AM:\n1.) Californian Omelet-has bacon, avocados and cheese.  Under-seasoned.\n2.) Homemade Corned Beef Hash-Had to add salt.  I asked for a side of rice, but sadly, they don't make rice there.  C'mon, I am Asian.  I love rice with Corned Beef.  But that is not the reason why I gave them only 3 stars.  I asked the waitress to have my egg scrambled over easy, it came out non-scrambled, over easy. Under-seasoned.\n\nWe chose the seasoned potatoes, the hash brown, and the coffee cake to go with our food.  The coffee cake was warm and moist, with cherries at the bottom.  Tasted delicious with the coffee.  For the hash brown, I asked for it extra crispy, but didn't come out to how I would like it to be.  \n\nIf I come back, I will probably just order the coffee cake and a cup of coffee.", "type": "review", "business_id": "oQfCWtO5-fGTFrclqCJOwg"}
{"votes": {"funny": 2, "useful": 4, "cool": 2}, "user_id": "liB4lNq88qUDnqHW8ycQCw", "review_id": "43lYbrP-FqaLx2IF6YUuFA", "stars": 5, "date": "2009-08-24", "text": "This store was really great, the service was quick and fast and if you have any questions in this store, don't be afraid to ask. They will give you the low down and how much quality and care it took to make a product. \n\nI love how the jackets on the zipper they have this emergency hair tie. Which is pretty cute and very practical. They thought up everything for the life of a runner, yoga lover or a person that loves to be healthy and fit. \n\nThe clothes are expensive but they guarantee 5 years. The price ranges from $15.00 socks to $200.00 jackets, and $100.00 pants. The pants are tailored to your length and you will be able to pick it up in a few days. \n\nTry it out and see if you like their stuff. I know I am starting to love it. :)", "type": "review", "business_id": "ywTb9KCw_PHvk0Ts0v_UxA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HC66UgzD4u5mQEO0vMWsnw", "review_id": "6M_AeHq-BrQfRd5GRA2lDA", "stars": 5, "date": "2014-03-27", "text": "You got to love yelp! Found this great locksmith and a great windshield replacement today! Lost my house keys over a year ago (was leaving through garage and using automatic door opener) and finally needed new keys. Levi was on time, friendly and fast. He even gave me three keys for no extra charge. Love getting work done by honest profession people! Thanks yelp and Levi!", "type": "review", "business_id": "WBK5EJ73mmfGEW9DolBtBA"}
{"votes": {"funny": 4, "useful": 6, "cool": 8}, "user_id": "Mx-vxv_V-SQCe76w4RmUfA", "review_id": "7TvhmvIBDVothYjksxy6Zw", "stars": 4, "date": "2009-06-06", "text": "Located in the Fiesta Henderson Casino this place is a locals hot spot for weekend breakfast. No long lines. Fast & friendly service.\n\nGreat prices $3.99 Grand Slam breakfast. Feed a family of 3 for under $20!\n\nDon't forget to tip your waitress! :)", "type": "review", "business_id": "1IV0_7A_CIhc7P_lHezqZQ"}
{"votes": {"funny": 0, "useful": 7, "cool": 3}, "user_id": "gBID8jIwsQIE5W_Zr0Vhjg", "review_id": "U3RWhmnazrrT-PX_NxXNAg", "stars": 2, "date": "2011-09-05", "text": "Quite possibly the worst breakfast burrito I've ever had. Not only was it gross, but they charge extra for bacon and cheese. So for $15, you get a greasy tortilla filled with scrambled eggs, bacon and cheese product. Oh, and a gracious helping of sour cream on top. Bleh!\n\nService was fine - my waiter was perfectly pleasant. But the prices and quality were pretty offensive.\n\nMaybe I'd come back for a margarita or chips and salsa? Def not for breakfast!", "type": "review", "business_id": "32f43CI5i1oCleGZG5kQFA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XWtoW-j52ld7Kl7hBwhxIA", "review_id": "VFG_soqlfM97ROp0gtDdHg", "stars": 4, "date": "2013-06-01", "text": "The wonton soup and general chicken are pretty tasty", "type": "review", "business_id": "MgMh64Y-gfu7pnak0oqF7g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mQba83gB018LlGt51r80ZQ", "review_id": "Pkyt1EzirtsrXzFgW7Dw-g", "stars": 5, "date": "2010-02-25", "text": "I can't help but agree with everyone about this place.  I originally wanted to give it four stars, but for being a locally-owned shop the atmosphere was so great that I had to hit five.  I would actually almost consider moving into the apartments next door just so I could walk to this spot.  The coffee was good but man - plenty of couches, some extra rooms for studying, and you've got yourself a winner and possibly the coolest coffee shop for chilling in the Tempe area.", "type": "review", "business_id": "o5x6DF0KK1OBsiUOx2gavg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dJf3OPNQHpb-To-EQcNqkg", "review_id": "Ethe8t9M-tgjolT3vjB8pw", "stars": 5, "date": "2012-01-26", "text": "Among my favorite pho restaurants in the valley. Very clean with nice modern finishes. Owners and staff are very friendly. Love the rare beef pho. Ask for beef on the side and douse it with lime, pepper, and salt (to your liking) - let that sit a few minutes and then add it to your soup. Killer. :-)", "type": "review", "business_id": "3OauvrqUU8nDLWcW6q9hGQ"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "M35ddM0p0VtAb-n3DZtoQQ", "review_id": "PYZdaAHOgmDWPxxGaGzljQ", "stars": 2, "date": "2009-12-16", "text": "I do not normally eat hot dogs, but I love a good bratwurst or italian sausage.\n\nBetween the four of us we had four hotdog and sausage dishes, plus a burger, the onion rings, and chili-fries.\n\nWe expected the hotdogs and sausages to be of great quality, but we found them to be lacking in flavor.     I would have given the restaurant 1 star, but bumped them up to two stars for the following:\n- the bacon on my Planet Hollywood was amazing (but everything else in it was blah)\n- the onion rings were very tasty (the chili-cheese fries on the other hand were not).\n- when they messed up our order, they quickly corrected it and additionally let us keep the sausage plate that we hadn't ordered.\n- my friends said that unlike the dogs, the burger was actually quite tasty\n\nFor me, I think the sausages that one finds at an outdoor fair have much better taste/quality than what I found at Pinks.   \n\nI recalled the meals being much better at the one in L.A......was that  because after waiting an hour in line in the cold in L.A. anything they served me would have tasted good?   I don't know, but I know I won't be returning to the Vegas Pink's.", "type": "review", "business_id": "KcSJUq1kwO8awZRMS6Q49g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5d4GnYc8JpYC0wGaDyH-aA", "review_id": "ieczKuwZEL04ia1muauXZA", "stars": 2, "date": "2011-09-20", "text": "Overrated hot dogs.", "type": "review", "business_id": "KcSJUq1kwO8awZRMS6Q49g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5RtJforBznyxFKQpdvBZDQ", "review_id": "anXNwGhf6mlFMhYgBi2xIQ", "stars": 5, "date": "2011-04-26", "text": "They automatically get 5 stars for having Abita beer on tap!!!!  Bruschetta is amazing, and the butternut soup is delicious.  All the food I've had is great, the happy hour is amazing, and I want to live on the patio here.  Highly recommended - organized a large happy hour here and they were right on top of the reservation and the service.", "type": "review", "business_id": "s1dex3Z3QoqiK7V-zXUgAw"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "SKK2_7BBKT4xxS84So-h8w", "review_id": "F1QhXDbNobeei53EUXNeig", "stars": 3, "date": "2011-11-30", "text": "We were told by my best friends \"wife-to-be\", on his bachelor weekend to go here. And that's how my story begins. Let me also mention that this was hopefully a clear indication to my friend about how the rest of his life story begins as well. \n\nSo we got dressed after a long day at the Marquee Day club with some girlfriends from Santa Monica, who were in town for a bachelorette party. A great coincidence for us. Anyway, we were starving and could not wait to tear down some exquisite pieces of the finest animal flesh a bunch of cave men could inhale. We filled up 4 private taxi's and off we went. \n\nThe place is nicely dressed and that's about the extent of the good parts. The service was decent considering that the place wasn't even packed, the food was bland, and good drinks are everywhere nowadays. We drank, we ate, we laughed, looked cool, and left. \n\nBeso's is not a place I would come back to again, nor will I ever recommend it to anyone for any reason, and I don't mean that in a mean way. Just as honest as possible. I actually will never brag nor mention having been there to anyone. The only reason I even considered writing about it is because, I may actually help someone save well earned cash. \n\nThere are a lot better places to eat at for atmosphere, and/or, for actual well prepared food in Vegas. At least for the money you will spend here. \n\n3 stars is actually 2.5, and that's because we had a blast either way.", "type": "review", "business_id": "Q5Ndbf-kGsUMAQrG8aoDkw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QS9WaWlRiHwrtFJjlvuTdQ", "review_id": "iBWci1r0cnE9wCkKRhMp0w", "stars": 5, "date": "2013-01-06", "text": "I've been on 2 dessert horseback trail rides with Fort McDowell Adventures. I enjoyed both rides but the first one more than the second because the first time around the guides introduced us to the story of the tribal land and the lifestyle of the modern tribe members. I think it's great to educate people while they are actually riding tribal land. We passed through the river on both rides, it was great. Saw cows grassing, a coyote on a stroll and a bald eagle sitting by a gigantic nest.", "type": "review", "business_id": "TKJ2qE4NQfTBvekYs7JkGg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RWCOlBRaJek2IrOdKtBLbw", "review_id": "JgVhmBwKHV4Wa-dUwjhAlA", "stars": 1, "date": "2014-03-21", "text": "Went for a quick lunch and  waited for at least 45 min for two soups and finally asked to pay for our beer we had and canceled the soup. Waiter never put in our order!  There were maybe  6 tables on the deck at any time during the time we were there and saw at least 5 different people waiting tables or bringing out food. All the people passing by us and no one asked to see if we wanted anything including another drink. We had to flag down our waiter then. Poor management! Waiter didn't charge us for our beer but we left without eating and will never go back.", "type": "review", "business_id": "k-I2IJrEFAikJMqfzXUl8g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "H6NCn5AIXCMMmNB5o--iIA", "review_id": "SCYWX1ncCmhdDpaELDZiHg", "stars": 1, "date": "2014-05-29", "text": "So sad...this place keeps getting worst every time.  All the food is saggy and over flowing with grease. And if you complain they give you an attitude. Over and over I keep getting my orders wrong and by the time I get home with the food I am just too disappointed to go back.  Called a couple of times and they don't care.  Yes I keep going back because it's the only Mexican food place in buckeye open 24 hrs...but I won't be back.\nCan't wait for the one in Watson Rd. To open. Federico's let's see how your food is...", "type": "review", "business_id": "hXTKcUf44oTTQAbhh4iC7Q"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "g0KZXrxZSrRiW-KHgjvQJg", "review_id": "dE_tlkf7VY5LkE5JXQnecw", "stars": 4, "date": "2012-02-12", "text": "Man, is this place cool, tres cool or really cool...The rooms are awesome with mini bars, jacuzzi and shower for 4, and the rooms have a great view of The Bellagio Fountains.  The hotel is in the middle of The Strip\n\nThey also have some interesting restaurants including a New York pizza place in a hidden hallway on the third floor.  Place flows well with The Chandelier bar in the middle encompassing three floors\n\nOnly downside is the gym.  It costs $20, which is ok, but you have to shower in the spa for another $30.  It is a small downside for a really interesting environment", "type": "review", "business_id": "AtjsjFzalWqJ7S9DUFQ4bw"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "k083vt4jVD1h1nBE-mhplw", "review_id": "FJCmKt792POGNF10-BelrQ", "stars": 5, "date": "2012-06-05", "text": "For the guy who wrote about Shirley, the lady that 'throws' herself on people.... you couldn't be reading a person any more incorrectly.  This woman has a heart of gold.  She adores & appreciates every soul that walks through their doors.  She especially dotes on children (since hers are all out of state) but treats all their customers as family.  If that makes you uncomfortable, then yes, you are at the wrong place.  The food at Eddie D's is delicious.  My kids who are ultra picky, no matter who is serving up the food, beg me to come here. They love the pizza & pasta and I just love \"The Meadow\" - an amazing  sandwich.  If you want EXCELLENT service, TOP NOTCH Italian food, and a family atmosphere, Eddie D's is the place for you.  We proudly consider ourselves regulars.", "type": "review", "business_id": "vcl9FImoHIG4tCWLT6wZQw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "JZ5JLPR5S9N1N5kMzIGeKg", "review_id": "XsidS6-9eW6Ric8n6NdaqA", "stars": 2, "date": "2010-07-09", "text": "If I were a gambling man, I'd say no way this place stays in business.\n\nWe were there with a large group on a Wednesday night.  We were literally the ONLY ones eating in the restaurant.  Never a good sign.  That's like the one night  my goldfish was swimming sideways and I knew in the morning he would be dead.  That's how I felt about Urban Seven's lack of patrons.\n\nThere were 14-15 of us.  The server never took my order.   (Honestly, I didn't notice until everyone else had their food.  Hard to blame him for this in a large, boisterous group but no way this happens in a better establishment)  They did take an order from me and comp my meal -- a nice gesture.\n\nOne of our friends got their credit cards charged twice.  I mention this because another Yelper has said the same thing.  Either something shady is going on or their staff doesn't know how to use the credit machine.\n\nI compare what I had to above average wedding food.  Nothing memorable but certainly nothing offensive.  Just food.\n\nTwo stars for half-priced bottles of wine on a Wednesday.", "type": "review", "business_id": "QzMaVGGR4Eo5otfgOAxzjw"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "nVs7FBe-PzzvLk0K0TtYmg", "review_id": "0FHqVvwz1giHGqOxYexyqg", "stars": 1, "date": "2011-08-28", "text": "Stopped in for dinner and a drink prior to our flight.  It was the only place open on a Sunday evening at 5:30pm in Term D which is insane for how busy it is.  The food was so so - I had the pizza and it was a bit soggy.  My partner had the salad and it was tasty but looked a tad old and wilted.  We also had double gin and tonics and we couldn't taste the gin whatsoever.  There were no forks in the area so they put a box of them out and opened the top.  They didn't call out our order number so our food had been sitting out on top of the display case for about 10 minutes before I went up to check and see if it was ready yet.  My suggestion is to get food prior to going to terminal D. Stay away from this Wolfgang Puck.", "type": "review", "business_id": "XqmAbDasWtBd76LpJnMKqQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "m_yUhRsYJ86K8cleWt9rNg", "review_id": "pS91RgbLkwWvVfUtSmTpEw", "stars": 4, "date": "2012-10-07", "text": "YUM! The flavors were great! Oatmeal cookie and caramel apple were great and tasted just like the real thing. The only reason I gave 4 instead of 5 is because some of the toppings such as the twinkies and baklava were whole pieces and I wish I could have just grabbed pieces of them instead of a whole one...toppings like those could add a lot of $$ very quickly so I skipped those ones.", "type": "review", "business_id": "co8rv2zfOhMXc_TlEI9VrA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VjiF1PBumXjU05ombcvs2Q", "review_id": "wqD9J1Tyv7sLYSCOD9KEaQ", "stars": 4, "date": "2011-01-10", "text": "The service at Bachi was ATROCIOUS, but the food was unbelievable and made up for it.  We waited forever to be seated, even though there were loads of open, clean tables.  The server took ages to take our order, and then the only other time we saw her was when she dropped off the check (someone else dropped off the food).\n\nMy boyfriend had the banh-mi burger and I had the Wagyu beef burger with foie gras (I forget what it's named), and the burgers were absolutely unbelievable - juicy, tender, and full of amazing flavors.  My boyfriend got the garlic chili fries, which were fantastic.  I got the truffle parmesan fries because everyone on yelp raved about them, but the fries didn't taste like truffle OR parmesan.  They tasted like regular, mediocre french fries, so I'm not sure if I got screwed on the fries or if everyone else doesn't love truffle like I do...\n\nI worked as a hostess and server for years and I know how a restaurant operates.  Bachi clearly doesn't.  It looks like someone with an amazing palate decided to open a restaurant but has no idea how to run it, and now that they're busy, they're swamped and don't know what to do.  Having said that, those burgers are probably the best I've ever had, and totally worth the crap service.  I'm definitely going back (which says a lot because I'll usually NEVER return to a place with awful service!).", "type": "review", "business_id": "PXviRcHR1mqdH4vRc2LEAQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "FgVeOcrOFHHy8FVgKg9QPA", "review_id": "hDQP5haXOSLh7o-8Tzz86A", "stars": 3, "date": "2010-06-01", "text": "This was a nice aquarium. I have a five year old who LOVES sharks. I travel a ton for work & he comes often so we've done aquariums all over the country. Honestly it does not compare to a few we've seen. \"Nice\" is the best term for it. It's clean, decent for kids. The sharks are small, the aquarium is small, but it's in a mall, so I expected that. \n\nWe enjoyed ourselves. Don't expect too much and you'll love it. My son did.", "type": "review", "business_id": "4hmmTmWdC2d7kXhCmWZ8kg"}
{"votes": {"funny": 2, "useful": 5, "cool": 4}, "user_id": "t-zC1ZanRiiGiiktNKbgXQ", "review_id": "SoVZKLUvlnNpzBBjCefavA", "stars": 5, "date": "2013-03-22", "text": "The best!\n\nOpen bar, great set-up, nice decor, friendly bartenders, big open space, good music, what more can someone ask for?\n\nSurrender ROCKED. We had the best time ever. We partied way into the early morning and danced like we never danced before. We found a nice area outside by the pool where we were able to stash our stuff and even sit when we needed a break. The cute cocktail waitresses came around with the pre-made shots which were very tasty. The dj played great music and there were plenty of places to go if you wanted to leave the main dance floor when it got to crowded.\n\nIt was my baby cousin's 21st birthday and she had a blast and we all did too. Luckily we were on a list so we didn't have to wait to long. I would definitely check out Surrender again the next time I'm in Vegas.", "type": "review", "business_id": "DXkZRQ--Utku9wYbZ97Yjw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "dqpp_QWTVMpUBtFRdpZ7gw", "review_id": "TTIROAcSmbe_cuNLGNCALw", "stars": 4, "date": "2013-05-31", "text": "You cannot beat the price for the quality.  I like the plum wine (it is a cheap plum wine but is tasty) and the selection of Asian beer.\n\nI love the roll names too.  My favorites are the Lasagna and Fat A$s rolls.", "type": "review", "business_id": "KOOtk3mhxPoJtjGGtP54qQ"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "lWH7GQ1aSmHqWBUPPVxPTg", "review_id": "whAuCDOZ_9RTVioC8K3fnQ", "stars": 5, "date": "2012-04-13", "text": "I love this place! Haven't had anything yet that I didn't like. Service is always outstanding and the prices are very reasonable. It's my go to for Chinese. In fact when my parents visit it's their request on where to eat lol!", "type": "review", "business_id": "xhwp_bACX0017Qxu8_AVbw"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "90a6z--_CUrl84aCzZyPsg", "review_id": "zn5Fo3gOHpCxUOdpjnFikg", "stars": 4, "date": "2008-01-04", "text": "Great place to do Karaoke (available every night). \n\nThey also have another full bar \"outside\" where you can smoke, play pool, darts, etc...\n\nDecent grub and stiff drinks.\n\nGets really busy on the weekends.", "type": "review", "business_id": "9DsXB8T3UwBYiLPiLJJuNQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ik4CV_LTRpq6euPKJ0sm5g", "review_id": "eCea4d1rbDPUift8TtBtNw", "stars": 1, "date": "2013-04-05", "text": "Guess who just reopened and WON'T be revisiting!!? LoL", "type": "review", "business_id": "DjOxXobyGDwWt89q4z1twg"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "ByHyE0Tw8z4rBUhNK7Gr6A", "review_id": "ik3wHVUBk3kaLQ2J-gTPKg", "stars": 4, "date": "2013-03-19", "text": "The Harrah's casino on the Las Vegas Strip is home to the longest running celebrity tribute show in the world.  The show consists of five \"superstars\", which change quite frequently, to keep things fresh and to keep audiences returning to see the show.  \n\nEach tribute performer is backed by a live band, backing singers and dancers.  There's VIP seating at the front - kind of theater-like seats in rows, but with a little cup holder so that you can keep your drink with you - this is Vegas after all!  There's booths with tables in the center and towards the back, and as you get further back, the level is raised, so I should think everyone gets a good view.  There are two large screens either side of the stage, used very cleverly to show footage of the real star, along with live footage of the stage show as it happens.\n\nThe show I saw, on a Sunday night, was pretty packed.  We had dinner in the casino's Asian restaurant - service was speedy, as we told them we were going to a show, and the food was very good.  The audience had a wide age group and everyone seemed to be having lots of fun.\n\nOur first performer was a Michael Jackson tribute.  The dancing was fabulous, from him and from the backing dancers, they did a great rendition of Thriller and he even moonwalked.  He didn't score as highly on sounding like him, as he did for dancing like him, but he did pretty well.\n\nThe second performer was a Justin Timberlake tribute.  I refer you here to the name of the show: Legends.  I do know one Timberlake song, but they didn't perform that one.  Again, more excellent dance routines, and the singer was charming and funny.  As we left I heard other people commenting on how he had got into a \"Legends\" show, a strange choice, in my opinion.\n\nOur third performance was a Blues Brothers tribute.  These guys were getting on in years, but still danced up a storm, like the real thing.  Great soul and blues songs, great jokes, a nice, playful set.\n\nThe next show was put on by a pretty convincing Tina Turner tribute.  She was a fit and lithe older lady with an amazing set of lungs, just like the real thing.  More great dance routines and some killer songs.  Since it was Sunday, she did her version of Tina's version of Proud Mary.\n\nOur final performance just had to be Elvis, didn't it?  He did the classics, interacted with the audience beautifully, made us sing along, and made us laugh.  This was the section with the best costumes, and the showiest lights, but then, that's how it should be for Elvis!\n\nThe show lasted around an hour and fifteen minutes.  There was a bar in the theater, so you can keep drinking if you wish.  To my mind, the greatest stars of this show were the backing dancers.  Even if I didn't know a song too well, and that's always a possibility when you see a mixed show like this, they entertained me.  The backing band, singers and dancers were one stage the whole show, and if they were tired from working so hard they didn't show it.  The costumes were incredible and we got at least one costume change per performer. It's a treat for your eyes as well as your ears, but the only drawback is that you don't know which five \"stars\" you will get for your show.", "type": "review", "business_id": "hkeYoEfdlCks_rFeIWHOkQ"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "TZpXWqDqnh6K1OdrtIeEww", "review_id": "qNXzJP9ZM42XspvN4yamNA", "stars": 5, "date": "2010-11-08", "text": "Ill admit it...I was a little scared for this one to my surprise I loved the class! I started out with the Mixx Lite class which is tailored to beginners, Shandi, the owner and instructor has modifications for beginners the entire class and the workout rocks! \n\nI am probably the most uncoordinated people alive so group fitness inst usually my first choice, besides yoga of course, but I really think this class is just what my body needs to  stay in tip top shape over the holidays and to add some definition to my arms and abs! \n\nI would recommend this class to anyone looking to get fit or stay fit for the Holidays and beyond!", "type": "review", "business_id": "51ePX-7RCf4wnxwakVo3tw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cZ2tJS2MydGRvfymGW3WhA", "review_id": "LsQloeOHsVcaINO8DRLWkg", "stars": 5, "date": "2014-02-12", "text": "This place is always good, it was good today like usual. I did get really annoyed with the waitress . She told us the place was closing and she needs a job. she asked my Boyfriend for his name and phone number to call to ask about his job to get in. This wouldn't of annoyed me but she didn't ask me she only asked him about work. I work too. Another thing too I payed the bill she still handed the bill to him said her name was in there and for us to do a review. I won't mention her name just in case. She was nice I just think she was innapropriate. No matter whats  going on I didn't think it's right asking a man for his number when he is on a date right in front of the girl. Especially when you are working. Best chocolate shakes in town.", "type": "review", "business_id": "_CHH9KN1bO5cs_GHjQ-r1A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1FO6NKpaMzfJ4qCscIQxnA", "review_id": "aKIoUPexzp1AAueRD6f4PQ", "stars": 5, "date": "2011-06-21", "text": "Best tacos ever! I am Mexican and from LA so I KNOW my tacos. Not even LA has better tacos. Their style is what I am used to eating while visiting family in TJ and Ensenada. The first time I tried these was while I was in San Diego and I have fallen in love with them ever since. The location here is a MUST GO anytime that I am in Vegas. They're a little pricey but let me tell you that they are worth every penny. My usual order consists of 3 Al Pastor tacos with everything, 2 tripa tacos extra crispy and some cebollas and chile. This location is one of the best since I have been to all of theirs. The location in Temecula, CA is the worse! Re-cap. You cannot get better al pastor tacos anywhere especially in LV. YOU MUST GO HERE!!!!", "type": "review", "business_id": "pVH6ngKnMdJSpkFEw0XKlQ"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "Sr-wB9G8KflQjbAS8Q3HQg", "review_id": "oQ7JF884TJaR1qeAURd7LA", "stars": 5, "date": "2012-09-10", "text": "FIVE STARS FOR ARTIE!!\n\nThe first time we called Artie was when we had a leak under our kitchen sink. I had turned to Yelp hoping I could find somebody with decent reviews. I was sold after all of his five star reviews and knew we had to try him out.\n\nTo date he has installed a new kitchen sink, replaced a kitchen faucet and a bathroom faucet, and snaked our drain after a backup in our laundry room and kitchen. You better believe he's the first person I'll call when my next plumbing nightmare arises and he's the first person I'll refer my friends and family to as well.\n\nHe is very professional, prompt, efficient, friendly, and reasonably priced! You really couldn't ask for more.", "type": "review", "business_id": "Ylx0MmpISxwac1pNZ7WbXA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Z8vIrJZkjl02Az9jNYfwCQ", "review_id": "nvym6LJeVsI-cXfo4l4heg", "stars": 4, "date": "2012-07-01", "text": "Si je suis allée manger dans ce bar c'est grace à la musique qui m'attirait depuis plusieurs jours, elle est tout simplement excellente, tous les tubes du moment ou des musiques retro mais qui donnent envie de bouger! \nPour un bar en plein milieu du strip la carte n'est pas très excessive, donc c'est bien, j'ai pu manger mon burger pour 11$ et il y a de quoi se régaler! \nEn revanche le coca à presque 5$ car en refill c'est une fortune, car avec un burger énorme on ne boit pas énormément donc ca revient vraiment cher!!!", "type": "review", "business_id": "dxY1gl4cO4-rEFATCkFUIw"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "r1GwrDACKyGTcjrtnsk6Aw", "review_id": "Zfp9qFOLkcX1CzDr86MFMQ", "stars": 5, "date": "2013-07-11", "text": "This is my FAVE pancake place.  Well not just me but my whole family.  We have to come here for breakfast everytime we visit LV.  I love that they have tons of pancakes to choose from.  My choice is always the red velvet, it's like having dessert for breakfast, need I say more?  I don't have to use the cream cheese syrup as it is good by itself.  My mom and I always share a spam scramble plate (scrambled eggs, spam, rice, and furikake) which appeals to my Filipino side and the red velvet pancake.  My husband always try different types of banana pancakes, he got the banana cream pie this past 4th of July.  Our children loves the s'mores one.  Our youngest who has a hard time finishing his food actually ate spam scramble and his own stack of pancake and finished it all!  They also had adobo chicken fried rice which is very good but can be too much if you have to finish it yourself, so share!  We can't wait to visit our parents again and have delicious breakfast at Baby Stacks!\n\nBtw, the wait is super long...but definitely worth it.  Service is good and fast.", "type": "review", "business_id": "LCeF1wK5OqP3PPEVBa5Xfw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K_-834YZERtNoZrJpiN7Iw", "review_id": "2sAWv3IZd8XTIi5FawyHgw", "stars": 4, "date": "2014-03-27", "text": "Friendly faces and good sandwiches. Best place to grab a superquick bite and eat on patio.", "type": "review", "business_id": "hG5QnyJ_lbVAT_jaGc2u1w"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "wzkm6w11zm4VnedIOaD_0g", "review_id": "Ezn7DntvqPlPPAVREJX2Kg", "stars": 3, "date": "2012-06-20", "text": "Yeah... I think this place tried a little to hard to be trendy in all aspects. I knew it once they sat us under a giant head-shaped projection screen (??).\n\nFood: super small portions that are good but not something I would remember/crave/die for. Ordered a bunch of different of sui mai & some lettuce wraps. I was expecting the food to be a little more than Cheesecake Factory or Elephant Bar, but that's basically what it was.\n\nDrinks: I got some sort of lemondrop with jelly \"noodles\" in it... interesting, but I had no idea how to approach it (I looked like an idiot digging in my drink with chopsticks). My friend ordered the salt air marg was pretty cool, once you got past the first sip which is basically a mouthful of foamy salt.\n\nGood effort but won't be back!", "type": "review", "business_id": "cMvN1j-LK64zqmT4vnl8NA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2uwalj8GE5VxvrCUb_lNRA", "review_id": "jShUNidm4FUYHIEqFu8J_A", "stars": 2, "date": "2011-06-11", "text": "I should have listened to everyone who told me to go to XS. I came to marquee for my birthday & it had to be the worst night I've ever had. The entire staff was rude, except the shot girls. They were too damn strict, its a club, let people have some fun & they stopped letting people on the dance floor, so if you left your friends there to go to the bathroom don't expect to go back to them. I decided to go to surrender the following Wednesday and had the best night. No matter what others club I've gone to, surrender has always topped them & their drinks are $13 at surrender & $20 at marquee. So take my advice, save your time & money & go to wynn/encore. Marquee is overrated!!! I will never go back there!", "type": "review", "business_id": "Ht8mXLuqJSTPrU9kvzosUA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-mlDdkwt8DbvQAVNC1TEOg", "review_id": "ug5ajha14OpF2GozxYDX0w", "stars": 4, "date": "2011-12-30", "text": "While 'value\" and The Cosmopolitan seem to be juxtapositions, the $20 pre fixe lunch at Estiatorio Milos is not only a great value, but a tasty one at that. \n\nI was glad too see many seafood options on the menu. I started with the scallops (http://www.yelp.com/biz_photos/YRyYbOSwvHkZsZOLv98oQg?select=-9QrumuAjE-fOMgZMwpFUA) with a citrus and mint salad. This was the most disappointing part of the meal. Two tiny scallops, each barely larger than bay scallops. I wish there was more of a char on it. Also, one mint leaf, several shreds of onion, and one orange segment not a salad make. My friend had the grilled octopus (http://www.yelp.com/biz_photos/YRyYbOSwvHkZsZOLv98oQg?select=n4dgEIUOiLVuL7VgnA-yzA) and if I can recommend one thing here, pay the extra $10 for the octopus. It's worth it. You get well seasoned octopus with great char from the grill     \n\nI had the grilled Mediterranean Bass (http://www.yelp.com/biz_photos/YRyYbOSwvHkZsZOLv98oQg?select=ZHxqPjGi3u3VHfB-WvHMWA) as my entree and it was the epitome of what I love about  Greek seafood dishes - the olive oil, capers, and lemons... so simple but so delicious. The fish is served whole so there will be some bones but it was a very well-prepared fish. My friend had the lamb chop (http://www.yelp.com/biz_photos/YRyYbOSwvHkZsZOLv98oQg?select=JPMx_KuND2Sb_T6rO6JNCw) and he said it was decent. I guess this is a signal to stick with seafood here. \n\nI had the yogurt martini (http://www.yelp.com/biz_photos/YRyYbOSwvHkZsZOLv98oQg?select=FjlBOb4mUpo-ux8CTfcxbg) to round of the meal and I liked it. The yoghurt was just the right amount of sweet counterbalanced by natural tanginess. Nice light desert to cap a meal. My friend had the walnut pie (http://www.yelp.com/biz_photos/YRyYbOSwvHkZsZOLv98oQg?select=yNpyFpainXX8wHBr--EasA) and it's decent. If you like deserts with some spice in it then you'll probably like this one. \n\nAll in all we had a good meal at Estiatorio Milos. It's a bright and airy restaurant with lots of natural light. Our Japanese server took good care of us and for the most part, we enjoyed our food. But again, the lunch special is truly a good deal so definitely pencil it in if you're in town.", "type": "review", "business_id": "_6gbnNRPIc-iM_0cBLPX1A"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1Rjap5DNCVcL-2tfOlOk4g", "review_id": "VNw9CdL3rOlECV5-00Nm4g", "stars": 4, "date": "2012-04-30", "text": "Great hidden place for a bite to eat... at times there was a long line... pizza is a little soggy in the middle.", "type": "review", "business_id": "eq6lQI039SBLC6sHm3idGA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "cwI6P-QgbsnlTvYPJb-ZNw", "review_id": "LOx_VRyDnht8u2_82Nh0rg", "stars": 5, "date": "2014-02-10", "text": "After a night full of drinking and gambling in Sin City, where do you go to get some delicious food after midnight?  SECRET PIZZA.  Located in the Cosmopolitan, finding the little pizza parlor is an adventure in itself.  Secret Pizza is located at the end of the corridor by the pool tables.  There are no signs for the entrance which makes it a bit difficult to find.  I would definitely recommend the white slice, then adding a meat such as pepperoni.  They do offer pies as a whole for sale as well.  One big advice: avoid going to Secret Pizza around 3AM on a Friday or Saturday night.... All the club crawlers from Marquee want pizza too and there will be a long line.", "type": "review", "business_id": "eq6lQI039SBLC6sHm3idGA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aXG5Ut2kjSoXInl7bPgYVg", "review_id": "5xn0FE7qSgGIo51EKhtZwg", "stars": 5, "date": "2012-04-13", "text": "O.k., it's in a mall and pizza was not the greatest in the world, but this place exceeded my expectations.  FIrst, service was great.  Went there with 4 kids, and very friendly and competent waiter brought them small rounds of dough with a pizza pan.  What a great, simple idea.  The dough occupied all children (ages 3-9) the entire meal.  THey made fake pies, desserts, etc.  Next, I could not choose between two white wines and waiter described them like he knew them and then offered me a taste of each. Wow.  Again, very simple and inexpensive for the restaurant, but meant so much to me.  They won me over at this point.  Again, when I was thinking of a red wine to have with pizza, he gave me a taste of a delicious blend from Paso Robles.  Pizzas were good.  We had two, both with red sauce.  One with sausage, the other with meatballs, ricotta and garlic on half, the other half being olives and mushrooms.  Tasty and fresh.  Sauce is a little sweet and not herbified with oregano or thyme.  People can endlessly argue about pizza styles, sauce, etc., and I am one them, and, I can say a sweeter sauce is usually not my style, but I found the sauce pretty good.  The crust was a littler thicker then I expected, but was cooked until dark and crispy.  Overall a B+ pizza.  The garden salad was $5 and was fresh and big enough for me and my two kids.  I did not eat dessert, but friends said cheesecake very good.  This is a solid place with great customer service.", "type": "review", "business_id": "OVU0pQ85Zf74OVgDyPFvGQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "faF9BDeb7Dk07NN1SRmZVg", "review_id": "Xjws0nuk59uX5YJtcWLr1Q", "stars": 2, "date": "2014-03-01", "text": "I'm giving them a low rating just because they charged me & my friend to get in (this was at 1 am on a Sat night / Sun morning, so there wasn't anyone in line) even though their website says local ladies are always free. What part of always free do they not understand? If they're not gonna honor this statement, then they should remove it from their website.\nWe just ended up going somewhere else instead.", "type": "review", "business_id": "mzotSaJNpWydcoVX7sr4qw"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "5ltY6j-HCw9MVer8puq65Q", "review_id": "3RDzx-BqRbyN6cc2bN2olA", "stars": 5, "date": "2013-05-28", "text": "Pretzel Cone. Need I say more?!? I am normally not an ice cream girl. I'd take chips and salsa over dessert any day.  My husband on the other hand LOVES ice cream, so when we were out with some friends we  had to stop in. I was contemplating whether to just get coffee, but then I saw the pretzel cone sitting by the window. It's like the heavens opened!! Such a good idea. \n\nI asked the girl working what she suggested with the pretzel cone and she recommended the Butter Pecan. mmmmmmhmmm. What a perfect combo. I think I finished my whole ice cream cone for the first time in my life. The cone was not soggy and just the right amount of salt. \n\nCan't wait to come back and get another!!", "type": "review", "business_id": "tAmevVP8B7PiWxcJ0PlYVA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OtpHvQFGbZ4sONaQAXankg", "review_id": "bFZ_HG-LAKInXaf6-RVqvw", "stars": 4, "date": "2013-07-19", "text": "Following the advice of Jimmy, my fave bartender from Opus, I decided to check out this hip sushi joint.  I was not disappointed.  Jimmy moonlights (sunlights?) as a waiter here and took great care of my sister and me.  I had the unagi and spicy tuna + avocado. Delish!!  It was great sitting at the sushi bar. Only complaint (minor) was the loudness of the music.  But overall, three thumbs up.  Go ahead. Figure that one out.", "type": "review", "business_id": "RSus8g2uybiZVmcTK0PeIw"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "3hPmlMAP3PfHMiwNW_RUZg", "review_id": "1ggH8R8Jkq-NJ470FJDJzA", "stars": 5, "date": "2014-06-27", "text": "Let me preface this review by explaining that you aren't just paying for the amazing food that you get at ShinBay. You are paying for an overall experience and it is worth every dime! My fiancé and I had dinner here on a weekday evening late so it was not busy at all..in fact we were the only ones in the restaurant and what an experience it was to have the place all to ourselves. My fiancé had always been a very selective eater and wasn't open to raw fish when we met but has since been willing to try anything. And boy was he impressed and awed. Paying that much for a dinner was not his thing but by the last bite of dessert we were blown away, full and happy. Hands down a perfect romantic restaurant to enjoy each others company and the experience. You will not be disappointed by any part of this experience. Take advantage of this amazing place!", "type": "review", "business_id": "8HheTzFpxkOlfFxJy-sIMw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5uBXFenH_qz7WYLWqk9byg", "review_id": "1G6UTCbZyY5r9Tt7eAyM_Q", "stars": 5, "date": "2012-10-27", "text": "Flexible with schedules.  Professional work completed quickly for a good price.", "type": "review", "business_id": "6vF7u-mqxlVMw-hWJ_aoxg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-04SqDgbCF9EmZjYabXXmg", "review_id": "O6aC66YbbMNWNyirclyHQQ", "stars": 4, "date": "2012-03-29", "text": "My wife like this place, the prices are reasonable, her favorite nails tech is Henry, he always do a good job, it really hard to find a good nails tech +1 for Henry.", "type": "review", "business_id": "iIOTmlYSd-V-2IWcyvrT9Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "zWaRPnCDhn3RBKCPNhrAhQ", "review_id": "XTMZEAafKaZem-XBdlElug", "stars": 4, "date": "2012-09-15", "text": "Went here with family last night, the food is good and the service is very friendly and accommodating.  We ordered:\n\n- Pad Thai - noodles were a little over cooked, mushy\n- Yellow Curry - good, order spicy!\n- Nam Tok (Thai beef salad) - awesome, order spicy!\n- Papaya Salad - yummy, order spicy!\n- Chicken w/ Mixed Veggies - good\nWe previously had:\n- Crispy Duck - good, expected breast slices, but it's sliced like roasted duck\n- Red Curry Catfish - good spicy\n\nThe highlights were definitely was the salads, fresh and flavorful.  We'll be back again.  Plus it's the closest Asian food you can find coming from the West side, until you hit further East.", "type": "review", "business_id": "gWZMV5q8CSp8K5tZcMokCA"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "3ONPPazUH-Q3XblYJIaA1A", "review_id": "oqVbOUaePTChvIh34ZcOQg", "stars": 1, "date": "2011-12-29", "text": "There are much better options for breakfast than this place.  The food is ok but lacked salt. So if you are going for a low sodium diet you are all set.  My first visit was fine nothing special would have given it a 3.  I would recommend not going in after 1PM.  I went in at 1:30pm and there was nobody there to seat me as they were chatting at a table off to the side.  I was seated after a few minutes, when he noticed I was waiting. The booth where I was seated didn't seem to have a waitress assigned to it...  Everyone was clearing tables and huddled in the back.  I waited 10 Minutes then decided they wanted to close so I left and went to get food elsewhere.", "type": "review", "business_id": "3QPwxHWoiwTXscuG7_jecA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "iy-lnju3UY_eap5oztdkhg", "review_id": "rMLQxOlNC23i_AhWPY_-4g", "stars": 3, "date": "2014-01-06", "text": "How do you pass up a $2 Ice Cream Sandwich?! Easily, you don't! For only $2 you get two decently sized cookies (of which, you can mix and match any two!), and a huge scoop of ice cream (also, of your choosing).\n\nI will say, the taste of the cookies and ice cream are not, by any means, the highest of quality... but can you really go wrong for just $2?? Probably not! It was a delicious little treat and worth going to!", "type": "review", "business_id": "obTqUQvjhMaAnS34q2SBEg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5vZy5nkNm2_MduX8Y-9hAg", "review_id": "nxQU5R1uB0j1MlkhcDAf_w", "stars": 5, "date": "2011-11-28", "text": "I stumbled upon this Penguin store while in Vegas.  I usually shop at the Penguin stores in LA or online, so it was a nice surprise to see this store at the Miracle Mile Shops at Planet Hollywood.  \n\nPenguin gear can be a bit pricey, but they usually have great sales (40% off the entire store while I was there!) and their staff is always super friendly and helpful, regardless of which store you go to.  Everyone at this store was sooo, sooo nice.\n\nIt's always great quality Men's, Women's, and children's clothes.  If you're not familiar with their clothes, make sure you try everything on before buying!  Depending on the cut (i.e. Heritage Slim Fit or Classic Fit for men), you may go up or down a size.", "type": "review", "business_id": "Ru6W30mXwBqDrgeDzHldoA"}
{"votes": {"funny": 0, "useful": 2, "cool": 3}, "user_id": "Qx9MnE4R-g70HyF468O8dA", "review_id": "doCQNd80QNo80bQjygHuYA", "stars": 4, "date": "2013-11-12", "text": "Anyone who follows my reviews knows I've had some interesting Vegas health care experiences to say the least. But when it came time to find a new optometrist...I looked at my provider services guide, and then I turned to Yelp to give me the details the provider guide didn't. Yelp helped me narrow down my choices to two. The first choice was closer to where I live but they were so rude that they got a bad review of their own. But my second choice...turned out to be my best choice and that is Clearvision Southwest. \n\nFrom the time I walked in the door I was greeted with a smile. The forms were short, the paperwork easy to read. I was able to see Dr. Wong within 10 minutes of my appointment time which always impresses me. And while they were having some web based computer glitches today, the rest of the office was equipped with up to date equipment...including testing equipment that didn't freak me out. (The one machine that puffs air at your eyes...Dr. Wong's machine didn't freak me out like other equipment has in the past!)\n\nDr. Wong took the time to listen...and I say that because she caught something my previous optometrist had done and that is to slightly over-correct my vision. When I peppered her with questions she took the time to answer. And even though I had pushed my contacts a bit hard of late, she didn't give me a hard time over it. And one more very important thing. She smiles. You don't feel like line #39 on a daily patient spreadsheet, you can see she gets it, and she does care about what's going on with your eyes. \n\nThe front office staff can make or break a practice, and Dr. Wong has Rhonda running the front. She's very knowlegeable, she tells it like it is, and she's able to help you make the best choices to maximize your insurance coverage. I did not feel pressured into making any high cost purchases, and from start to finish I was listened to and treated with respect. \n\nIt has been many, many years since I had an eye care experience like the one I had with Dr. Wong and Rhonda at ClearVision. But...it won't be my last. I look forward to taking my family there and I don't see a need to look any further...I've found my eye care professional in Vegas. \n\n4 Very Strong Stars. So why not 5? I've tightened my guidelines for reviews and star counts. And I reserve the right to bump it up in the weeks ahead.", "type": "review", "business_id": "tvCTSAlE1HqP52Y_flyKNA"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "L3_6et3YnWYg4p-SCqy4DQ", "review_id": "V2olZKhCR9rN4ScKl1UPbA", "stars": 1, "date": "2013-10-27", "text": "I would love to give a good review however when I asked what time they closed I was  told 6. I arrived at 5:42 and they tell me that they were closed?!?! #notahappycustomer", "type": "review", "business_id": "Zi-dpvV3879RgW_LeZ49uQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TtD1gR3uDecZYL8FgxJLkg", "review_id": "NuR_C63UcSK208CH8C1Dqg", "stars": 5, "date": "2013-08-15", "text": "Can't say enough things on how good they treated me. Bought a battery here less than two years ago and it had a 3 year full replacement warranty. Felt like the battery was dying on me so I took it in to have them check it. The guy at the desk was upfront to me telling me there were 8 cars ahead of mine and it would be a couple hours to get it checked. I agreed and dropped off the care and gave them my cell number. Approx 2 hours later he called me and told me my car was ready to be picked up. Went inside and they had the keys waiting for me and told me that the battery tested bad and they replaced it for free. Now how is that for great service!", "type": "review", "business_id": "naq1YSL3Qs3WTFbXrHA41A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_S-Ul1VUMldzvYw41dvAWQ", "review_id": "thxK1AJI6lh9bidv2WOArg", "stars": 5, "date": "2014-02-15", "text": "Phone was fixed in less than 15 minutes. Easily the best customer service I've had all year.", "type": "review", "business_id": "GTvzXkfls-3yy2TduIXgDQ"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "-vjrlFggqnTNhMuy-m0HJw", "review_id": "9DEnQf1rFyvF2ZoQAP0CTA", "stars": 4, "date": "2013-11-06", "text": "Dropped by to have a cigar and some lunch. Good selection of drafts, nothing exotic but good beers. Food selection is limited, I had wings and they were great. good atmosphere and the outdoor space was great. It wasn't a really hot day and sat outside and smoked my cigar. They don't allow glass out there is the only problem.\nBiggest asset they have is Carly, what a sweetheart and service was great.\nWill me more of a regular now for sure..", "type": "review", "business_id": "AiV1JNd4EaGpKiOZ6aM-3g"}
{"votes": {"funny": 1, "useful": 4, "cool": 0}, "user_id": "JeDXg5tMVVAj1mRRRPD2Pg", "review_id": "eAGsNflPrRdV_Kjgo3Pcvw", "stars": 5, "date": "2013-04-05", "text": "It's been a few weeks since we had our system installed, and I waited to write a review to make sure we were entirely pleased.  The system works great, and the installation process was quick and smooth.   We absolutely recommend this company.  We had an alarm installed after a bad experience with a near break in -- we have a large and loud furry alarm who worked to stop this first attempt, but we figured it was better not to chance that on the next (our dog has his limits).  So, we added an extra layer of security.  Jim came out on our schedule (after business hours), and was very honest about what we needed, and - more importantly - what we did not need.  As a result, he worked within our budget and fiancial constraints, and we feel much more secure as a result.  Without a doubt, this experience was one of the more pleasant customer service experiences we've had.   And, as an added bonus, Jim has a pretty good sense of humor and was genuinely just a nice guy -- that's not always a requirement when selecting a service provider, but it sure makes it nicer to deal with someone.", "type": "review", "business_id": "tAdd__IgXQEknDDicEbRgQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Gi0kyGDi79LTzRKy5vZS6g", "review_id": "vWdOLkNuygK6gez7zebQnQ", "stars": 5, "date": "2014-04-20", "text": "We bought a water heater from Water Heater Pros in Oct. 2012.  Recently we noticed the pipe that leads up and out of our garage had become disconnected.  We called them and the same morning they came out and fixed it at NO CHARGE!  Warranties for the water heater is good for 2 years and the parts are under warranty for 6 years. We will definitely contact them again when this water heater needs to be replaced.", "type": "review", "business_id": "ElPY8qLG3w_8DlocsIfHJA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GRuNDtXKvJgfG69rsqpXIQ", "review_id": "JmzagG7XsTQ0JZaYrk6IOg", "stars": 5, "date": "2013-12-04", "text": "I am finally getting around to reviewing Crudo.  What a great experience! We did the full tasting menu and were impressed by every dish.  Our server was amazing and passionate about every dish. The crudo dishes were my favorite - the albacore with black garlic and truffle was RIDICULOUS!  I'm still craving it!\n\nI told our server how impressed we were and what talent the chef had...and jokingly I said, \"Is the chef  single?\"  We laughed our butts off when she said, \"well, he's actually my husband\"    I absolutely love the husband wife team making Crudo such a success.  You can taste the passion in their food.  Well done Chef Cullen and the entire team.  I wish you much success!!", "type": "review", "business_id": "Xk3inJcuBGLhavUcdlINZA"}
{"votes": {"funny": 6, "useful": 13, "cool": 11}, "user_id": "F9T6m1YdRFreyKDufcyoOQ", "review_id": "4iYH0MeyrkdvwpGnIOhP6w", "stars": 4, "date": "2014-06-16", "text": "Forequarter has the kind of candle-lit, dark wood ambiance that makes me a fan immediately upon walking in. Then, you pick up the cocktail menu and realized they have bottled cocktails as well as an extensive list of creative concoctions and fall a bit more in love with the place. Heck, even their non-alcoholic drink list is impressive. After you've ordered a drink you begin to peruse the menu, which happens to change a little bit everyday, and you know without a doubt Forequarter is the kind of place you want to frequent regularly. I ate dinner here with a group of people and because of that was allowed the opportunity to sample lots of dishes. Honestly, there was a bad bite I put into my mouth. \n\nIt's a lovely spot for dinner with friends or a date and if I lived in Madison it would definitely be in my date night rotation. As it stands, I'm so glad I had the opportunity to try Forequarter on my travels to Madison!", "type": "review", "business_id": "UIjO8lq1Lh0H2l9VfIfifQ"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "_VNWr5TQbYdXn1JexUEjag", "review_id": "XWUx2hEJX1qYQHZuPRu9sA", "stars": 1, "date": "2013-02-03", "text": "this place is a jock !!!!!\nif you wonder why everything looks like it has been there forever\".. its because it has..\nthere is not a single piece in the place that is fairly priced.\ni looked up the price of a used vacuum \"one i had just bought new\"\nand it was 69.00.. only mine was 59.00 brandnew\"\nhow they sell anything is beyond me.. it was a waist of time.", "type": "review", "business_id": "r0r6cDhOLbLqcvz9OGTe7A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GwOMPu6ZvyiexOIX9GG8AQ", "review_id": "O9uhfRg1RbO-ivAXiAVHzw", "stars": 5, "date": "2012-10-11", "text": "Enjoyed eating dinner last night at Davanti's.  I felt like I was in LA, the atmosphere was very cool and relaxed yet professional.  The food was delicious!  I overheard a table of four on their way out the door all raving about their meal too.  Great wine and menu.  I'll go back with more friends to get a chance to share more of the small plates.", "type": "review", "business_id": "U97cOaXPSOGmVhKEomPjlg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VKE6P9RJalj5qpY1bklmjQ", "review_id": "au_Fr6B-MGxOjpq-4k0BAA", "stars": 4, "date": "2013-08-24", "text": "Certainly on my top 3 las vegas buffet, alongside with wicked spoon and wynn. Must not miss stations: Meat station, antipasto, seafood, dessert. Everything else was also good but I have to choose my battle of girl vs. food.  If you must have breakfast get there at breakfast time, don't complain if breakfast is not fresh at 2 pm. Servers were attentive although our particular server made errors twice, no biggie. If he tells you, \"what would you like to drinks?\" That's him! Price was not bad considering it's a buffet. $70 meal for two at noodle #9 or Gordon Ramsay's Burgr vs $88 lunch for 2 at this buffet. Not bad at all. Happy eating!", "type": "review", "business_id": "sIyHTizqAiGu12XMLX3N3g"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "bCFN0OT-S2lYitSgVlNtOQ", "review_id": "HpBR-nfbCNemlJu2tPDrDw", "stars": 5, "date": "2013-09-21", "text": "It doesn't get better than Pig & Pickle...outstanding food , great service and good value without being pretentious. Pork belly tostadas...awesomeness! Smoked salmon stacked high in a latke...delicious! Gruyere with local honey, bee pollen and apricot jam was delightful. The wife loved the tostadas the she ordered them for her entree. The Apocalypse Sow was the best burger I have ever had...the ground pork, bacon and cheese was heavenly. Cod fish and tatters were very good. The s'mores dessert was worthy enough to go just for the desert.\n\nThe hostess, the manager (Chris) and our server  (Justin)  provided outstanding service . They know how to make you feel welcomed and make it easy to want to come back again and again. I recommends everyone to go here!", "type": "review", "business_id": "h_WtRK_umSU8LCCmAeqbFA"}
{"votes": {"funny": 0, "useful": 4, "cool": 2}, "user_id": "k5p3YP1ZjCa8ZS3xqXgBug", "review_id": "LEMx-sbc4-RER96uf_WhqQ", "stars": 4, "date": "2014-02-18", "text": "This review is long overdue, but I'm finally getting around to making a dent in the backlog of reviews on my computer. Anyway, the week before xmas this place was busy. The line was almost going out the door as people were buying stuff for friends, family, or co-workers.\nIf you're gonna get a large order, it's better to call ahead to guarantee the flavors you want. Many of the flavors on the racks were reserved for such orders. The display was somewhat bare as many of the gourmet donuts were purchased.\n\nThe size of the donuts were large, so you may want to share. One donut was enough to fill me up. The tart filling in the keylime donut was great, reminiscent of a good keylime pie. The s'mores wasn't bad. I liked the marshmallow flavors that were present throughout. I'm glad I tried the nutty pig but I can't say I'm a fan. It's a combination of flavors that isn't for everyone. My least favorite part was the cold and chewy bacon bits. Personally, I prefer my bacon piping hot and crispy. The pumpkin cheesecake donut may have been my favorite. The rich and creamy filling provided all the goodness of a pumpkin pie in a donut.\n\nWhile I'm not typically a fan of donuts, the ones here are creative and delicious enough for me to want to come back. Obviously, I'm not the only one to think that, as they've expanded to a kiosk at Town Square and elsewhere around town. A location in the southwest would be more than welcomed. \n\n4.5 Stars", "type": "review", "business_id": "mDU31M4xdY7IDux_LwBiPQ"}
{"votes": {"funny": 10, "useful": 6, "cool": 6}, "user_id": "MMxky8CSK84Bk3RY0pdMZA", "review_id": "rsu65rGjXQ6eMPijFam1xA", "stars": 2, "date": "2013-01-15", "text": "My momma always said, \"Life was like a box of chocolates. You never know what you're gonna get.\"\n\nWell, no... actually Forrest Gump said that. MY momma always said, \"For God's sake, Ryan, why can't you put down that Nintendo controller and play outside with the rest of the NORMAL kids? And what the hell are you wearing all that TINFOIL on your head for?\"\n\nNo, Forrest Gump was the one who talked about chocolates, and Bubba always talked about shrimp, hence, we now have the chain of the Bubba Gump Shrimp Co. restaurants. They're all over in touristy spots, and the Seestur raves about the one in Anaheim in Gardenwalk. She even sports the sweatshirt proudly. This from a girl who would practically retch if she even got near seafood.\n\nSo boy, howdy, was I excited to see that there was going to be a Bubba Gump Shrimp Co. on the Las Vegas Strip. So excited, that I didn't even care it was located mere steps from the horrifying (to me) Goretorium. I was going to brave the danger and go to Bubba Gump, and if one of the evil scary monsters from Goretorium and/or one of the sleazy porno-card giver-outers on the corner of Harmon and the Strip came after me, well, by God I would buy fresh boxers from the Bubba Gump store.\n\nIf life is like a box of chocolates, I should have tried poking the bottom of the candies before coming here. I got stuck with that one everyone else dodges. You know, the one with the pink cream-ish center that's supposedly cherry or raspberry but tastes more like Pepto Bismol.\n\nLas Vegans hardly need a reason to celebrate but we find them anyway, and as I had just been unceremoniously and hurriedly booted out the door by my former employer, ironically who stood across the street from Harmon Corner and rhymed with \"Bosmopolitan,\" I decided to have a little \"New Beginnings/I Got Fired\" dinner at Bubba Gump's.\n\nFiguring I was the last one there (as I usually am) and not wanting a demon to jump out of the Goretorium and eat my soul, I asked one of the store clerks, \"So... I'm in the store... but where's the restaurant?\" She smiled and directed me up the stairs toward the back of the store. A sign or something would have been nice.\n\nI headed up the stairs, where I was actually first, gathered the party, and we were seated. They explained the license plates on the table that say \"Run, Forrest, Run!\" and \"Stop, Forrest, Stop!\" which I thought was a cute touch.\n\nThe crew was stellar. Our main waitress was super bubbly and thrilled when she heard we were all locals (like, apparently they had not been frequenting the place... what a shock no locals on the Strip). She was very attentive to our needs, to the point where we never really needed our \"Run/Stop\" plates on our table. She even regaled us with ghost stories in nearby mining towns. So despite whatever else I say in this review, the staff was great and should be commended.\n\nAnd with that being said... well... \n\nWe started with a round of drinks. Since it was my firing party, I was ready for something nice and strong, so I went with Bubba's Blue Hawaiian: vodka, rum, gin, Blue Curacao, pineapple juice and Sierra Mist, yes, please, come to DADDY! The menu says $8.99, but don't be fooled! That doesn't include your collectible Bubba Gump glass, so you're more looking at $13. You have to specifically ask to NOT get the collectible glass, whereas I think it should be the other way around. But the drink was pretty good. Not quite an AMF, so it won't belt you on your ass, but not a totally tame drink either.\n\nDinner came around, and I have to say I was gravely disappointed with my dinner.  I got the Shrimper's Heaven, which along with french fries came with Fried Shrimp, \"Chilly Shrimp,\" Coconut Shrimp, and Shrimp Tempura, along with three sauces: Asian, cocktail, and a Cajun sauce that reminded me more of orange marmalade.\n\nI started with the \"Chilly Shrimp,\" which I thought was just going to be cold shrimp like you might find in a shrimp cocktail. No, in fact, that is wrong. \"Chilly Shrimp\" is Bubba Gump's version of \"Peel-n-Eat Shrimp,\" which means the shrimp is cooked inside its shell. Yes, shrimp have shells, and shrimp have legs, which took that portion of the dinner from \"tasty seafood morsel\" to \"creature that used to be alive, probably leaving behind a family he supported and a shrimp company job that will have to do some PR work to explain his disappearance and he was probably named Charles.\" I can't eat things that could probably be named Charles. So there's a quarter of the dinner shot down.\n\nThe rest was tolerable. The coconut shrimp and fried shrimp were kind of dry, but the shrimp tempura was fine.\n\nWhat wasn't fine was the bill: for JUST that and the drink, after gratuity I was paying $55 BY MYSELF. People, I just got fired! Just because I was paid out my vacation pay doesn't mean I need to be spending it all on dinner! I'll stick with Lazy Joe's for some good, affordable shrimp from now on.\n\nI guess stupid really is as stupid does.", "type": "review", "business_id": "cP6pQuoPKIoaFQBa09e-Vg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xTjaPOeG9zH_8fdQJ6QPhw", "review_id": "00-vUn1i-JDH4e7SU5CHjA", "stars": 4, "date": "2014-03-01", "text": "As with any Mexican restaurant you expect fresh chips & salsa and this place does not disappoint!   Not only do you get a traditional salsa fresca but also ceviche salsa.  If you also want some heat don't miss the salsa verde (green) they serve with the shrimp empanadas...so good we put it on everything!   I already mentioned in my tip that the portions are well sized & well priced.  The patio is also a great place for small or large groups & instead are large family sized tables.  The only downsides - service was slow & the mariacchi ask for a $20 tip per requested song ($5-$10 is pretty standard).", "type": "review", "business_id": "6Z6bvIHGpPlwpkZAwfXT1w"}
{"votes": {"funny": 0, "useful": 5, "cool": 1}, "user_id": "zIMgUfYSmyAVapbUV9Z7KA", "review_id": "wQeAKPe-k2xJ4nStzsDm_w", "stars": 5, "date": "2013-11-01", "text": "The service is off the charts.  Always friendly, attentive, never pushy.  Food is good, prices are very reasonable (especially compared with Lindo).  I don't know any place where you can get lunch fajitas for less than ten bucks.  Seems word has gotten out as well, it's getting more crowded as we visit more (which is great).  I hope they do really well.", "type": "review", "business_id": "LwTK65TMrmtjpdZRloQDwg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rR7aGj3Yvm9lF4gJfmo73w", "review_id": "9yjKQe7_aaO_JRpG3Gm3MA", "stars": 1, "date": "2014-06-03", "text": "Overrated. Took over 30 minutes to get fajitas. No desire to return", "type": "review", "business_id": "LwTK65TMrmtjpdZRloQDwg"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "a7UwINZeNuTOzdUQnCxczw", "review_id": "y6Dw2JiXwtqOyIlqFCLl_g", "stars": 5, "date": "2013-08-21", "text": "Love Love Love this place! I cannot count how many times I have been there, I think we have tried just about all the cupcakes :) The Director (yummy Chocolate Goodness) and the Rock Opera( Bubble Gum) is my 3 yr. old's fave :) but all are so good.  The Choc Covered cherries and Oreo cookies are yummy too :)\n\nAnything you get will be good!  Stephen and Jarrad are two creative genius' and are so nice to deal with too.", "type": "review", "business_id": "xljzptv_xveLu9625KRiuw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vpifYqroBicMCeht9n6Bhw", "review_id": "GxE4zGfdxvj5f4dOZtFRKg", "stars": 5, "date": "2014-06-13", "text": "We found a roach in our bathroom and decided to call an exterminator. We read great reviews about Insectek. We called them around 3pm and had someone out before 5pm that same day! The exterminator Zack was punctual, friendly and very knowledgeable. We are new to Arizona and he shared some great information with us about bugs, scorpions etc...We will definitely be calling him back in the future and recommend him to anyone with pest problems. Great service all around!", "type": "review", "business_id": "XF3cjthWdvfMDVBHVjb0jg"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "O8azZwdEtrfm_GxrwfChqQ", "review_id": "7ixfRFYlYgprBVVBkbvTMg", "stars": 5, "date": "2014-05-19", "text": "I had Pete come out and install some security cameras at my house.  He was here within a couple hours to give me an estimate and had the job wrapped up a couple days later.  His work was excellent! He made sure to clean everything up after he was done which was much appreciated.  I'll be using him for some other projects in the future.  He's my go to handyman.", "type": "review", "business_id": "I6wpfXSVjUdj7wN3p_19OA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "L3Uglrqyxw_O2m688NMvDg", "review_id": "x7uHf9t7QmcMwCssjyiESA", "stars": 1, "date": "2013-10-09", "text": "Where do I begin?! I'll start with the fact that I'll never waste my time on that joint again. We visited McFaddens at about 4pm on a Monday afternoon. Not exactly a busy time of day. There were approximately 4 tables sat in the entire bar. We were the fifth and they sat us behind a pole in the back of the restaurant. Apparently, it was 100 miles too far for the waitress because she took FOREVER to give us service. My husband ordered a Corona Light and I water. It took about 15-20 minutes for his beer to arrive and it was warm!  Then we ordered nachos with guacamole and beans, chicken wings and mozzarella sticks. Guess how long it took to get our food.....40 minutes!!! We were informed that no one realized there wasn't a cook in the kitchen. That's awesome management. Well, once they got that figured out, I think they put half a cook in the kitchen because our nachos had no beans or guacamole and the mozzarella sticks had leaked the cheese out the bottom. So, all we had was hollowed out bread crumb casings with a giant ball of cheese on the bottom. The food wasn't even good. It was a waste of calories. My husband dared to order another beer which took another 20 minutes. It came after the food was gone and it was also warm. It was happy hour but, who cares when you only get 2 drinks every seven days. The service was SO slow! She was nice but, slower than molasses! There were like10 employees roaming around and only 5 tables and it took us 1 1/2 hours to wait for food, drinks and service. At that pace, we could have enjoyed a nice fine dining meal. We can easily spend 1 1/2 hours in a bar but, that's when beverages aren't strapped to a turtle's back. I'm not a complainer but, save your time and money, at least in the middle of the afternoon.", "type": "review", "business_id": "jS3cHd1E5TuUZbQWpBZqVg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bc7_eEpss2fWMScpD3SisQ", "review_id": "cyCKl97ctDywrBBFOcetKA", "stars": 4, "date": "2014-05-11", "text": "Pizza and salads very good as well as the pookie. Only complaint is a few of the staff are pretty rude not very customer friendly. I'm still a believer in telling a customer thank you and some response.", "type": "review", "business_id": "93fEJZYc3B-jOMaXce7G5A"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "P2FD7E392y01VcBVWli6og", "review_id": "ttiRppL1_PrgnjngAgnsfw", "stars": 3, "date": "2013-09-19", "text": "Two Words = Fresh Quality.\n\nOne of the freshest high quality burgers I have ever tasted.\n\n1 star = Great menu. The menu has a variety of options. I thought it would be a simple menu, but I like the fact that they have more options than your average fast food burger joint. They even have 2 kinds of potatoes for their fries! Sweet! I had a bacon cheeseburger with avocado. Yum!\n\n2 stars = Freshness. You can really taste the difference in the meat here, and it's good!\n\n3 stars = They bring the food to you. I like that kind of service at Fast Food joints!\n\nLacks the 4th star because the SmashFries are super greasy! Sweet potato ones are not so greasy, and they are really filling!\n\nLacks the 5th star for this location because it smells really crappy outside (sewer smell) and it comes in the restaurant and ruins your whole dining experience. Yuck!", "type": "review", "business_id": "mo-zc81Q52d-iz5Put3zzw"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "sovduOweKgPFAwA-MmmtzA", "review_id": "pYBGbLHbtVIxWtKpTmNKrg", "stars": 2, "date": "2014-04-20", "text": "After reading some positive reviews I wanted to try Buddy V's for some decent Italian food. It's a nice place with a nice view of the strip, with the neon lights flickering in the background. Here is what we had:\n- Grandmas Meatballs. These were pretty tast but our order was cold. I know they are not made to order  but you expect them to be warm.\n-Calamari Fritti. You basic calamari with 2 slivers of a banana pepper and grilled lemon. Another dish that came out cold.\n-Lisa V's Linguini and white clam sauce. This dish has the most balanced flavors and a decent amount of clams. This was the 3rd dish in a row that was cold. I would have mentioned it to our server but he wasn't around much.\n-My mother in laws shrimp scampi. The one dish that came out warm . It had pretty good flavors but not the best scampi I ever had. My mother in laws is much better!.\n\nWhere most authentic Italian restaurants might offer you freshly grated parm you had to ask for it and it took a few minutes to let the food get even colder. We also asked for some bread, mainly for the scampi since it had a nice broth build up in the bottom of the bowl. The waiter looked as if I was asking for ketchup at a steak house. Another dissapointing Italian meal in Las Vegas, my search continues!", "type": "review", "business_id": "y8VQQO_WkYNjSLcq6hyjPA"}
{"votes": {"funny": 1, "useful": 4, "cool": 4}, "user_id": "A3wvusOfaIlje2GumyOkBw", "review_id": "4AEjJwlbIfaadR_fsOMsgA", "stars": 4, "date": "2013-12-29", "text": "I was lucky enough to see her first show on 12/27 and I was not disappointed. Britney sings all her top hits including 2 from her new CD, \"Perfume\" and \"Work.\" Her performance brought back good memories from the past decade that I wanted to cry! Although she does lip-sync throughout, she puts up a good show.\n\nBritney doesn't dance/move like she used to, but she's pretty darn good for having had 2 kids. The production still needs to work out some kinks with the sound (at some parts it was too loud/screechy) but the special effects and lighting were spot on. I especially loved the background sets for \"Circus\" and \"Toxic.\"\n\nBritney is quite energetic and keeps you singing along and dancing the entire show... I just wish she spoke more to the audience!\n\nOverall, if you're a fan and know most of her songs, you'll love Britney- Piece of Me!", "type": "review", "business_id": "CycoHGY_dcTD8YcylyYO-w"}
