{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KBLW4wJA_fwoWmMhiHRVOA", "review_id": "dNocEAyUucjT371NNND41Q", "stars": 4, "date": "2012-03-02", "text": "Been going to Dr. Goldberg for over 10 years. I think I was one of his 1st patients when he started at MHMG. He's been great over the years and is really all about the big picture. It is because of him, not my now former gyn Dr. Markoff, that I found out I have fibroids. He explores all options with you and is very patient and understanding. He doesn't judge and asks all the right questions. Very thorough and wants to be kept in the loop on every aspect of your medical health and your life.", "type": "review", "business_id": "vcNAWiLM4dR7D2nwwJ7nCA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pgKOL4k5tWCWS9VIc33EoQ", "review_id": "khGSK7FRLuRWnnTE6I0stA", "stars": 4, "date": "2012-02-16", "text": "With a recent addition of a truck driver for a BF I have found myself frequenting truck stops to dine. This little place is quite a pleasant surprise. Basically it is just great home cooking. Everything is homemade and quite good. The baked goods in the front counter were amazing. The size of the cinnamon rolls was insane. And of course I couldn't leave without a piece of pie.", "type": "review", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u5xcw6LCnnMhddoxkRIgUA", "review_id": "ZYaS2P5EmK9DANxGTV48Tw", "stars": 5, "date": "2010-12-04", "text": "I really like both Chinese restaurants in town.  This one has outstanding crab rangoon.  Love the chicken with snow peas and mushrooms and General Tso Chicken.  Food is always ready in 10 minutes which is accurate.  Good place and they give you free pop.", "type": "review", "business_id": "RgDg-k9S5YD_BaxMckifkg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aYhKsAUQaaRGgdgcZC5XAw", "review_id": "KShIc8cUxbPCGDrJRsVvYw", "stars": 3, "date": "2007-09-01", "text": "If you live in Madison, you too probably have a love/hate relationship with Charter.  It's nice to have high speed Internet without having to buy a useless cable package, however it kind of sucks that the service is insanely inconsistent.  As someone who has spent countless hours with customer service representatives ranging from inadequate to empathetic and resourceful, I have no idea where the problem lies with their service.  (a.k.a. why am I not consistently getting the Internet service that I both adore and pay so much for?) However those of us who just want high-speed Internet without phone or cable one just sort of has to suck it up as this is really the only option.", "type": "review", "business_id": "oLctHIA1AxmsgOuu4dM6Vw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hhVKwwMkejIS9f5_OILtBw", "review_id": "WvGzFVHI-ttlhYzALyJnzg", "stars": 1, "date": "2012-09-20", "text": "Pros:\nDrinks are ok\nRib eye steak good medium rare with baked potato\nService was friendly and food served warm\nFood affordable\nrelaxing environment, local feel\n\nCons:\nScallops was to salty\nfurniture outdated\nwalleye fish was eh, not enough flavors\n\nIt's very Divey, not impressed even when my meal was free.", "type": "review", "business_id": "rdAdANPNOcvUtoFgcaY9KA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5yLRVxHgnCQ5taPJ4cl0-A", "review_id": "7_83JssVJ7x3ZTCvLMFLdQ", "stars": 3, "date": "2012-10-17", "text": "Friday Night Fish Fry! reasonable prices and good service. Go with the standards and you will enjoy!", "type": "review", "business_id": "rdAdANPNOcvUtoFgcaY9KA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xOe-ZopdYiu8ijimmtdrnA", "review_id": "VQ5ulvpbdtMG62G-6YZEsg", "stars": 5, "date": "2008-08-30", "text": "I think some of the best Chinese food in Madison.  A little pricey but a few dishes always feeds me for at least two additional meals.", "type": "review", "business_id": "SKLw05kEIlZcpTD5pqma8Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Orf6p06pNjMHuPXypLbn-w", "review_id": "9mnSxTZlMmtt7uWj_nLsJQ", "stars": 5, "date": "2011-10-30", "text": "This place is wonderful.  One, Almost anything on the menu can be made gluten free.  Two, They have about 7 different types of loose teas to choose from.  Three, The food is GREAT!\n\nMy favorite dishes are the Three Delicacies Sizzling Rice Soup and  the Tofu Lettuce Wraps.  I am not lying when I say that I have NEVER had a dish I didn't like here.  The food is never greasy, never oversauced and never overcooked.  The seafood and veggies always have a really fresh taste... I seriously have no complaints at all.\n\nI miss you.", "type": "review", "business_id": "SKLw05kEIlZcpTD5pqma8Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "P8XxDN4-AZJmgqYpv864Nw", "stars": 3, "date": "2009-07-12", "text": "After a wonderful day spent sitting down at the Memorial Union, drinking beer and reading through the Sunday newspaper, hunger got the better part of us, and Mexican food sounded yummy.  So, our small group made our way back toward the Middleton and decided to take a short walk over to Mi Cocina.\n\nWe arrived at around 6:00pm on a Sunday and were promptly seated.  The waiter brought us chips and salsa immediately, and then took our drink orders.  Within a few minutes, our sodas arrived, along with a cheese dip.\n\nWe quickly scarfed down the salsa and cheese dip; the salsa was initially mild but then had a nice little kick to it at the end.  The chips were a thicker cut chip; they weren't the slightest bit greasy.  The queso was excellent - nice and hearty, white cheese, delicious.\n\nWe ordered our entrees and within minutes our food was available.  There was a slight mix-up with my order - I had requested chicken burritos but received beef.  No big deal; the beef burritos were decent - some chunks of potato were an interesting touch.\n\nMy dining partner ordered a sampler plate, which came with a chicken burrito, a chicken enchilada, and a tamale.  It was good as well; the chicken was far better than the ground beef.\n\nService was beyond excellent - very fast, very attentive, and as such, we left a nice tip.  Only complaints?  A tad pricey - our meal was $26 without any beers/margaritas, and there were a ton of kids in there, which was a bit distracting.  All in all a decent experience.", "type": "review", "business_id": "77ESrCo7hQ96VpCWWdvoxg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "9iD8gqFz7tweptIFNbxmqA", "review_id": "r0Rta5xi6NZvo7ekFVGYkA", "stars": 1, "date": "2012-11-04", "text": "The sales people in this place are the rudest I have ever seen! I walked in there and I was ready to purchase a RDX after doing research online; all I needed was a test drive to make my decision. First I was waiting for 30min so somebody would help me, and then when they did they treated me very badly and were hesitant to let me do a test drive. Then once we finally went to test the car, the sales man that was helping me made a comment like - this car was fully redesigned and Acura wants to target young and successful people - as if we weren't successful enough or good enough to buy the car. EXCUSE ME? So because I look young you assume I don't have enough to buy the car? I was very offended and disgusted, since I was very interested in that car. In the end I went to another zimbrick in town and purchased another car. On fish hatchery road they treated me very well, and aided me with all my needs.\nI am very offended and was never mistreated in such way in my entire life.", "type": "review", "business_id": "9brW55Vzyi3ItboHWfoepg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gxloYXYIO3E64yTr5RXt9w", "review_id": "ObWcWsSDYB0BnYldwHxURQ", "stars": 5, "date": "2012-12-16", "text": "Look, I love this place and I don't want you to join. It's the antithesis of the meat market known as Princeton club. \n\nSadly, smoothie bar/cafe is gone. \n\nHarbor is a really laid back health club that has everything that I need and more. The only downfalls are that it's super old and kind of put together like a corn maze.\n\n8 years and counting!", "type": "review", "business_id": "x7xS2DJvu8klyNzcpN8QHg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1_CjHZLHzNaKIFFIAcZFuw", "review_id": "7PTZqbWx8_bkFrr0WMSFIA", "stars": 4, "date": "2013-02-04", "text": "this place is great for what it is.  i've never been disappointed - even after the lunch rush is over the food is kept fresh and rotated.  i can't speak for dinner, but lunch is as good as chinese buffets get in the madison/middleton locale.  jade garden is good if they are busy, but they let the food go to pot when they slow down a little.", "type": "review", "business_id": "MKsb2VpLB-0UBODcInDsSw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-XnKJ4tIT8r9R5n2DHPPWQ", "review_id": "8cHvM75mD89qXZ1sGDK1PA", "stars": 3, "date": "2013-09-13", "text": "This place is average. Lots of food. Speedy staff. It's a casual buffet. Great for business lunches", "type": "review", "business_id": "MKsb2VpLB-0UBODcInDsSw"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "CdKX95dMySpzWX4XQ2k01A", "review_id": "1uz83OilC0giQQ_Zh6zVww", "stars": 5, "date": "2009-05-05", "text": "I've been back here several times since my first review, and have been continually impressed with Prairie. The food is always spot on and the atmosphere is so comfortable. The cafe sandwiches take one step towards gourmet--the tuna and egg salads are made in-house with a little twist from the same old. All are served with a choice of side; I favor the black bean and corn salad. Breakfast is no exception to Prairie's perfection--my scrambled eggs with spinach and pesto were fresh and filling. And it's hard to go wrong with any of the real fruit smoothies or coffee drinks. Prairie is exactly the way a cafe should be.", "type": "review", "business_id": "ShEYKerTwb2LSORE5o_s7A"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "DQnJTTiNzWiDvhy2O32Elw", "stars": 4, "date": "2013-06-25", "text": "I've been here at least 8 or 9 times since the August 2010 review; time for an update.\n\nPros:\n+ Solid breakfast food, especially the special scrambles. Can't miss.\n+ Great breads - I've tried nearly all of them and they're excellent\n+ Altera coffee \n+ Friendly staff\n+ Bakery items (cookies/pastries) are superb\n\nCons:\n- Cash only\n- Slightly expensive\n- When busy, seating is hard to come by; small space\n\nNo complaints with the food - it's always been high quality. We were there today as part of a team outing, and several folks commented about the pancakes - they are truly great, with a good sear, excellent flavor, and perfect texture. I had the scramble, and it was as good as always.", "type": "review", "business_id": "ShEYKerTwb2LSORE5o_s7A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aoDM2oE3P4dNoFDKRljVkg", "review_id": "doRZNff0z_XBo38DxmmpFw", "stars": 4, "date": "2013-08-11", "text": "I like that I can add items to a base entree to make it my own.  I love the Thai peanut lo mein.  the noodles were easy to eat (they were cut shorter).", "type": "review", "business_id": "KW6HejC-67KSL9J8Cz1dSw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-SsOMDS_QweHR588jfosuw", "review_id": "ZGFfMuL7d3zhaWalCjYyDw", "stars": 3, "date": "2014-05-26", "text": "We come here a lot and the food is never consistent. Sometimes it's really salty. Other times it's too spicy or not spicy enough. There must be several different cooks because the sauce is never the same either. We still like the adventure of what we may get today. Stop for quick bite on the way home. If you tried it and didn't like it you may want to try again, you may be surprised at how much better or different the next time may be. \n\nThe servers here are friendly enough but some times they difficult to read. Place is not always clean but it's clean enough. I don't like the fact that some of the tables are falling apart but there is always customers here so they must be doing something right.", "type": "review", "business_id": "KW6HejC-67KSL9J8Cz1dSw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Pz5MV9HSOs-wfUfFEHbeHQ", "review_id": "micEjqS7PwD82jIyp_8Czw", "stars": 3, "date": "2014-02-12", "text": "We go here pretty regularly. The food is good, but by no means great. It is pretty divey looking (photos of food, etc) and they mess up our order abt 20% of the time, but still a good value for the price. General Tso's chicken is great. I asked for brown rice once and they gave us fried rice... to their credit, it was brown :)", "type": "review", "business_id": "wl-7A4jC0f27MOEmW-XTbQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "syZcFGfqXjbsPKNBsJbdTw", "review_id": "heg8ii5uV3c9rWk_RfbFwA", "stars": 2, "date": "2010-08-30", "text": "The ice cream is excellent but a little pricey.  The service is less than stellar.  Our daughter bought a cone and discovered a hair in it.  When we returned to the counter and informed the employee that sold us the cone she actually said \"We've been getting that a lot lately\".  Great!\n\nAlso, if you order anything to be picked up later, like a birthday cake or cupcakes, make sure you call before you go to pick it up as they seem to be less than organized with their orders.\n\nI gave them a 2 star rating based on the excellent flavors... it should have been at least a 4.5 with some attention to customer service.", "type": "review", "business_id": "AYoLKzRFajucKnjIFxc__A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s__z7O5ybdky0KmXkA6MZA", "review_id": "y4UCrfk5uX7KI_TpqCS4WQ", "stars": 2, "date": "2014-02-15", "text": "Agreed with Dave's review about the staff and service being a hit or miss. I normally don't make stops anymore to cold stone restaurants because their ice cream is so expensive. Plus, I don't care for the taste of their ice cream. Maybe it is just me, but I think it's overrated.", "type": "review", "business_id": "AYoLKzRFajucKnjIFxc__A"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ONt3bdggBy17Pu19_xtUQw", "review_id": "7pG3oHuywAhHy3hTs9cD-A", "stars": 3, "date": "2012-03-31", "text": "Hotel staff make this place a good strong 3 stars other than that, that's it.  The shower leaks and the walls are pretty thin. Towels hurt ya if you like soft cotton towels.....uh it's good for the price is a good area to eat and do your Middleton thing. It's a decent hotel for the price. Could use a face lift bit it's all good (: the geese are not friendly do not touch! FYI another last tip is that the windows are not double pane so the noise level is high from outside. Great price and staff but noise level sucks :(", "type": "review", "business_id": "naqkXvhoqljvA7kuo15gEw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "lv6XD_QZKcYqS62MWBaPdg", "review_id": "T4LMlqm85ZqrRdVm4pl1Zg", "stars": 5, "date": "2014-06-19", "text": "I love this place.  I love the ambiance, the food, and the drinks.  It's even better when they have a lounge singer in the background.", "type": "review", "business_id": "koRLvzIl-4fCybOIdk56jA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sgPGtlcOEZqLBg9auxkdpg", "review_id": "mJZc2Z-QkEdQXR2UzP-_-Q", "stars": 3, "date": "2011-08-02", "text": "I was visiting on a business trip and didn't know what to expect. The hotel is fairly new and has nice clean rooms, a decent gym, a large indoor pool, and good hospitality.  The breakfast is not free, though, so I was embarrassed to be admonished for taking a granola bar from a basket on my way out. The location is superb if your a shopper..it's right next to a new mall.", "type": "review", "business_id": "MBQc_jlZ3nlMOZy7SUM_5Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j9Qxg1YKx9uJXoSYTMgDAg", "review_id": "Cv4tvvUz2TzUl3AhsWMJRQ", "stars": 5, "date": "2013-09-16", "text": "Matt at Bennett's Auto is very knowledgable and skilled with BMW's. I brought my car in and he was able to replace the belt along with my driver-side mirror fixed at the perfect timing and good price. I plan on bringing it back to have my breaks and other things done in the future. I highly recommend Bennett's to anyone who needs work done on your BMW.", "type": "review", "business_id": "LOp0ciu7XhZwTqZUWG8qCw"}
{"votes": {"funny": 2, "useful": 8, "cool": 0}, "user_id": "lC0KGXmIhyjzghBUlVnkhQ", "review_id": "l8iavrL-uEoljXj5xNSItg", "stars": 1, "date": "2013-11-11", "text": "Disgusting. \nThat's the only word that comes to mind after walking front of store to back and seeing piles upon piles of clothing and items askew on every table, shelf and rack. I'd understand if it was 7pm on a Saturday (weekend) but this was Monday morning y'all, and the place looked like the pits! What the heck BR? You are a mess! An absolute mess. And you're consistently a mess. \nI walked in today with the intent to buy a suit (40% your entire purchase... sign up for their emails) but I couldn't even shop the racks with crammed half on hangers, half off hangars pants and jackets. This place needs an iron fist. A store manager who can shape this thing up and restore BRs name as a Gap Inc brand. Someone would have to tell me they did a complete 180 for me to return.", "type": "review", "business_id": "xm1RtU63jxjYsm-7dzGaZA"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "LkmcnJNBfnvaZk6MoE_k5w", "review_id": "Kmj-m-9x0OiHHuTDUcrjVQ", "stars": 2, "date": "2011-01-07", "text": "Tonight the fam got Nitty Gritty takeout, and for me it was a disappointment. I had suggested the NG because I'd been craving chicken tenders all day. In the past, NG's chicken appeared to be hand-breaded and had a decent dose of pepper in the breading to give it some flavor. Tonight's offering was a step above cafeteria chicken strips. Flat, factory-breaded, flavorless, and all of them with that gross gooey translucent strip of whatever you get in cheap chicken. Making it worse was the addition of soggy fries and not-as-good-as-I-remembered Gritty sauce. For almost $10, I'm calling this a total bust. Yet another restaurant I can cross off the list for upping price and cutting quality.", "type": "review", "business_id": "6oDZ78JiSKjXVLcurCpnhw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "06YTa8A3QhWXv4l6Htr91A", "review_id": "Mke_lb7OjcIyBSBX_k09cQ", "stars": 4, "date": "2011-03-06", "text": "Recycling in the restaurant.  Our favorites are concrete shakes, the new sweet potato fries, grilled cheese, and cheeseburger.  Very nice & friendly staff.  Food was brought out quick.  Clean tables & restrooms.", "type": "review", "business_id": "kiAsweI4sOjDzGyz3Y_HsQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DWXc9EDCXpCct1uBLHT4Fw", "review_id": "wFQ_1_plqK-uwjfIbl3q2A", "stars": 4, "date": "2012-07-04", "text": "Simple, relaxing surroundings for a good pedicure.", "type": "review", "business_id": "mbtGl2I2A2To-8jiggN99g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "URw2mP76_1JQFZXKAwda4A", "review_id": "39H0t8ZSG1HW8tklMWGY3A", "stars": 3, "date": "2013-04-14", "text": "The food is very good, but overpriced.\n\nMy wife's favorite dessert is bread pudding and I was told this place has the best bread pudding around, and it did not disappoint, it was excellent. The food was also very good. My wife ordered mushroom and onion ravioli and her dish was better than mine. I ordered a pasta dish with sauteed shrimp, spicy italian sausage and chicken. It was also excellent, but I thought it could've done without the chicken. I started with a caesar salad and it tasted really fishy. Also, the portions are huge, if you're going with one other person, you could probably split everything.\n\nThe service was excellent, but the decor wasn't very appealing, and as other reviewers have mentioned, it's a very small space. I'd check it out, especially to try the bread putting, but it's not a must.", "type": "review", "business_id": "q8fD82us6uuGufvI44NoAg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LJ2LofejJtbE7INygxpJPg", "review_id": "HHdD4gjac13kA4yc6OkJog", "stars": 4, "date": "2012-01-16", "text": "Came here on a tour with a big group from meetup.  The tour guide was nice, and did his best to keep the group entertained and under control.  $5 for a tour, with a good amount of samples and a free glass.  If you're looking for something fun to do, I'd recommend it.", "type": "review", "business_id": "Wn8NhS-L1ck6jbTjX88Kkg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lZq-CaPk58whjRxjnLIPQg", "review_id": "uxoUhBu3cGjuZukd5x5oVQ", "stars": 5, "date": "2013-02-11", "text": "Finally went on their tour this Saturday, which I actually felt obligated to do, considering how much of their product I ingest on a regular basis. \n\nOur tour guide was very lively and fun, and knew a looooooot about the process of brewing beer. We also got a small drinking glass as part of our tour, and 3 beer bottle caps that can be traded in for a sample of anything on tap.\n\nYou can also trade in all 3 caps for a pint of a single beer, which I wish I had known about before I eagerly sampled my first beer. \n\nAnywaaays, the tour was short and sweet, and the beer cold and refreshing. \n\nA perfect break on a Saturday afternoon.", "type": "review", "business_id": "Wn8NhS-L1ck6jbTjX88Kkg"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "q2_xNGF6nhsOoD2NpOa5dg", "review_id": "kH-FTmFytW9IDZProzh5xQ", "stars": 2, "date": "2013-02-17", "text": "22 minutes to get my order. Terrible service! I was the only one in the store when I placed my order although there were 3 cars in drivethru. Not acceptable! The only thing keeping this from getting a 1-star review is that (1) the restaurant was clean and newly remodeled, and (2) they did get the order accurate... again, after 22 minutes... not acceptable!", "type": "review", "business_id": "3zD6rxB92Mr0jb-LoYFFWw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "G9NsTOubFN2EZTpY_eumZg", "review_id": "IwfAdWYU6_q3CeLOF2I1Tw", "stars": 4, "date": "2011-08-23", "text": "Panda Garden is the best place to get Chinese food in Sun Prairie. And they deliver which is a plus in my book! I've eaten in the restaurant a couple of times, but usually do take out. I've never had anything I didn't like there (and we've tried a very good array of items). Tonight we had the Garlic Shrimp and Chicken Lo Mein. Both were awesome! The Garlic Shrimp had a nice spicy kick to it, but still had a TON of flavor! The crab Rangoon and pot stickers are also tasty!  Pricing is very reasonable for what you get!", "type": "review", "business_id": "2pmMehsVKnwhgWPSOxrkjA"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "jqMa8QhylASA1HT_CG9RyQ", "review_id": "cgCncidvQlCl6JoA-BFpPQ", "stars": 5, "date": "2011-04-02", "text": "I have been here twice, both times for breakfast. Both times I was *very* happy. \n\nI had the greek omelette (feta cheese, spinach, you know the deal) and thought I had died and gone to omelette heaven. Best I ever had. It came with this delicious tzaziki-type sauce on the side, which I should have brought home with me (I did finish the omelette at the restaurant). \n\nThe second time I had this very interesting strawberry fritter french toast. I love french toast and all things sugary, and this was definitely sweet. It sort of had a filling (that was the strawberry part). It was delicious, but not for those who claim they don't like sweets. \n\nThe service is terrific, very fast and genuine. The coffee is hot and just right. \n\nYou'll likely be surrounded by various old men (with the occasional younger man sprinkled in), but these old guys know a good breakfast when they find one.", "type": "review", "business_id": "yV-eB-pQVeWE7W-WPC8BUg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Kir_O4_skOLh0imig7MBlQ", "review_id": "gAunV829CnFzY15AX08glQ", "stars": 5, "date": "2012-11-28", "text": "Have been going to MCV Salon for more than a year. Always excellent service. Corina is friendly and energetic.  I always get a fantastic haircut.  Very well put together shop.", "type": "review", "business_id": "O9j6UX2LHdszkExzJ-v-BA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "u5xcw6LCnnMhddoxkRIgUA", "review_id": "2OyILczlEW7vlxcHU0-J1w", "stars": 5, "date": "2011-12-17", "text": "Bought three guns from there.  The owner, Trig, probably not a coincidence to trigger, ws very helpful everytime.  Very legit and better prices than the Gander Mountain down the Road.  Would recommend!", "type": "review", "business_id": "Bw0_JDQnZeYf-2xTCpVEHA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "c8wG6aJR8x__951b3LhvCw", "review_id": "jhTN_myFGtV3mR0nmgfU-g", "stars": 5, "date": "2011-08-03", "text": "Had our wedding here and it was fantastic! Absolutely loved working with Stacey - she answered all our questions and got back to us in a timely manner. They were totally flexible and the servers/bartenders were phenomenal! We have had nothing but compliments about our wedding, I would recommend Windsor in a heartbeat!\n\nBecause we booked our wedding reception on Friday night we were told we would be receiving a \"complimentary\" champagne toast. After the wedding though we received a bill charging us for the service fee and gratuity for pouring the champagne. We paid it without any grievances, but it would have been nice if they would have informed us of this when we were going over the preliminary invoice. Other than this minor issue, Windsor was wonderful!", "type": "review", "business_id": "22UfD-4PEOgXTr6sev5McQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_cOXx98-ZiOgxjib-ZdYGA", "review_id": "NC3rltnqSCSozS9H9gMjiw", "stars": 5, "date": "2012-08-03", "text": "My daughter's Quinceañera+/Sweet 16 Formal was held here at Lake Windsor Golf and Country Club on Sunday, April 10th, 2011.  I scouted a few locations, with a few places never getting back to me.  We've a large amount of family and friends for this traditional celebration so I needed a place that was both Big (enough for 300+ guests), Bold (that WOW factor when they even entered the building, foyer and ballroom) and Beautiful (for a place that would accentuate my daughter and her Epic Ballgown.)\n\nI sent an email to Lake Windsor with no response.  Two weeks later I called, turns out my email was never received. See?  It pays to follow-up!  My contact from then on was with Ms. Jennifer Larson, the general manager to Lake Windsor Golf and Country Club.  \n\nI need you to understand that this traditional event was very important.  I have been thinking about my daughters 'Coming of Age' party since she was five (5) and I went into the planning stages of this event early in 2009.  Jennifer and I spoke by phone and we met up the following afternoon. She was very informative, knowledgeable, and welcoming. No one had had such an event there at Windsor so she was very excited about this one!  We read and reviewed the contract, gave her a non-refundable deposit check and we were in the booking book!\n\nMy daughter Dylilah and I reviewed the menu and decided on a buffet style lunch and the vendors I worked with (Cake, Balloons Statues, Slide Show, Lion Dancers, etc.) had no issues having access to the property the day of.\n\nIf you'd like to see how great it turned out and how beautiful Windsor (and my daughter) really is, we've got the video here: http://youtu.be/DCX7KZQCzcE?t=2m8s\n\nNo, they are not inexpensive but, you get what you pay for and truly, I'm sure Lake Windsor will take your wishes and concerns seriously and execute them into an unforgettable time as they did with us!", "type": "review", "business_id": "22UfD-4PEOgXTr6sev5McQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "vZz8vLahP6Qcoh6a5SZGqw", "review_id": "_FGQIF-O79_e7DYM5Hd3gA", "stars": 4, "date": "2011-03-26", "text": "Great place to get a sweet treat or custom made sandwich. Lots of cool gifts.", "type": "review", "business_id": "jpxlSFhdrtbNyxS6vB036A"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "4bsu8DLfDkBV84RKn6UmcA", "review_id": "MwTAE-dbsDeMf6aLyquBLw", "stars": 5, "date": "2009-08-31", "text": "I know... it's Target, but it's got pretty much everything you need short of a butcher shop and babysitters. Staff is very helpful... it also houses the closest Starbucks to my home. Since we're talking about 2 miles, that's a bit sad, but oh well..", "type": "review", "business_id": "5FlmcwCLqFveKQ-GVeolig"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "eMW8-Lw9C4OJtyoE2S2Hog", "review_id": "wXp7d_FF4mwIfHrheGjIiw", "stars": 4, "date": "2012-07-20", "text": "Good stuff!  Had the sesame chicken, general tsa, pot stickers, and crab Rangoon.  All were great, and were ready quickly.", "type": "review", "business_id": "oX6KamASYXnMIe5kpVhezw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jFbqK9jzIrJ0nC8C7syxVg", "review_id": "YoNaLlnFuo_rsihNx_DWRg", "stars": 3, "date": "2012-03-18", "text": "It's not the best or most authentic, but I love it.  The service is great and combo #1 is a home run.", "type": "review", "business_id": "S4TWo9X6b3gU6uucj4JN3g"}
{"votes": {"funny": 2, "useful": 0, "cool": 1}, "user_id": "6kp815UUjK--ukUjmDlSCQ", "review_id": "V-GdyI5y4gpY5-8MyzJBHQ", "stars": 1, "date": "2013-11-19", "text": "This is where you go to get wrecked............ by cheese.  If you like cheese A LOT, you can order any of their delicious combos smothered in ooey, gooey, creamy, warm cheese.  \n\nIs there actually any real food underneath the gigantic blobs of cheese?  Strap on a portable oxygen tank and dive in to find out!\n\nIn the 1988 film \"The Blob,\" an evil life form goes around eating people, only at Laredo's you can finally get yer revenge and eat the blob...............if you dare!  \n\n*blurp *blurp*", "type": "review", "business_id": "S4TWo9X6b3gU6uucj4JN3g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "U4qqz9pPKaVQv6JrvMceTg", "review_id": "79EL4vj8-uXRNwtmzOM-dA", "stars": 1, "date": "2009-07-01", "text": "No vegetarian options, and staff always too busy and not personable.", "type": "review", "business_id": "xZwaUcrFMSY1O9dK2dAUpA"}
{"votes": {"funny": 4, "useful": 2, "cool": 3}, "user_id": "lC0KGXmIhyjzghBUlVnkhQ", "review_id": "H2oktOUmnn0y4qZoyPA7Sw", "stars": 3, "date": "2013-04-05", "text": "Like most Chinese in Madison (it seems) China Wok is pretty middle of the road. I won't say it's the worst I've had... that honor was given to Wong's on Atwood, but it's certainly not the best. I have 3 indicators for good Chinese food. \n\n1. What color is the sweet and sour sauce? (It shouldn't be red.)\n2. How thick are the crispy noodles? (They shouldn't be, they're noodles, thick \"noodles\" are just fried wonton wrappers.)\n3. What are their specialties. (If they all sound American, they're not special.)\n\nWhile China Wok has red sauce, thick noodles and specialties that I could probably make it's decent when you're in a bind, have nothing in the fridge and live 2 minutes away. They also have a pretty large delivery radius, and it's only ten bucks minimum, so even if you're solo you can probably hit that mark. \n\nExtremely nice folks though, so for convenience and pleasurable peeps, I'd probably hit them up again.", "type": "review", "business_id": "xZwaUcrFMSY1O9dK2dAUpA"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "90Afh2Z4ogJq7y23nfq5wA", "review_id": "Q-cZ0Rvv1qlirJfA_2_UUw", "stars": 5, "date": "2012-05-28", "text": "My girlfriend called this place (found them through Yelp) after another salon butchered her bangs and cut them too short.  They let her drop in with no appointment, fixed her bangs, and made her very happy. \n\nThey are really nice people, too.  She will definitely be going back there for any future hair appointments.  Actually, I probably will too.", "type": "review", "business_id": "T9l9Z3FKMSCIYvsP2g4efw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "47iegx6sG6BmNRYybm-BoQ", "review_id": "pPtoMEJzo37FwulOiFVh7g", "stars": 5, "date": "2014-04-28", "text": "We discovered this place when my 4 year old gave herself a haircut and she needed some additional help.  It happens to be conveniently located down the street from us and was recommended by a friend.  Turned out to be a good experience.  They are very friendly, good with kids, and reasonably priced.  Now the whole family goes!", "type": "review", "business_id": "T9l9Z3FKMSCIYvsP2g4efw"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "Dj0qqO_39Db6OfmBGS24Eg", "review_id": "bN9CX52ozPztQuwXNXRxWw", "stars": 5, "date": "2010-09-17", "text": "OK.  It is not a 5-star place.  But I had to give the 5 stars in order to offset the ratings to date.  I went there because the Isthmus Annual Manual said it had great wood-oven pizzas.  I ordered their signature Benvenutos pizza (with ingredients similar to some chain places' \"supreme\") and tap water.\n\nThis was an extraordinary pizza.  The crust was explosive, the ingredients were pleasing  (I went to a boutique, Sicilian-personally-owned pizza place in Madison last week - - which I charitably did not rate on Yelp - -  where the otherwise-droolingly-pretty and well-assembled aggregations somehow tasted plain and  DULL - - you have to BUY good basic INGREDIENTS).\n\nThe truly odd thing about Benvenutos are the aesthetics.  It is situated on a desperate strip mall, with a hideous bland exterior, that makes you think it is some pretend restaurant, living on pretentions alone.  The pretentions continue as you go to the giant counter.  And then there is this quasi-industrial interior, with huge industrial ceiling-fanned ceilings, cute semi-Vegas-italian- buffet faux-italain scrawlings on the strange pompous facades, all amidst these massive spatial proportions that are wholly intimidating, and make you think you are either in some very, very SPECIAL hallowed unknown reclusive monastery purveying mama's most lustrous home-style concoctions (which you know isn't true), or you are in the most prepostrous strip-mall farce that has ever been created\n\nIt's a little of each, but amidst this aggregation of disparate elements, the proof is in the pizza, and the pizza is incredibly good.  A  billowing perfect crust - -  superb textures all around - -  ingredients with satisfying flavor - -  a PERFECTLY constructed pie (texture, flavor, appearance - - you name it).  Nice serrvice.\n\nI'm going back.", "type": "review", "business_id": "ybkWtM1ZnT2ewuquj3A9KQ"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "AEIKxjduqqu545E3T2lHog", "review_id": "hYBauP_FgkZ7fCfBkbG8JA", "stars": 2, "date": "2014-03-29", "text": "In other cities or other years, I could see the Barrymore getting a higher score from me. But in the last few years, other venues in Madison have really stepped up their game, and the Barrymore doesn't seem to care about keeping up with its contemporaries.\n\nIts use of social media is near-archaic. The venue doesn't make an effort to create or even update pages for individual events, and good luck if you get any indication that a show is on track to sell out. And perhaps it's just my personal taste, but the Barrymore used to bring in excellent music acts on a much more regular basis. Now it just caters to the aging-hippie population of the neighborhood, preferring to fill its schedule with predictable offerings about far-left-leaning politics. These events don't offend my own political views, but they're often dull and serve as nothing more than an echo chamber for people who want their beliefs perpetually reaffirmed. They sell more tickets that way, so I'm not sure I can blame them for the strategy, but  I hardly ever like the shows there. Also, the tickets are 2-3 times more expensive than the tickets usually are at other live entertainment venues in town.\n\nThe building itself isn't falling into disrepair, like the Orpheum is (heartbreakingly, I might add), but areas of infrastructure could certainly benefit from attention. There is no public WiFi, and you'll be hard-pressed to get cell phone reception, even in the balcony. I do appreciate that the open dance area is slanted a bit so that we vertically-challenged folks have a chance to see, but if you want to be able to sit and see the acts, the balcony is your best bet. It's not often open, however, especially for shows that haven't sold a ton of tickets. I don't recall this being a problem at prior events, but at the show I attended last night, there were constant problems with microphone feedback, often necessitating acrobatics by the band itself. The tap beer selection is good, but that's pretty standard in this town. Bottled beer selection pales in comparison to other venues, and the liquor and wine options are slim pickings. The bar is cash-only. The only ATM in the place charges a $4 fee for each use, so if you need to withdraw cash, make sure to get enough in one go. The line can be enormous, and often is bisected by people exiting and entering the theater. The bathrooms are fairly clean and well-stocked, although I've used them on more than one occasion to discover that they were out of soap, necessitating the use of their hand sanitizer instead.  Also, the saloon-style doors are an easy way to get smacked in the face entering and exiting the bathroom, so exercise plenty of caution around them. The bathrooms are so tiny that the lines are formed outside the doors. They also don't sell earplugs, so make sure you bring your own.\n\nBottom line: in the rare event that they have a show I want to see, I'll go, but I make sure to bring plenty of cash, my own earplugs, and my plastic Barrymore cups (drinks are 50 cents cheaper when you remember to bring your cups back).", "type": "review", "business_id": "f5ntGOT9_0pCdeUaUVi9cg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "48NxwczYWIGytgO-q93AdQ", "review_id": "F4xS3-J2OwHG0JLWug8hkw", "stars": 5, "date": "2014-03-14", "text": "Once in a while you run into a shop that really does things well and, when that happens to me, I like to give them a shout-out. Today it was Heel and Sole a shoe repair place on Sherman (in Madison). I thought I was going to be dropping off my leather coat to get the zipper replaced. Instead he asked a few questions and said, \"Let's try a smaller repair first.\" He took my coat to the back and two minutes later had repaired it. When I tried to pay him, he laughed and said, \"No. No charge. Go away, now.\" (In a very funny way -- not at all rude.) Day = made.", "type": "review", "business_id": "7DG41ejpSiTI-qDyBYFxwQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "zyF_MhJIUpwWUPUMtGNYLQ", "review_id": "beSlADjf57BjQcTcFUaXVA", "stars": 2, "date": "2013-02-12", "text": "Overall felt like the food lacked flavor. The jambalaya and gumbo seemed blah to both of us. The BBQ shrimp and cornbread were both good.", "type": "review", "business_id": "cpGv6ES2hzPCtCUQgipwXw"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "7bhvsfMKn34HVy3ozw5z8w", "review_id": "XTqaH_89SXKJ947-8uBVSg", "stars": 1, "date": "2009-02-27", "text": "Not even the hungriest, rabid infested pack of Chihuahuas would touch this food. All their food is canned process nonsense. It's like Mc Donalds on Mescaline. Now the freshly made tortillas are good, but that's it.", "type": "review", "business_id": "wPidHd5FxspPRgVqdEQ-Xw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CkbNxx6CAgLH_Wf_bh_s8A", "review_id": "vwzKpcCX5oxB7w8SWGiFqA", "stars": 2, "date": "2013-10-28", "text": "The only thing good about this place is Tuesday and Thursday is half price Margaritas... That and they have a chip, salsa, cheese and bean buffet with that.", "type": "review", "business_id": "wPidHd5FxspPRgVqdEQ-Xw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "jABgY8f7qt3COiaFUgxGpg", "review_id": "yhpHfiEWhtnlkpxO8kRrqw", "stars": 2, "date": "2014-07-07", "text": "Holy hell, what happened to this place?? This had been my go-to place for beans-and-rice Mexican in Madison for the better part of two decades, and I had converted my wife into a Pedro's fan. I'd had past or present Madison residents take issue with my insistence that Pedro's was a great casual dinner place, but I took that as part and parcel of Madison's legendary pretentiousness toward anything that's not \"edgy,\" such as old-school Americanized Mexican food.\n\nUnfortunately, it turns out any snobbery against Pedro's may be justified. My wife and I stopped in for the first time in 3 or 4 years and we were both sorely disappointed with our experience. The burrito is smaller than it used to be -- I suppose that's how they've been able to hold the line on prices so the size reduction is probably justified -- but my wife's fajitas were chewy, and both dishes lacked that \"kick\" that they used to have. Our quesadilla appetizer arrived luke-warm and was nearly rock-hard within minutes.\n\nThe premises haven't changed in the nearly 20 years I've been eating there and it's starting to show its age. Service was adequate, no more no less. which would be fine if everything else up to par.  In short, Pedro's lacks that extra spark that used to make it worth a special stop when visiting or passing through town. Not to mention the Mexican cuisine options have exploded in Madison in the last 20 years, so one would think Pedro's would need to step up their game rather than rest on their laurels. Looks like we'll be checking out the newer competitors on our next visit to Madison.", "type": "review", "business_id": "wPidHd5FxspPRgVqdEQ-Xw"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "719-h8u4BFgZHF2jORQxrA", "stars": 3, "date": "2014-01-15", "text": "Solid option.  I live on the east side and delivery is limited.  Chang Jiang is not the greatest place out there, but it is decent.  \n\nThey have online ordering or over the phone.  They deliver in blizzards and on Sundays.  They also regularly send out coupons.\n\nThey have a huge menu!  Their appetizers are lacking, there are only about 8 options which include the usual crab rangoon, egg rolls and soup.  \n\nI generally order their orange chicken or their General Tsao's chicken.  All of their meals come with fried rice (unless otherwise noted) or you can substitute.  I love my food VERY spicy and they always amp it up when I request that.  They make it exactly how I like it.  \n\nOverall flavors are decent.  They sauce can sometimes be overpowering to the point where you can not tell the different between veggies and meat in your container.  The portions are inconsistent.  They had switched containers for awhile and portions got smaller.  Then all of a sudden we are back to big containers!  It is not a big deal, I still got a ton of food.  \n\nBasically this is a typical/standard Chinese food place.", "type": "review", "business_id": "pSiRWeCqs7a1xvS9ycLoTQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "mGKySPBND1oIFCXw6-Sm5A", "review_id": "lfYy4DpRdlOrgwTwGPEe2g", "stars": 3, "date": "2008-08-21", "text": "Clean and neat with a friendly staff.  I have to agree with the other review that says the selection is pretty sparse though -- what shop like this DOESN'T have a shemale section?\n\nIf you're new to Madtown and think to look for ANY excitement (even self-inflicted) in the video booth section, you will be sorely disappointed.  The uber-friendly staff will ask you to leave.\n\nThis place would be better -- and I'm sure they would make more money -- if they got rid of the video booths completely and filled the place with a deeper variety of toys and quality smut.", "type": "review", "business_id": "oepqORGAqs3etUD9wwr1uQ"}
{"votes": {"funny": 2, "useful": 0, "cool": 0}, "user_id": "sKD6P31zw4b07jKrCeM2QQ", "review_id": "PMUFJZE4NAHJWXW6q2NqHA", "stars": 1, "date": "2012-05-05", "text": "My wife and I have been talking about checking this place out for years but since we live out of town it's not that easy to just stop in.\n\nFinally we have a chance to check it out last night.... and they're closed for inventory. Judging by the FedEx notices on the door, it's been closed for 3 days. No other info other than a note that says \"Sorry FedEx :(\" and a cardboard cutout of a scantily clad woman in the glass doorway that's meant to obscure your view of the inside.\n\nMaybe one of these days we'll see what it looks like on the inside... if it's not still closed for inventory.", "type": "review", "business_id": "oepqORGAqs3etUD9wwr1uQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UVp6EOBPEW63CIzejVNjWA", "review_id": "SfxjuS0ch72-qbNhV0d4Dw", "stars": 5, "date": "2014-05-03", "text": "Usually renting a car is pretty straightforward, but Fatima went out of her way here to make it a great experience. She was friendly, personable, and knowledgeable. She was able to accommodate my request for a specific car. The car was clean and drove great. Renting it and returning it were quick processes and I left happy.", "type": "review", "business_id": "R6ojvMJvskHGBbtednMQ1g"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "J4qPLSIxyWitXyq_WGXVlA", "review_id": "tK5hEsuqDsk-LZPS49AKCw", "stars": 4, "date": "2008-10-20", "text": "Due to the third annual Schizophrenia hardcore/gabber event, my friend Aaron and I found ourselves on the outskirts of Madison and in need of whiskey.  Luckily the warehouse we were destined for was by Slices' (Slice's/Slices).  Boy, oh boy, factory bars in Wisconsin pour stiff drinks!", "type": "review", "business_id": "MVFeOZVt641WBvdsRmnhPg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DoqaJVET-M4zqHN-m2MZvg", "review_id": "_etUpcPSDz5vNB7Fjo-Daw", "stars": 5, "date": "2012-03-15", "text": "Went in today for a quick brake adjustment and to fix a ripped tube and despite being VERY busy I was in and out in under 45 minutes. I've been going to this bike shop for 5 years and I only had one bad experience (with someone who appears to be no longer employed by the shop). Everyone who works here is incredibly helpful and they will never push you to buy any services or products that they don't think you need or that they don't think are good quality. They are super woman friendly, despite being staffed by mostly men, and offer their space on some nights for a women's bike mechanics class (that I've heard of and seen, but never gone to). They built my 3-speed bike from scratch when I first moved here, gave me an excellent price for it, and have helped me to keep it well-maintained. I have had only minor problems with the bike and I put it through a lot of hell. I recommend this shop not just for repairs, but especially for anyone looking to get a well-priced custom bike.", "type": "review", "business_id": "QMWdcByvCYCrs7-IQyr26w"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "tpwXQU2zhsXPz6CywnCrwA", "review_id": "8Ru004rjT8olqWddpv-SwQ", "stars": 5, "date": "2012-11-28", "text": "Busse's is very much a typical neighborhood tavern, with cheap drinks (cheapest in the city that I've found) and nice down to earth people.  Recent updates have been made as far as tv's, games, sound system, etc., so if you haven't been in a while to catch a game or hear some music (the old juke box was circa 1970's) you might give it another shot.  \n\nIf you are into \"bomb\" shots the Chuck Norris shot is something you need to try.  If you like tap beer the selection is limited, but very inexpensive, and the lines are always clean (hint: the owner drinks tap beer).  Cocktails are stiff, and REALLY inexpensive.  \n\nIf you're a northsider looking for a new local hangout, or someone heading to a Mallard's game looking for a spot near Warner to hit up before or after the game (they always have Mallard gameday specials) this is the place.", "type": "review", "business_id": "hUS4D74YDHobcggC4-YMqw"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "4bsu8DLfDkBV84RKn6UmcA", "review_id": "eLo0yE9PhxIoGenVhTLsOw", "stars": 2, "date": "2011-11-21", "text": "This time around wasn't so great. The interior of my car was wiped with dirty rags, and my car smelled like dirty rags until I got home and was able to wipe down the interior myself. They also didn't do quite so well on drying the car off - although I should have probably said something to the guys about doing a better job. Nevertheless, a very disappointing experience, after such positive one just a few months back.", "type": "review", "business_id": "MFANntSgzNkjStqgB2xtHw"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "uSlKnryLlnD3mvmG6DIyCg", "review_id": "0sSaYsamhQr6waqmD4ebog", "stars": 4, "date": "2008-06-23", "text": "The Bridges has become my default golf course for meeting up with friends and getting in 18.  It is a city-owned course on the northeast side of Madison, south of the airport.  Most of the course is situated amidst low-lying wetlands, while on the back nine a couple of holes rise up on a ridge along Anderson Avenue.  It is an fairly easy course to walk, except that the proximity to water does mean a good amount of mosquitoes.  The recent rains led to a lot of flooding on the course, but I played last weekend and much of the course is back in playable condition.  I especially like the Bridges since the course can either reward you or punish you, but there always seems to be a bit of both.  Other courses are either too hard or too easy (mostly too hard) but the Bridges is the kind of course where after being embarrassed on a deceptively difficult par three you find yourself in position to birdie a par four that initially looked impossible.  It's enough of a challenge to keep you coming back without demoralizing you, and this makes it about the most fun of the courses in the area. \n\nThe major downside to the Bridges is the proximity to the airport.  Most of the course is right on the flight path for landing jets, and this is distracting at first.  Once you've played a round or two you learn to time your drives or putts, and Dane County Regional isn't exactly O'Hare.  Another potential problem is that this course can and will eat a lot of balls if like me you tend toward inaccuracy.  The vegetation in the O.B. areas is thick reedy wetland stuff, so just go ahead and consider that ball lost.  Lastly, the course can get very crowded and play tends to slow.  However, since I prefer to walk this usually works in my favor.  For some these drawbacks are a deal-breaker, but given the crowds on any given weekend I have to assume that this is a minority opinion.\n\nThe price is very reasonable - from $22 to $37 walking 18 depending on the time.  There is a twilight special where after 6:00 PM you can golf as much as you would like for $10.  The only problem with this is that a lot of people get in line for this and the rate of play is pretty slow.  The bar and grill in the clubhouse is one of my favorites of the city-owned courses.  The bar is well stocked and they usually have a couple of decent taps.  The last time I was there I enjoyed the new Capital Prairie Gold from a frosty mug.  You can always count on getting a can of Capital out on the course as well.  The menu is surprisingly broad and well-made.  The wraps are a satisfying end to the round, as are the sandwiches and the appetizers.  You can call in an order as you make the turn and it will be ready at the clubhouse, which is perfect for when only one or two of the foursome are eating.  Several of my friends have attended banquets or luncheons held here and have said these are well done too.  I think that top to bottom, the Bridges has about the best layout of the city-owned courses and is my personal favorite.", "type": "review", "business_id": "wls7FRMgIn8VlK1ji5Ms5g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6hYwb0nsqbUIq9d-MGzY6Q", "review_id": "0RTZNYghtA8GHD4jJoK3EQ", "stars": 2, "date": "2014-04-18", "text": "I broke down and was craving McDonald's and wanted to check out the newly built one. Ordered the new bacon clubhouse burger. It was tasty but on the cooler side of hot. Once again though fries as bad as you can get. Cold, dried out and down right uneatable. I do like that they have coke zero even as it wasn't mixed properly. \nService, what service. No warm welcome or even a smile and it was a manager who was besides himself for having to leave his set position to help me the only customer at noon in line. \nDining room looks great new. Dirty as all hell. Looked to sit at 3 high tables and all the seats had greasy soda spots all over them. \nHow hard is it to manage a place like this. I've done it quiet successfully for many years. \nAnd yes someone can contact me if they'd like.", "type": "review", "business_id": "311yXufoXR2dFngMHS9MFg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-ZSPer3Fb79GxWLUIq7Dfw", "review_id": "UFG4pr4bfiKxzpVBmMX1cA", "stars": 3, "date": "2013-03-26", "text": "I've had a hard time finding a good cleaner in Madison. Block has been around forever. The storefront is unassuming. Staff is always helpful. Prices, average. However, they do an, ok job. I'm a little disappointed because I specifically asked them to get some salt out of my husband's pants and they didn't do a very good job, however other items I've taken to them have been fine.", "type": "review", "business_id": "01gRLh9-kr_ZYABrGwNxpg"}
{"votes": {"funny": 2, "useful": 0, "cool": 2}, "user_id": "ioXKyCf3iJBbYqpPlLbj4w", "review_id": "P-JEVPbZqSDVwmRBMQuoVg", "stars": 4, "date": "2013-11-18", "text": "I don't live quiiiiite close enough for this to be MY neighborhood bar, but it meets all the requirements: laid-back atmosphere, great food, and seriouslygreatcraftbeerlist. Their beers are all of the cant-pick-up-at-the-gas-station variety and it's worth coming by just for that--the menu diversity is the cherry on top of my craft beer float.", "type": "review", "business_id": "HTplzElel_F_U_qhWuDKdg"}
{"votes": {"funny": 0, "useful": 6, "cool": 5}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "JYDyMx59ZQr9zG8-_Xt9GQ", "stars": 4, "date": "2013-12-07", "text": "After going to the Yelp event, I could not wait to go back!  We went for Wednesday night fish fry.  This is not a year round occurrence from my understanding.  More like, a fall occurrence.  I was with 5 other people.  Four ordered the fish fry.  There were three fish options.  The most expensive was $14 and was a huge amount of food.  One of my friends ordered the fish baked and it looked amazing.  \n\nI tried the Italian Beef.  While, it is not a Chicago style sandwich, it did not disappoint.  It was the closest I have found to Chicago-style.  It would almost be there, except for the bread.\n\nMy only complaint?  Adding your side to the price of the sandwich. \n\nOtherwise, the owner is friendly, the staff is friendly.  The beer menu is ridiculously long.  Go to Dexter's, it will not disappoint.", "type": "review", "business_id": "HTplzElel_F_U_qhWuDKdg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j9Qxg1YKx9uJXoSYTMgDAg", "review_id": "a4H3U9s2Ad8oF6adSVgnIg", "stars": 2, "date": "2009-09-26", "text": "Location of the place is perfect, right at about the top with the Mall below, and East Washington running across - very city like and nice views. \n\nThe service was eh - same as any other you can expect. The inside was gorgeous- the lobby , amazing. The pool, ok. The hallways, nice. The rooms... ehh not too sure - wasn't what I had expected. Paid a very high price when could have stayed at Hilton for same amount.  Wasn't what my fiance and I had expected. Don't let the looks of The Crowne Plaza attract you in.", "type": "review", "business_id": "Hh5lyZtOrS5LKk4YCgj8Kw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vJEGCJa9Xid6WHOAR7_wYg", "review_id": "Xe_Ax0K6n2Brg_3_KPeESQ", "stars": 5, "date": "2012-06-15", "text": "I absolutely love this salon! I just moved to the area and my friend referred me here. I have very long hair and am super picky about my stylist and how my hair is cut. I made an appointment with Amy and from start to finish it was a wonderful experience. When I walked in the door I was greeted and asked if id like a beverage. I only had to wait a minute or two before being seen. I was given a great head massage while getting my shampoo and was asked again if id like something to drink while i waited under the dryer. Amy knew just how to cut my hair and even gave me some easy styling tips. I will definitely be referring this place and coming again!", "type": "review", "business_id": "iGMkJINjPT0izqEZCFuC3A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "U3VhUw4XlAkkp9ouvDQHwQ", "review_id": "ffx014nLl46Q94v50Wt3DA", "stars": 4, "date": "2013-01-15", "text": "I stayed here on a business trip. The place is old but still ok for a comfort inn. The first room I was given wasn't very good and it had terrible wifi signal. I was getting one NA and it kept dropping out. After talking to comfort inn IT department (who were very professional and helpful), I learned that I was too far away from the wifi access point and suggested that I changed rooms. The staff was very accommodating and gave me a different room with a huge jacuzzi in the living room. It was pretty cool and more updated than my previous room... However, the wifi was still terrible. \n\nOverall, the staff is nice and accommodating, the rooms are old but still decent, but the wifi is horrible (almost non existent).", "type": "review", "business_id": "jd7yAsF-T4OlI4ejkJYJrQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wPx-v7yf4AX1VjpeOWLq4Q", "review_id": "RpmWbADxOAXaFmO_hwIFvQ", "stars": 4, "date": "2011-01-22", "text": "Really?!  No one has reviewed this place yet?\n\nJenifer Street is the go-between market for those of us who don't necessarily want to shop at Woodman's but also don't want to spend a lump of cash at the Co-Op.  The selections here are good, the meats aren't bad (though they have far fewer local selections than they should), and the beer corner is just awesome.  Seriously, the beer corner is the best part of this store.  They even provide jackets for people to wear.  If that doesn't get you here, nothing will.\n\nThe produce is a mix of local and not, but it's a good mix.  I go here for pretty much everything when I don't want to drive too far for something.  The Co-Op is great, but it just charges FAR too much for a lot of things.  That is what drove me to Jenifer Street in the first place, and I've never looked back.  Sure, I still hit the Co-Op up for some things, but they're the things I know I can only get there.\n\nAnyway, this store is great and it's a neighborhood fixture.  It's cash only, but there is an ATM at the front door and when you get money out of it, you get a $1 coupon for shopping at the store.  That gives you the $1 back that the ATM took from you to get the cash.  VERY nice touch!!\n\nOverall, this is THE place I go to when I want to hit up a non-major outlet on the near Eastside.  Willy St. is good too, but know that there's a fiscally savvy option just down the road.", "type": "review", "business_id": "MLD-FXAHLbdiHOcyeoW-Fg"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "3uYepzke7XOWu7M2smM79Q", "stars": 4, "date": "2013-03-23", "text": "Even though the place is tiny, I'm a huge fan of it. You'll be hard-pressed to find better quality produce or meat in the area, and their beer cooler is one of the best in terms of variety and options.\n\nService has always been friendly and helpful; their butcher shop is fantastic - I needed a bone-in pork shoulder and when I inquired about one, the butcher said, \"I can cut one as big or as small as you'd like - it takes about a minute.\" I was looking for something in the 9-lb range, and within 30-seconds, I had a 9.12-pound pork shoulder. Price was more than fair at $2.49/lb.\n\nWhat a great neighborhood market. If you're looking for big box items or need to choose from six dozen different types of bottled water when you shop, you might want to head elsewhere. If high quality and fresh food is what you're after, look no further. \n\nYes, it's cash only. They have an ATM that offers you a rebate on your grocery purchase to help offset the transaction fees. \n\nOh, and be sure to check out the cheese selection! Yum!", "type": "review", "business_id": "MLD-FXAHLbdiHOcyeoW-Fg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6kp815UUjK--ukUjmDlSCQ", "review_id": "GrghxcPABkCC7gxdb1okhg", "stars": 4, "date": "2008-12-27", "text": "This place is huge, and that is good because it can get packed pretty quickly on the weekends. This is especially true when the weather outside forces us to look for indoor activities. \n\nUnlike the previous poster, I initially had a hard time figuring out the computer seated at the table. I kept jamming my fat little fingers onto the screen expecting a touch screen response. Fortunately the other bowlers in my party realized that my genius was showing and helped me figure it out. Durrrrrr. \n\nThe bowling was fun, even though I probably should have had the bumpers on like the minors in our group did. At least then I would have not looked liked the biggest dork in three counties, just a weeny. \n\nWe ordered deep fried cheese curds, and deep fried macaroni for snacking. No healthy eating here!!! They were yummy, and just as good as Culver's. But since I've said that, now I'll have to hide from rabid Culver's fans. Yikes! \n\nWe'll go here again, and I can once again provide comic relief with my mad bowling skillz. \n\nWerd.", "type": "review", "business_id": "bAew9nt-tw8YGjjD64gVWQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2_OIo9KHuot8U6HuQ3U8Rw", "review_id": "GJec9EJ-9xfm244I7_sk_g", "stars": 5, "date": "2013-09-14", "text": "This place is cute, very comfortable inside and the staff is really nice :)\n\nI got a breakfast sandwich and a white chocolate mocha both were so delicious!! skip the starbucks and head over here, I would highly recommend this place!", "type": "review", "business_id": "JPFzpR5PvZWqHXQMIZFk2w"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "_xf2ECTRftPV4bzK4mGYEg", "review_id": "SIcc0AvxJt6NjQ_TlTlbCw", "stars": 2, "date": "2008-07-09", "text": "Monty's used to be one of my favorite places on the near-east side.   I've long loved their Meatloaf of the Gods, fat and calories be damned.  However, our last 5-6 experiences have been exercises in frustration, with such charming features as a $100 overcharge on my debit card for a $23 meal.  (yes, you read that right).  Yes, the server was new, yes they corrected it, but still.\n\nWe ate there again last night- I'm a firm believer in the power of the 19th chance-, only to leave with a renewed resolve that there are many better options available.", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "g4NW219ed4H-JIsFIreR0A", "review_id": "9MUh568rGHqXBLUm2QFo5g", "stars": 5, "date": "2009-05-08", "text": "Can't do animals, can't do dairy, yet am a food warrior. Indeed, Madison abounds with options for a gal like me, but Monty's marks my favorite eatery in the city. Intentionally old-school in its decor and prices, it's a throwback that appeals to anyone with a frontal cortex. \nMy waitress brought me a gratis cup of the home-made veg soup as I was sitting at the end of the counter an she hadn't seen me for a few minutes (aaaaand the tip started to go up).  I had the meatless meatloaf thing also mentioned here, and good LORD the portion size was outta control. The roll was the size of a Yorkshire pudding and the mashed potatoes were actually made of potato, fancy that. The meatless loaf itself was solidly good (shredded root veg with a cheesy binder - wish I had known that prior to ordering, but should've asked) but a bit oily and the cashew gravy was goooood. So many great-looking options for veg-heads like myself, hallelujah a-MEN, and they even have a small wine list and beer. \nI couldn't get through the entire pile of food, despite being a hormonal food warrior that day, yet I craved a sweet and Monty's has soy ice cream. WTF, OTHER DINERS? I nearly wept at this one. I had the mint chip, 2 scoops, which again were more like two grapefruit spilling over the sides of the bowl. That, I could do. \nMy total bill came to $8. EIGHT. I added a 50% tip and blew Monty's a kiss as I left; I shall RETURN! Waitress was a sweetie, the staff all seemed to be pretty happy, and the place was approaching fullness when I left. \nMy fondness for Monty's justifies the caps.", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "_cOXx98-ZiOgxjib-ZdYGA", "review_id": "vfDMZK5LzOPqrkPJx4SBJg", "stars": 4, "date": "2009-07-07", "text": "After seeing old friends at the last Latin Night at The Cardinal (http://www.yelp.com/biz/cardinal-bar-madison#hrid:KfYiEWXAc-SlP_qEiUO6Hw) we agreed to meet here for breakfast on Monday morning.\n\nWell, not all of us made it but good times were had while eating.  This is the closest to a 'real' diner that Madison has that I've been to but they have some truly kick ass pieces of fat French Toast.\n\nI had bacon & eggs, french toast w/ coffe & cream and my daughter had the Blue Plate Omelette w/ home fries and orange juice.\n\nGood place to come with a group of old friends or your kids (if they know how to act right in public...)", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uhsQFs68oZHrKVMPinwfrQ", "review_id": "4aPIHg7fUA4mOgxSmJExPA", "stars": 4, "date": "2010-02-17", "text": "I love Monty's. The atmosphere is kitschy and cool, and they have something for everyone (even the vegetarians and picky eaters).\n\nThe wait can be a little on the excessive side, so don't hold off until you're hungry. \n\nI never manage to save room for dessert, but I hear the pies are excellent.", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_El9O8sv3NRPgrKKr1fIRQ", "review_id": "YKRPkpvoZLBvrSuP_0U1oQ", "stars": 5, "date": "2010-11-10", "text": "Yum! Monty's was absolutely adorable. After eating dinner there I can say with certainty this will become one of my new regulars. Right when I walked in I knew it would be a place I would enjoy. The atmosphere was that of an older, trendy diner and had a quick moving, upbeat, friendly staff making the atmosphere even more enjoyable. My friend got the artichoke sandwich, delicious, and I got the chicken in a pie, right from grandma's kitchen. Afterwards we ordered a red velvet cupcake which was to die for, and all for under $15. We shared great conversation and didn't feel at all rushed, our waitress was great. She made recommendations and shared jokes with us, not seeming to put up a front at all. I will be going back sooner rather than later.", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NN21fMW85Mj-_F-RrSawnw", "review_id": "vrg5zhbZ32COyUS_p-OJOA", "stars": 3, "date": "2011-07-19", "text": "I've been coming here since I was in middle school and it was the cool place to hang out on half-days. 6 orders of waffle fries, anyone?\n\nWe went last night for an early dinner and squeezed 7 people into a booth. I got blueberry pancakes (LOVE breakfast all day) and they were okay.  My friend's french toast came with apple butter though, and slathered on top of the pancakes = much better pancakes.  Around the table there were also a few types of burgers, a meatloaf sandwich, a fruit plate, and a whole lot of milkshakes and sundaes. Big let down: they were out  of over half of the mix-ins for the milkshakes/sundaes. You can't have a dirt cup without gummy worms!\n\nOverall, I've always liked it here. Service can be hit or miss. Food is pretty good. Milkshakes are hurt-your-teeth sweet.", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "xSI7zNvo6UBrcdmRO4fAWg", "review_id": "g_YFVnPD8sCQlrKTYCfFog", "stars": 5, "date": "2012-01-04", "text": "A late night dessert run with my pregnant bestie led to a Monty's revelation:\nThey now serve (organic, classy) Sassy Cow ice cream, have even nicer and more delectable cheesecakes and their brownie sundae puts the Ella's Sparkled Kazoo to shame. \n\nPost-brownie sundae, bestie's baby to-be kicked. \n\nI think it was the hot fudge.", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 2, "useful": 2, "cool": 3}, "user_id": "SFsmpHle0R2BBe2oTz3vJw", "review_id": "Nk-Xk5WiEDT_MPDoCGDtJA", "stars": 4, "date": "2012-09-02", "text": "Monty's Blue Plate and the Holy Grail of Corned Beef Hash. \n\nIf I were to write nothing else, I think the previous sentence sums up my new found appreciation for the place. \n\n\"Your mother was a hamster, and your father smelled of elderberries\" will never be uttered to an employee of Monty's. \n\nThe service was great, my coffee cup stayed full the entire meal, and the food was 'da bomb.' \n\nI'm eyeballing the Chorizo for my next visit, which will be sooner rather than later.", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "J-th6DPQi15QvsNxDj8AnA", "review_id": "MdLsZStyiZ0wu4twnxeBMw", "stars": 5, "date": "2012-12-16", "text": "Maybe I'm jumping the gun with a 5 star review... oh well, life's short.  I tried this place for the first time the other week when my grandparents were visiting me in Madison.  It was just wonderful!\n\nThe decor is adorable, the servers were friendly and prompt, and the food was fabulous.  I went with the Heathen Vegan Sandwich, which is piled high with mushrooms, tempeh, and avocado.  For my side, I chose the bean salad.  Both of these items were delicious.  The sandwich was HUGE.  I could not eat it like a regular sandwich, so I ate it in an open-faced sort of way with a fork.  A little messy, but totally worth it.  The mushrooms and tempeh were perfectly seasoned and tender and the avocado brought it all together with the toasted bread.\n\nI got a bit nervous because at the *very last second* my grandma changed her order to the exact same thing I got (she's not vegan) because she \"trusts me\".  I was pretty nervous, but she ended up loving it!  I was so pleased.  My one complaint might be that my bean salad had a bit too much dressing on it, but my grandma's did not share that problem and it wasn't difficult to just eat it with a fork instead of a spoon.\n\nMy grandpa ordered some sort of breakfast platter and was very pleased.  He basically always orders the same thing at diners - two poached eggs, bacon, potatoes, and toast, so if he is impressed I feel that it is a good sign. He said the eggs were cooked perfectly.\n\nThey seem extremely accommodating for allergies and preferences as well, which is always a huge plus.\n\nOverall, I was very happy with my first visit to Monty's.   Not only because I loved my vegan options, but because you made my grandparents very happy too and that rocks in my book.  I will definitely be back!", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "sd4kstHD9zl4UIG47mSUCw", "review_id": "-4o4ouT3x-TsetUKAFLNAg", "stars": 2, "date": "2013-05-19", "text": "I'm sad to say that after a really great first experience over one year ago, Friday night's dinner at Monty's was very disappointing and I probably won't come back any time soon.  The host at the counter was not friendly.  My sandwich came on bread that was literally hard as a rock and then my husband was done eating before I even started my dinner because I sent it back and waited for new bread. The bread the second time around was greasy and the sandwich itself was dripping in grease.  GROSS.  My husband ordered the fish fry and they forgot part of his order.  It was just a bad day for Monty's....I might be back for dessert someday.", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "V8509oy7QEAoD194zqugDA", "review_id": "4IyTX02cevDRDz5-xslGmg", "stars": 5, "date": "2014-03-11", "text": "Nice atmosphere and fantastic food!  And I love their gluten free options.  They made things as we ordered them and the service was prompt and friendly.  This is a really nice \"diner\" with nice decor and a very friendly atmosphere.  The line was very long on Sunday morning but that's the sign of anything good because everyone wanted to eat there.  Nom nom, we'll be back! :)", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XE12RCW8Za7yKk_9KKFZdg", "review_id": "yelbss7_2v7wVbN4pEtAWA", "stars": 4, "date": "2014-04-12", "text": "Great brunch, good service. \n\nDinner is fancier diner food that might be a little overpriced for what it is.", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "tWQm3X0Dfkwo2BJP7puepA", "review_id": "ZHm6Z0_zJ8kLgDBcXzKGpw", "stars": 3, "date": "2013-09-20", "text": "Slightly lower than average Hampton Inn.  Heat/AC wasn't updated, pretty typical besides that.", "type": "review", "business_id": "HYFwjbK7HbvzENF44ACfdA"}
{"votes": {"funny": 3, "useful": 0, "cool": 0}, "user_id": "pOmhEB7tBWhYofKPixLfNw", "review_id": "uH79FIy8H-040R3r1PvQQQ", "stars": 1, "date": "2011-07-07", "text": "This place SUCKS!  Every time I go in here it depresses the shit out of me.  People say it's haunted and I would agree - haunted by degenerates and meth heads.  I always say I'll never go back but that never happens...", "type": "review", "business_id": "TLjnOhDnazyPJmI8LqU5-g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "NIsTeRxjweEAYghV3QTXhA", "stars": 2, "date": "2014-05-06", "text": "I really dislike Menard's.  For every positive interaction I have, I have two negatives ones.  My husband and I just bought a house, so you can imagine how much time we spend here.  I prefer Home Depot but the prices are so much lower at Menard's.\n\nIn the matter of two weeks, all of this happened:\n\n1. I bought a can of paint for our guest room.  I wanted the best paint, with the primer, all the bells and whistles.  I was covering purple.  I needed it.  The salesperson said I could pick from any four.  Yet, he could not tell me why one was rated higher or called premium over the other.  It was weird.  Like here are your options but I can not tell you what their difference really is.  And some were the same brand.\n\n2. When painting the ceiling of said room, we open up a can of paint and notice it has clumps in it.  This paint was about six months old.  Nothing happened to it.  So we go back to Menard's.  We have shopped at several area Menard's, because we are about convenience.  The lady at the counter was SO rude.  We did not have our receipt and could not find it in their system.  We pay for most things in cash and apparently this is NOT a good idea at Menard's.  It had a Menard's sticker which this location does not use (but other locations still use).  \n\nEVERY time we tried to talk to someone she kept speaking over us and saying this can not be from here.  We then had to repeat AGAIN, that we do not just shop at this location.  We shop outside the city sometimes.  We pick things up on our way home.  \n\nAnother rep interceded and offered to return it for us.  She was SO nice.  I wish I remembered all of their names.  But she needed a person from paint to approve it.\n\nBefore looking at the paint, a rep spoke to this RUDE customer service rep and said he could not take the paint back.  It must be our fault and that is that.  Then they said they could not take and dispose of it.  Nice huh?  No one asked us anything.  The paint was BRAND new!  \n\n3. The same day we went to return the paint, we wanted to look at screen doors.  There was no one in the section and you would have thought we were pulling teeth when we did find someone.  He was SO short with us and kept walking away while we still had questions.  It was ridiculous.  \n\nSo the prices keep us going back but the rest?  Awful/Hellish.", "type": "review", "business_id": "IoPdC59QwkWYm31xPkwcPw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "6UfRC8Sw8z7EcYPIWtl1ig", "review_id": "mbImQcLpIO966hTsDxx_Ig", "stars": 4, "date": "2010-12-04", "text": "good food and very cheap.", "type": "review", "business_id": "Ryq600aoE3h8_qRQGIed9A"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "B_UefrVB5Xw2X1WRZPRkbw", "review_id": "DOrdwtt93Au4VBoPRrKxzQ", "stars": 4, "date": "2013-10-24", "text": "Living 1 block away is dangerous! This is a hidden treasure for sure. The owners are a sweet older couple who knock out some amazing food. Can't speak for the donuts but I promise you will enjoy the food. The falafel with fries is a bargain--5 bucks or so--and it will be made totally fresh for you. My go to I don't feel like cooking spot.", "type": "review", "business_id": "Ryq600aoE3h8_qRQGIed9A"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "DHdnD1G3qAkXqKFXqOizow", "review_id": "Qk0l9c_bbooayW522uVp_w", "stars": 5, "date": "2014-02-01", "text": "Decent cover charge, $8. Spacious. VERY good House music. No creepers. \n\nMy girlfriend and I visited last night and we had a BLAST. Non-stop dancing for 2-hours because the music that THAT good and engaging; I had to force myself to take a break. I love to dance and to have a good time. We were both able to do this without being bothered by anyone and with enough space to do to so. \n\nWe did not have drinks, so I can't offer any opinions on that. \n\nAfter a 4 hour drive from Chicago, on the same day, this was a GREAT place to end up on a whim. \n\nIf you seek a clean good time with good music and lots of dancing, then the Inferno is the place to be. It was cozy. \n\nNB: No coat check, but it was not crowded so placing our coats on the seats and keeping an eye from the dance floor was not an issue. \n\nHappy dancing YAW!", "type": "review", "business_id": "XTGb5b3LBuhWHhJS1xPnQQ"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "xSI7zNvo6UBrcdmRO4fAWg", "review_id": "ANsy_EtaGxxyDSYnMTeJvw", "stars": 4, "date": "2009-09-29", "text": "Wedding weekend: manis/pedis, chair massage, brows. Ya know.\n\nSerenity Salon on Madison's northeast side knows them all and does them well. Darcy's staff truly knows how to pamper and pulled out all the stops with our bridal party. The \"Spa Day\" package included 3 treatments for $45(!) plus time and space to chill out in the warm, beautiful space. As a non-Spa type of girl and habitual nail-biter, my fingernails have never looked so stunning or my shoulders and back more relaxed.\n\nWe loved them so much that we came back bright and early Saturday morning for our bridesmaid up-dos. Though my 'do required more than a few bobby pins, it stayed in place as we danced long into the evening.", "type": "review", "business_id": "rut_67Vzg88Ge8p4flQKjQ"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "T8b7wARakqSGC2TQhFMW-A", "review_id": "fgppJWYkzSBD-Kcg5dlRBg", "stars": 5, "date": "2014-06-07", "text": "Highlights/lowlights\n\n1) friendly staff\n2) fun thing to do on a nice summer night\n3) gluten free food options available\n\nI think it's really important to head in to your first (or any) mallards game with the right mind set. This isn't MLB! If you want that that head to a Brewers game in Milwaukee (NOT a Cubs game at Wrigley :p). \n\nAs this is not MLB, the stadium is smaller and really easy to navigate through. I would imagine this would be really good for families looking for a night out. There is a decent sized kids area near the entrance as well. \n\nFor a smaller stadium there is a really impressive amount of food and drink options. There are over 17 different beers available plus people selling Seagrams escape drinks (supposedly gluten free!), lime-a-Ritas etc. I was expecting pretty limited options for food as this is a smaller stadium but they really have everything you can get at an MLB game. Brats, burgers, chicken sandwiches, even cheese curds! There are even gluten free hamburger AND brat buns. Basically a food coma waiting to happen for anyone with celiac disease/gluten intolerance. The staff at all the food and drink stands was really friendly and quick!\n\nWisco fans everywhere are pretty chill but even more so here! Everyone is just here to have a good time and nobody gets really competitive about the game.\n\nWith plenty of food and drink options and great fans, a Mallards game is a great choice for a night out on a nice night!", "type": "review", "business_id": "4N7dN61pyPfcxmKgXWQPfw"}
{"votes": {"funny": 2, "useful": 0, "cool": 2}, "user_id": "WY8HpnccFSkrKJE10wKQ-g", "review_id": "ajPXdyltoNHlHnrz6h4cTw", "stars": 5, "date": "2010-04-05", "text": "This is it - the cream of the crop.  \n\nI've lived in the Madison area for the past two years, have visited many of the local Indian buffets, and have found none that equal the Maharaja standard.   Buffet dishes change on a daily basis, but you can always count on their show-stopping chicken tikka masala to be in the mix.  In addition to the standard meat curries and tandoori chicken, they always offer multiple vegetarian dishes and an array of appetizers.  \n\nRecommendations:  coconut soup, vegetable korma, malai kofta, baingan bhartha, chicken tikka masala, mango ice cream\n\nThe staff is wonderful and always keeps plates of naan a plenty :)\n\nMaharaja is by far one of Madison's best restaurants.  And, you can't beat their lunch buffet deal (under $10).   But diners beware, it is incredibly easy to overeat at this place...forcing one into an almost immediate food coma upon settling the check.", "type": "review", "business_id": "jqo3Ljexof9sA8PhSTwEjA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "MHS-pQ5QxKI5N5_Z54zvhw", "review_id": "xeiLzSzdZMx4n83VVDDXKA", "stars": 4, "date": "2011-10-30", "text": "We did takeout and we ended up with large portions of excellent chicken tikka masala, garlic naan and veggie pakora and they gave us free chai for the road!", "type": "review", "business_id": "jqo3Ljexof9sA8PhSTwEjA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AlkwJyam3fAQ-xRkbQdT4w", "review_id": "FS_QaORswyE5tlztHnjmsQ", "stars": 4, "date": "2012-10-16", "text": "Excellent, excellent! Very impressed with their assorted curry dishes. Highly recommend. Don't expect fancy atmosphere. The staff moves at their own pace but that doesn't matter when the food is soooo good.", "type": "review", "business_id": "jqo3Ljexof9sA8PhSTwEjA"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "wjY2kntD9UHozywG0JWDsA", "review_id": "9YiE2aRlXkhYjDXbzC5lKA", "stars": 5, "date": "2013-08-16", "text": "Authentic Indian in Madison, Wisconsin.  Score!", "type": "review", "business_id": "jqo3Ljexof9sA8PhSTwEjA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "p4ySEi8PEli0auZGBsy6gA", "review_id": "-AQNaItfJ6UQ3JBeqcYJSA", "stars": 3, "date": "2010-06-05", "text": "The food is still tasty but business seems slower lately than prior years. Still retains a great interior. I've never really checked out the bar.", "type": "review", "business_id": "eC4iEcRR3p5NLq9Zf80ZGg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kAwDHmbEbOgWUsgnx3UGMw", "review_id": "X5zR-lKRsXzxFiASrR-juw", "stars": 1, "date": "2014-07-01", "text": "Not sure why this place has so many good reviews as the food is not Chinese! I'm a Chinese girl myself and I know how Chinese food should taste like. And this place does not have the authentic Chinese taste, in fact, it is a mixture of American, Thai and Chinese altogether which makes me disappointed. However, what makes me even more disappointed was when I ordered beef lo mein, The waiter was too busy chitchatting with guests and put in pork lo mein instead. When I called him back (it was a takeout order) he was saying it was his mistake and will credit that for my future order and refused to replace it! I was like, really? Definitely will not come back and  not recommend this place to friends and family!", "type": "review", "business_id": "eC4iEcRR3p5NLq9Zf80ZGg"}
{"votes": {"funny": 6, "useful": 2, "cool": 0}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "rIPxJM1DmQVvbc-6qUNCVg", "stars": 1, "date": "2010-02-12", "text": "I fully appreciate that Mr. Roberts is a blue collar dive bar that's located on Atwood. So when a friend asked me to join him to watch a favorite band there, I set my expectations accordingly.\n\nIs it possible for an establishment to disappoint you when you've already lowered your expectations to crackhouse-lows? Only if that establishment is Mr. Roberts.\n\nThe tap beers are not only unexciting, they're as stale and flat as day old bread that's been run over by a steamroller.  Bartenders are more interested in talking with their buddies than they are helping anyone. And the whole vibe of this place is more sketchy than an Etch-A-Sketch wearing Sketchers... \n\nI'd give anything to not be stuck here right now. I'm scared to death of what might be lurking in the bathrooms... Think I'll go pee in the parking lot.", "type": "review", "business_id": "-4PHmmCt_RmAfaE3sDKW_g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "B1dI-c5xBAobfM_ZzG_wUw", "review_id": "rMvjypBsbBLwJOrnNJ49-A", "stars": 4, "date": "2011-09-27", "text": "From the moment we pulled up the line guys were exceptionally friendly and were very attentive to our needs. The facilities were being cleaned during our stop over but they were more than accommodating. The pilot lounge was very comfortable with a sleep room and several recliners and full Dish Network.\n\nThey had a couple of crew cars, dodge stratus i think, the one we got smelled a little bit like smoke but who the hell cares?\n\nReasonable fuel prices and cute desk girls make this a complete FBO experience.", "type": "review", "business_id": "AyAJs-XGv2_Cn_LPH1DWyg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pKFvfyVSAvv-jsoQf_Hjog", "review_id": "wID8E0Ypt1jwMqnYtPWdTw", "stars": 5, "date": "2014-01-11", "text": "I have been a member of this gym on and off for the last several years.  My only complaint is that they only have one location.  No frills, no 'health club' feel and nobody bothering you about anything.  There is more than enough machines, racks, etc to be able to get a great workout in.  Waiting for equipment is rare.  Show up, get strong, leave, repeat.", "type": "review", "business_id": "LkFYWBEdmHE05UkfIkK4EA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bUrgwAqmdxx02ZTneV1OWg", "review_id": "FvS3lM0RaNRPkH5rc-LM7w", "stars": 5, "date": "2014-02-09", "text": "Best gym I ever worked out in. Period. I would've renewed my membership in a heartbeat had I not moved out of state this past Summer.\n\nThe best part about the place is the atmosphere. No TVs, no frills, brick walls. People are there to improve their bodies and health and most are serious and focused, but the people I've interacted with have been real down-to-earth and friendly. And it's not just for powerlifters and bodybuilders. I've seen all types (genders, ages, body types, fitness levels), there. However, I have to say that seeing a guy bench 500 or deadlift 14 plates definitely makes you want to put 100% into your own workouts.", "type": "review", "business_id": "LkFYWBEdmHE05UkfIkK4EA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "O0lAQazaL-veJv8FCux37Q", "review_id": "8nbFWgAv3yRndH0sQiMkHA", "stars": 5, "date": "2010-09-09", "text": "Oh how I miss you, Harmony Bar!  I never miss a chance to grab a walnut burger and hot chips when I'm back in town.  \n\nThis is just a wonderful neighborhood bar.  The food is still \"bar\" food but it's quality, tasty and made fresh to order.  The pizza is good, too.  Good beer selection and a truly local atmosphere.  The Harmony fits right into the vibe of the neighborhood.\n\nOh how I miss you, Harmony Bar!", "type": "review", "business_id": "KHOHjA8HOcTlFBCtMQFv8A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t66zdoWjfy-lRKf6Jc5CUg", "review_id": "qO3IWqjnteWR-xmP1m5NkQ", "stars": 5, "date": "2013-09-15", "text": "I received a rave recommendation from a friend, so I scheduled an appointment.  I was very happy with it.  Dr. Mauresetter, Amy and Robyn were all very professional and personable.  They were much more thorough than my previous optometrist.", "type": "review", "business_id": "vP7-03_-_NoNfwfeYADDPA"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "Y-nr6eaHwP3HF1jV4JKDJw", "review_id": "4b_EXhUCh4GUONIc4dg6Zw", "stars": 5, "date": "2008-09-19", "text": "Went here tonight based on Yelp reviews!\n\nWhat a great find! I drove by this place on my way to work for a YEAR and never thought to stop in. At a glance, it doesn't seem like much. Nestled(snugly) between two other buildings you can almost miss it. \n\nI'm so glad we stopped in! It has that true BBQ joint atmosphere- checkered cloth tables(each complete with it's own roll of paper towels), wood paneling, and Southern blues playing overhead. You order at the counter off of a big overhead wood sign, and they bring piles of saucy goodness to your table. This place is littered with awards for their barbecue. I guess the owner travels and competes(and a lot of times, wins) at national cook-offs.\n\nI got the 1/3 slab rib and beef brisket combo. The ribs were super yummy. Flavor-full, but not too smokey. The brisket was nice too, not too fatty. I would say that the house sauce has that vinegar-like tang. It's sweet and spicy and tart all at the same time. Nice. \n\nMy saucy side dish(aka boyfriend) ordered the turkey, which we both thought was good...but nothing amazing. The sides were really tasty too. The beans were delish, and the sugar-buns(read: fried dough dusted with confectioners' sugar) weren't too bad either.\n\nWe both left with tingling tongues, full bellies, and smiles on our faces.\n\n* just a note--parking in the \"lot\" is super sparse and hard to navigate in and out of...the only drawback!", "type": "review", "business_id": "HLWtNcf3l-wKb6v9duteMQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "sgkRdA1a1Vymdp83Qbikig", "review_id": "m_eB6jvO0_7aunvjklO9wA", "stars": 5, "date": "2013-03-17", "text": "First things first: the house BBQ sauce is fabulous. I love that it isn't just the regular brown house made goop that most BBQ joints serve. You can actually see and taste all the different spices/herbs!! Like I said, fabulous. \n\nI went with the smoked chopped pork shoulder sandwich platter and two sides: the potato salad and the corn. If you (like me) choose to order the corn to ease your conscience (after all, it is a vegetable, right?)...do not be fooled. The corn is puuuure buttery goodness. The potato salad is also delicious! Truly, the perfect complement to the sandwich. Creamy, no skin, no dill, just the way I like my potato salads. :9\n\nAt $8.45, the sandwich platters are very reasonably priced for the quantity of food you get. The takeout service is super quick as well - I think I got my food within 2-3 minutes of placing my order. Otherwise, Smoky Jon's seems like a fun place to dine in as well (lots of exposed wooden paneling and checkered tablecloths). You'll probably want to limit your party to a group of 4 or less though, the seating is limited!\n\nYelp recommendations for what to order as a first-timer to Smoky Jon's are on point. I can't wait to be back to try the ribs!!\n\nTip: their parking lot is tiny and shared with the bar next door, so don't expect to find any open spaces around lunch or dinner time. You'll have better luck parking on one of the residential streets behind the joint.", "type": "review", "business_id": "HLWtNcf3l-wKb6v9duteMQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DQBoquuWLC-FoKi9p9c3XA", "review_id": "on_GP9RCXbgzkbCPxFZFdg", "stars": 4, "date": "2013-07-05", "text": "My precious little brother has been going on about Smoky Jon's for some time now and we finally made a trip that allowed us to head on into this fabulous establishment!  I couldn't quite decide what I wanted so I went with my usual BBQ joint pick - pork sandwich!  I opted for the potato salad and beans on the side.  My entire plate of food was delicious and I'd absolutely come back again.  The only thing I didn't love was my husbands chopped beef sandwich - but, lucky for me, I went with my ol' bbq joint standby ;)", "type": "review", "business_id": "HLWtNcf3l-wKb6v9duteMQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "01JQIjU6SVSSOq6U5RYsIA", "review_id": "Y3Io8oOY6l07WtSTox2u0A", "stars": 5, "date": "2014-04-28", "text": "Ever since moving out to Milwaukee I've had a craving for this place. I wish I could get back to Madison a little bit more often just to make another trip to Smoky Jon's.\n\nWalking in it's clear what your in for. Jon has rib credentials! The walls are covered in awards and certificates the guy has won. Best sauce, best ribs,  best this, best that. You don't get the awards this place has without knowing what you're doing.\n\nI almost always get the ribs (because how can you not?). The sauce has just enough heat to really compliment the ribs. I've tried a few of the sandwiches, but I always end up coming back to the ribs because that's where this place really shines. \n\nThe sides are also very good. The potato salad and coleslaw are my favorites. I'm also big fan of the BBQ Baked Beans. The french fries are good enough if you get takeout from Smoky's (just because they travel a bit better than something like cole slaw), but with so much other great stuff to try you are really ripping yourself off if you stick to them.\n\nThis is definitely one of my favorite places in Madtown.", "type": "review", "business_id": "HLWtNcf3l-wKb6v9duteMQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "iKBS0S0l_PZ_iEaKw8W9bA", "review_id": "dkorVVPQHoRXmm9zeQik6A", "stars": 5, "date": "2014-02-25", "text": "best eggs benidict in the area from the traditional to salmon ,crabcakes even vegitarian version  tenderloin special all excellent do a great job on\n all breakfast from omletes to skilets to eggs corned beef hash pancakes only had lunch here once very good burger and club sandwich kids love watching the planes come and go always have had excellent service excellent food at reasonable prices can't go wrong", "type": "review", "business_id": "j515klfbCAEF3KPiKvHz9g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "76opifldV-cM0eYlxa5uDQ", "review_id": "4qp_eLv3k_NJDgkJAnnDgg", "stars": 4, "date": "2014-02-28", "text": "I called to order my lunch, the lady put me on 'hold' or mute for 5 minutes... she was kinda sassy but besides that the people there are really nice and the food is excellent. Not too loud or busy after 1 ish", "type": "review", "business_id": "S2x-rEziU3ONR9zO_vpPxA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aYhKsAUQaaRGgdgcZC5XAw", "review_id": "r7B-gUsrVjUMn4dKiFmGsA", "stars": 4, "date": "2007-12-23", "text": "We rented a van to move some furniture from Minneapolis to Madison (in one day) on a Sunday, and the only car rental places open on Sunday in the great city of Madison are the ones at the airport. (Uhaul was way too expensive!)  The polite man at the counter helped guide us to the best deal he could find and even let us cross that little old state line without paying a fee. We rented a van so new it only had 500 miles, it was clean, and it got us there and back.", "type": "review", "business_id": "yCbzzYKkPe1kfeMDdGq03Q"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "XgwZ6oYBPeCNrwnKD4Lxhw", "review_id": "24yct6h5nOgu2vcWwAe04g", "stars": 1, "date": "2012-02-13", "text": "Hmmmm, that's interesting. I wrote a scathing review about Lazybones on Friday. It is now posted in the filtered reviews. Please read! This is a terrible company.", "type": "review", "business_id": "IGSFz916np_GyQvlagAnlg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "XHyOkKd2OgCfFC1gS9bAbg", "review_id": "yKRt8IFN1DwORVqOCdUTBQ", "stars": 4, "date": "2013-01-01", "text": "What a treasure, right on the edge of town. My daughter went to camp there and they engaged the kids in lots of fun activities. The snacks weren't the healthiest, but the staff were knowledgeable and good with kids.  \n\nWe also went to their fall festival and my kids had a blast. The activities are fun, yet educational.\n\nThe nature preserve is open and free for all.", "type": "review", "business_id": "pA8LTxI1D44aKb3w-l6apA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j0mqCBlZemMaYw7tsDQ3dA", "review_id": "BkrM2_Ok-_f19IN6M_ULCA", "stars": 5, "date": "2013-04-21", "text": "I only drink their teas and they are fine. The nice aspect of this store is the employees. They make the difference between this coffee shop and other places. Case in point, I was in line when a woman handed the barista a card with her order. The barista read the card, rang her up, took payment, smiled and then gave the hand sign for 'thank you'. Super sweet.", "type": "review", "business_id": "zUR94L72x2yUit8mGC2tgA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ggYOH4WCjoRUsCkrUtJgFQ", "review_id": "HNm02IuMM7KSNxQLeFUbLQ", "stars": 5, "date": "2014-03-20", "text": "Had a remote start/security system installed there on my G5 and then got a new car and they swapped it to my new car for cheap. \n\nVery friendly and awesome people. Would recommend this place to people.", "type": "review", "business_id": "ImBOmnSOb1ajWskhQyaa4Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ghy-TxBPeAp5cfOLncIGEA", "review_id": "vTByhjycI6MfmcdOy4Fz9A", "stars": 4, "date": "2010-08-05", "text": "This woman does excellent work in a short amount of time. It's reasonably priced, too -- for a bridesmaid's dress that needed adjusting on two straps and work on the bodice, it cost about $84.", "type": "review", "business_id": "OS1AyePB5nFUqM2WFgXVEQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s3yGekFAyRsfSk85x8HniQ", "review_id": "RZwvNLe8zUT2XBqVmiNZpA", "stars": 5, "date": "2011-02-13", "text": "I grew up on this food. I even worked here at one point in time. This place is amazing. Eat here or else...", "type": "review", "business_id": "UyEbMXjDTNGks_k12fGNdg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "AkjJAQe73B80Pcj8v9o8Rg", "review_id": "IUdoiFnpOjcTgNg8cM-pZQ", "stars": 5, "date": "2010-07-10", "text": "There are so many reasons to shop at Metcalf's.  Sure, the price point may be a little bit higher than Copp's, but the produce and meat selection is fantastic.  They have a better cheese selection than the tiny Whole Foods one, too.\n\nThe thing that I really like about Metcalf's is that they are dedicated to the Madison community.  They are the sponsor of Brat Fest and are invested in the eat local movement.  It seems like every time I go there they have more signs up showing \"food miles,\" how far the food has traveled to the store.  They also have a beautiful display near the front of the produce area showcasing veggies and fruits from local farms.\n\nThere is a huge selection of prepared foods and even an espresso bar.  You can tell that alot of thought and money went into the recent remodel of the store.", "type": "review", "business_id": "OxR3b_qcMJlzwzGPU5fmdA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j0mqCBlZemMaYw7tsDQ3dA", "review_id": "jKlBVo2-qRq9bogMRyg9Tw", "stars": 3, "date": "2013-06-29", "text": "The food is ok...but the service is just bad. Either you get a woman squeezed into a junior high schooler's shirt who would rather be somewhere else OR you get a super hyper guy who thinks asking 40 questions about how your day is going is deemed good service....how about just not disappearing for 25 minutes when I need a refill?", "type": "review", "business_id": "cRqZ_w9ImfYYIXTHpJMv0Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ncv8cc1RIGk4q_GsSwrVrA", "review_id": "Jly6jdBOcEh8lQBwKyVsFQ", "stars": 5, "date": "2010-12-28", "text": "Carl did an incredible job on my wedding cake. My husband and I chose Carl as our baker at a wedding show. I had read online to be wary of bakers who use a lot of filling to disguise dry or flavorless cake, and this is what we were experiencing again and again at the wedding show...until we found Carl's booth. We both tried a different kind, and we both decided on the spot that this bakery would be designing our cake. The prices were very reasonable, and the cake received a ton of compliments at the wedding! Oh, the flavors we ended up choosing were hazelnut apricot and white chocolate raspberry.", "type": "review", "business_id": "tE8MQ9I7E2_Xvm4AvykXrw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ql59TDszJHwkv9MT-GshYg", "review_id": "J2-6IKI5UFYQ2tmXh_vOzg", "stars": 4, "date": "2010-05-03", "text": "I had microdermabrasion with Sarah.  It was my first experience with the service as well as the technician.  I think Sarah did a great job of making the experience pain-free, relaxing and even a bit educational.  I'm very happy with the results and will go back to Sarah for other spa services.\n\nThe atmosphere and decor are OK - not a complete spa feel, but not terrible.", "type": "review", "business_id": "WfeA7PurZdBOPXcGB27vEA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GEhwvEFLETXwLr_xhCnX5A", "review_id": "_lyPIBRXaAmRn_lKvtZgUg", "stars": 5, "date": "2011-12-05", "text": "Kevin the massage therapist is great. Listened carefully what I had to say and took care with my shoulder. Amber the receptionist is also great.", "type": "review", "business_id": "WfeA7PurZdBOPXcGB27vEA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VB-3JTZNJumCGlRKAjSjfg", "review_id": "Ep4jwFNiDkKWH89duTxf4Q", "stars": 5, "date": "2011-08-27", "text": "The food is great and the staff is friendly.    You gotta stop by for the lunch buffet, that is when it is at its best.  The mango chicken is awesome, it is like general tsos chicken but with a delicious mango fruity sauce, interesting and delicious.  they have offerings of a variety of smoked and seasoned meat and a small salad bar.  It is a highly recommened joint in Monona.  \n\nOnly thing wrong with it is the old building that it is in.  I frequent Davids so it can't be that bad.", "type": "review", "business_id": "qodyGnpmj1zEfi7nJ534BA"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "XqbTw6FlkTHRZaKCuKdkRA", "review_id": "8FwgLaf3C4rzwxFi9lwF3Q", "stars": 4, "date": "2012-09-26", "text": "A fun place to visit! Especially if you like spicy food and meat. \n\nWe did the buffet----it's kind of small but it includes a pretty good assortment of dishes + seasoned meats....I think there were a few types of chicken, curries, shredded pork, catfish, beef etc. \n\nThe jerk sauce on the table was amazing----so good we had to buy a bottle to bring home. The rum punch was delicious (and potent). \n\nFor some reason I wasn't expecting a Jamaican Restaurant to have Chicken Dumpling soup, but they did and it was great!\n\nThe atmosphere is 'fun' but not 'romantic'. It seemed to be busy & buzzing and everyone there seemed to be having a good time.", "type": "review", "business_id": "qodyGnpmj1zEfi7nJ534BA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "P0Q0fZ3GgTTsbNrkMYEfWQ", "review_id": "5bReFGMH0S7rpkoC3Hmn7w", "stars": 3, "date": "2009-01-08", "text": "The burgers and steak fries very good, and the crispy chicken burger is also very good non beef choice. The Towering onion rings are shareable and worth a try.", "type": "review", "business_id": "4pZeC9W0EIiBTOJMnwG2vw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "USMvkyKUVCnJGtyMPHmfrA", "review_id": "tOub_GR-Yq1N7wFWCN7d6Q", "stars": 2, "date": "2014-03-27", "text": "Is good hamburger!! But my low point is for the service. We wait during 10 minutes or more and never receive any waitress. We complaint with the manager a she was very good cuatomer service!!", "type": "review", "business_id": "4pZeC9W0EIiBTOJMnwG2vw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j0mqCBlZemMaYw7tsDQ3dA", "review_id": "CMrH4dXjH2q0mjS1uI3szg", "stars": 4, "date": "2013-07-02", "text": "I always use the on-line ordering. Simple and easy. Cuts down on wait time. I dig their thai curry soup. Nice and zesty.", "type": "review", "business_id": "jGU7WGOM2qUHofLKZAFAIg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9xBQ_omKY-ZAqqYrKZZt4w", "review_id": "9riADD0DZH4aTQIwL80Eqg", "stars": 4, "date": "2012-06-01", "text": "I had a good experience at this nail salon. Everything was pretty standard but clean & tidy. They offer all basic services & they also have shellac nails, which I haven't tried but it's nice that they were up on the trends. The technicians were all male so they had NASCAR on the TV in the pedicure chair area; that was ok but my technician kept turning to look over his shoulder to watch the race, which was a lil annoying. However, he listened when I asked him to be careful with my cuticles, some technicians at other places have actually cut me in the past, and he wasn't skimpy on any portion of the pedicure and manicure, including foot and hand massage. Overall, it was a good experience and reasonably priced and I would go there again. I took off one star because of the NASCAR-watching. :))", "type": "review", "business_id": "0YGTibmwR_D-L5XJxUtmhA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EQneSdGaV0gsh0M0Bb2IRA", "review_id": "UjpZ7HgL8HWce2-9n3bzOw", "stars": 1, "date": "2014-05-25", "text": "Nice people. Not enough staff to accommodate walk-ins that they advertise for. Pretty sure Andy (technician) does not know how to do shellac. Didn't have all the bottled products. But said each product line is different. Placed my hands in the drier and the polish bubbled and my hands began to sting. I said I don't think this right seeing that I've had shellac done before. He said just put the tips of your fingers in. Still in pain I declined to go further and asked to have it removed.", "type": "review", "business_id": "0YGTibmwR_D-L5XJxUtmhA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "bafakbBFSIkpafZts10TTw", "review_id": "hLPiaehPCX71OlWyINoQag", "stars": 5, "date": "2010-12-09", "text": "Toby's is wonderful.  Family run and super friendly.  Sit at the bar, have a cocktail and get your dinner order in.  When things are ready to roll, the staff will seat you and most often your soup/salad is waiting at the table when you arrive.  The lake perch and the fried chicken are excellent.  Don't miss this place!", "type": "review", "business_id": "FIR1SRvSAMNTO3VvNaJn2g"}
{"votes": {"funny": 0, "useful": 3, "cool": 0}, "user_id": "LL8Kl4wfe1NsmY_X7anqDA", "review_id": "wIhnrMM3J1dehEDQQ9ya3Q", "stars": 2, "date": "2012-05-30", "text": "Avoid this place.  Its super loud, and the weird seating gimmick is a nightmare.  Food was nothing better than average.", "type": "review", "business_id": "FIR1SRvSAMNTO3VvNaJn2g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Tg6Z_SL53-c-nyGWtgCTTQ", "review_id": "V1k9A5TEkj6HCQwohLVLBg", "stars": 5, "date": "2014-07-02", "text": "Great place for old school Wisconsin supper club dining. Lots of food, small prices. No need for an appetizer when ordering entrees as they come with bread, cinnamon rolls, and relish tray. Great place!", "type": "review", "business_id": "FIR1SRvSAMNTO3VvNaJn2g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "j0mqCBlZemMaYw7tsDQ3dA", "review_id": "sUDTQbpYrOfV8GdxsRdlDQ", "stars": 5, "date": "2013-05-01", "text": "Place is fantastic! Best in Madison. For all things growing - inside and out. Nice to be in a store where employees actually know what customer service means.", "type": "review", "business_id": "zzhSCOVTZ7MUKOAfwT-Bsw"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "vdtoIuqbVDq_AyhQQfx72g", "stars": 2, "date": "2014-02-04", "text": "I am dropping you down two stars.  I checked the website last night at 8pm and realized I missed the 7:25pm showing of 12 Years a Slave.  So I decided to go tonight.  \n\nI got there to purchase my tickets when the window person told me there is no such showtime.  I was like, what?  Huh?  No.  \n\nShe told us to head out and the times were on the wall.  Well they sure were, and in an obvious place, the numbers 7:25 were removed. The gap was comical.  \n\nWe were told by the manager that updates can be made and will be reflected on the website 15 minutes after they are made.  This means that the showtimes are simply suggested times, they will not actually be honored and can change at any time to put up a more popular film.  In addition to that, it was my responsibility to check the internet before I left home.  His assumption that I have constant and immediate access to the internet was insulting.  \n\nI was not the only one standing there.  Another patron complimented me on the points I made to Tom, the manager.  They are all valid points and completely unacceptable that an email is sent out each week reflecting these times.  Each theater sends out their showtimes.  In addition, I checked this time yesterday.  \n\nThe box office person did not even realize that a time was cancelled.  Inform your people to address the problem in a productive manner.  Perhaps: I apologize, there was a change to the schedule or I am sorry for the error, can I suggest another movie.\n\nThe movie was to show at 7:25.  Unless you got there 30 minutes early, you only had one other movie option.  Everything else started during the 6 o'clock hour.  It was offensive to be suggested that I see some other movie.  \n\nI am not always in the mood for an action movie or a cartoon.  I find it tragic that an award-winning movie is not being shown during prime hours.  There were so many of us dumb-founded that there were no other options.  Tonight, they lost at least ten patrons (that I could see).\n\nTwo stars is: Meh, I've experience better and I would say that is what Eastgate Cinemas has become.  They do not have enough showtimes for movies which lack blockbuster status.  Then to cancel showtimes with no notice is not a great way to do business.", "type": "review", "business_id": "pACm1yLb9Pwc1mOuvC3UDw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GIe3fZlWKtnPXTaGqmwl-A", "review_id": "S6vUzyiVjwTPsfzEW13Eew", "stars": 2, "date": "2014-06-14", "text": "It's a basic, few frills theater.  Their screens are a little too small for this day and age, which I assume they'll be fixing when they build the new location in Sun Prairie.\n\nI go to a lot of movies, and this theater is really no better or worse than most other theaters I've been to, and given that this is closest to my home, it receives the majority of my business.\n\nMy favorite part of this theater is the fact that I usually go to the bathroom before a show (who doesn't really?).  I always use the same bathroom (the smaller one to the right), and I usually end up at the first urinal when I go in.  At the first urinal, a few years ago, some dude wiped a nasal nugget on the wall when he was doing his business.  That wall widget happened to be nearly the same color as the tile in the men's room.  Now, every time I go in there, I look for it.  It's still there, over 4+ years now.\n\nWay to clean the bathrooms, Eastgate!", "type": "review", "business_id": "pACm1yLb9Pwc1mOuvC3UDw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sdk6OOrj9nZ8z6Ob0jcpDw", "review_id": "F7Q4b2LbKY_AVI0EyERk0Q", "stars": 4, "date": "2006-01-13", "text": "Now known as Milio's....different name, same sandwiches.  Yummy...and they deliver!  I dont' like pizza....so this is definitely my choice convenience food!  It sucks that they only includ lettuce and tomato...but the bread is great, which is key.  I love the Pilgrim's Pride.  They are pretty heavy on the mayo...so watch out.", "type": "review", "business_id": "r5S_wYdu1vKRW1k-7_yOIA"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "nrqnYcv2mZlRqZsi56Vf5w", "review_id": "RC5j7L3UxXzBWjkDtu67PQ", "stars": 1, "date": "2012-05-22", "text": "I have traveled all over this wonderful country and stayed in many hotels.  This easily ranks among the worst.  The staff is rude, the room has a weird stench if the AC is not on, and the \"breakfast buffet\" in the morning is a regimented affair with coffee canisters empty or spitting some weird, vaguely brown, lukewarm liquid. The staff will thrust a bag with unidentified contents at you if you do not wish to stay in the dirty, cluttered eating area, and tell you this is what you are \"allowed\" to take.  \n\nClearly this establishment benefits mightily from its location, so if there is a hotelier out there reading this I suggest you look into Madison as a likely place to put a comfortable inn.  I am sure I am not the only one who would take advantage of such a alternative.", "type": "review", "business_id": "kudu7t-QHJJa0aC0ojpm8w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t95D1tnWvAOy2sxXnI3GUA", "review_id": "1JlopVxrAeDNQCRnSHLHrQ", "stars": 4, "date": "2010-05-03", "text": "Easy ordering-on-line. Made exactly as I asked for. Piping hot. Sauce is SO, SO much better than their old stuff. Crust is like having an order of buttery-garlic soft bread sticks with your pizza. Delivery is super-fast, with charming, pleasant personality driver(s.) Our guests were apprehensive about eating Domino's from past experiences, and after the first bite, were practically inhaling pieces it was that good! I can tell that it is hand-made fresh. The dough is light and airy, the cheeses are tangy and savory, the meats are generous and better quality than most. My first choice in chain pizzas.", "type": "review", "business_id": "x5Mv61CnZLohZWxfCVCPTQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OIIz0WoudqkFxwqlsRdZBQ", "review_id": "bH9tXOWedXjyisuz0qgdSQ", "stars": 4, "date": "2012-11-17", "text": "Very nice place.  Good atmosphere.  We were stuck at ADEd across the street for a conference and lunch was \"on you own\".  Saw this on YELP and gave it a try.  Nice place, great view and good food.  It's a cafeteria, do not expect \"Nobou\".  For what it is, it's very nice.", "type": "review", "business_id": "2ZnCITVa0abGce4gZ6RhIw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0KXxuKxlspsO6CrDLgQJ-w", "review_id": "b9550T5uiBuPrxr7vECEeg", "stars": 2, "date": "2009-11-16", "text": "I may be biased based on my dislike of Thai food...but I'll put in my two cents anyway. \n\nI liked the atmosphere. I distinctly remember that is what reeled me in to try to Wild Thaiger- though fully conscious of my dislike for Thai food. Service here was bothersome, they confirmed my order before leaving the table only to return with another table's food. The mismatch was quickly resolved and I went on with my meal. It wasn't great, but that's just my taste. I personally do not like my food battered in Peanut Sauce or whatever it's called. \n\nOh, and the bathroom here was atrocious. Pubic hairs littered the urinal and it was anything but sanitary.", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_cfkppu33JhdiZknBSM50A", "review_id": "dodKfuLONa0Mtr-XQ6r2nQ", "stars": 4, "date": "2012-09-11", "text": "I normally order pad thai from any thai place but the dish to get at thaiger is the Beef Panang.  It is awesome.", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y12fi0cO3tAJp2zoDJONWQ", "review_id": "CRXtSFGETE8sPW6eUaRkxQ", "stars": 5, "date": "2013-04-03", "text": "This is a must try if you live in Phoenix and like Thai food. Great food, clean/hip place, great service, reasonably priced...what more can you ask for?", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WXPI32BFeXmLnqnOW0926Q", "review_id": "sMZfET0_iEVArhQcqSpzjw", "stars": 5, "date": "2013-07-24", "text": "The food is awesome and the decor is great.  I've eaten here a few times and never been disappointed.", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jiYLfkJo6KPSwWwLRgLpvQ", "review_id": "6sj96QoZdQqg2j-dQ2ogmw", "stars": 3, "date": "2013-11-17", "text": "Nice restaurant, good service but food was okay.\n\nI'm not a huge Thai fan and am not an expert by any stretch. I have a few favorites and prefer flavor over spice/heat. The two dishes I had at Wild Thaiger were lacking in flavor. They had awesome aromas, but fell flat on the palate. The chicken in both dishes was rubbery and overcooked.\n\nHowever, this was a cute restaurant and the service was good. The patio was nice.", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ye7i7pKLn7j26-M93J0DUA", "review_id": "GKy0NQ1VMEbLFD6izq73bg", "stars": 5, "date": "2014-03-21", "text": "Good Thai food is hard to find.\n\nYou've found it here!\n\nI went here for lunch today and was blown away. I feel like I've been to so many places around the valley and just haven't found one that I like. I found this place on a whim and decided to try it out. I'm vegan so it's hard for me to find places where I can eat anything. This place had multiple options and everything I tasted was good. I had the Tofu Veggie Pansang. It was delightfully spicy and the tofu was cooked perfectly. My friend had the pad thai and was equally as impressed.\n\nThey had good lunch specials and delicious Iced Tea.\n\nI will be going back here again.", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "3gIfcQq5KxAegwCPXc83cQ", "review_id": "l19PgiFDRML8TEEN1qxQUw", "stars": 4, "date": "2014-06-24", "text": "I cannot believe I haven't reviewed this place! I have been here a handful of times and each time it has been consistently good. My favorite item is the 24 K curry, which is a spicy green curry that features some delicious veggies (japanese eggplant that is melt in your mouth (probably the best eggplant I've ever had... I don't typically like eggplant), squash, and green beans). I usually add chicken and have more than enough food for two meals. Wild Thaiger has decent specials on some nights of the week for drinks (Mondays feature 5$ martinis). My only complaint about the Thaiger is that, unlike other Thai restaurants, they do not allow you to choose your spiciness level. I understand that some dishes may be better spicy or mild, but I would like to have the option available. I would say that Wild Thaiger is the best Thai food I have had in the downtown area and would recommend it.", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fx1jNuoZjyn0t5g2KUeksw", "review_id": "JQCXiYUurFDCI3sv0SfObg", "stars": 5, "date": "2014-02-18", "text": "Holy cow! \n\nI just had a haircut and a shave, and the experience was awesome! The cut was very good ( as always), but the shave was incredible! It took about 45 minutes, and was as \"full service\" as you can get (straight razor, hot towels, clay mask, cold towels, shoulder massage after). \n\nYou owe it to yourself to give it a shot, guys!", "type": "review", "business_id": "OtDcALEX6-LfEOQE0QgHYw"}
{"votes": {"funny": 3, "useful": 4, "cool": 2}, "user_id": "AYGHNy8gPxl2Q-etTT3hZw", "review_id": "lQtSCZ64PFaz_WCoMS-9XQ", "stars": 1, "date": "2010-11-08", "text": "The ideal customer for this store is someone who is heavily armed and who has the patience of Ghandi. You would need both to safely navigate the waters of this disastrous store.\n\nThis is the nearest grocer for downtown residents, and it is sad that this store misses the mark by such a huge margin.\n\nOn any day, the parking lot is covered in grease, coffee, and trash. IF by some miracle you are able to get inside without being hit up for money by tweakers, then the heavens are smiling on you.\n\nOnce inside the store, your adventure is just starting. The characters inside the store are the inspiration for the bar scene in Star Wars. Very random and sketchy. As far as the contents of the store, to be fair they have all the stuff you need, and at a reasonable price point.\n\nThe huge problem here, is everything else. During peak hours, they have very few lanes open, that is a consistent failure with this store. Customer service is also dead here, and they just don't know how to take care of customers. I feel as though the broken window theory is at play here. It seems like because they don't take care of the parking lot, and other details, the whole place goes to hell. The store also has a serious shoplifting problem. I'm not sure if they just don't staff the loss prevention unit, or if they are inept, but I have seen at least four episodes where a cashier is confronting a thief. It makes for an unsafe situation for everyone. They do have private security there, and the guys seem really nice, but clearly in over their heads. At this point the store is so far gone, they really need off-duty police officers to make it safe.\n\nIt really seems like this store just doesn't give a shit. At each opportunity to impress, the complete opposite happens. This place is a huge safety problem, and I would hate to have my sisters or Mom go to this place, it's really that shady. See for yourself, but be on your toes.", "type": "review", "business_id": "7Z7IkR_-94AjUuDw0fbI7g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "KRA54Y_PCVYTrrZ4eTUzBA", "review_id": "vowvyxcxFA38paxf5u1U2g", "stars": 3, "date": "2012-09-08", "text": "I've gotten use to this safeway after living down the street for a year but it certainly is different than others I've shopped at. \n\nSize wise it's tiny. There are only 5 or 6 registers and there's always a line, no matter what time of day. The later at night you go the sketchy the customers get.  I went in for a late night ice cream run once and thought I had entered the Twilight zone.\n\nThe one thing stopping me from giving it two stars are the employees.  They're always friendly and willing to help.  I can always start up a conversation when checking out.", "type": "review", "business_id": "7Z7IkR_-94AjUuDw0fbI7g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PVIJ0S6sVxGYstpyWAUciw", "review_id": "5wOhqy97aSJLpDFKLoYuUg", "stars": 2, "date": "2009-05-09", "text": "This place used to be great, with unique dishes, yummy breadsticks with special butters and complimentary white chocolate for dessert. Now it's just average, with nice outdoor seating.", "type": "review", "business_id": "e5kc0CQ4R-PCCDgb274gSg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "_p9EnnLQg6KDlIRU2fYEJA", "review_id": "Np7qt0WVsfqZix7zlV1nmg", "stars": 5, "date": "2011-04-26", "text": "...NOW WE'RE TALKIN'! Killer Mexican Food! The chips 'n salsa kicks ass! You get a red, blue & regular tortilla chips with reg, spicy salsa & bean dip! Hellava start! A kick-butt margarita! Had Chicken Fajitas!...THE BEST! Cannot wait to return! Great ambiance.", "type": "review", "business_id": "e5kc0CQ4R-PCCDgb274gSg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JRNWY0Fr-uQpsFDXCn9_vw", "review_id": "vdh7F_uPSa8_7jKq8NgYcQ", "stars": 5, "date": "2012-01-14", "text": "Everything about this place is perfect! The chips & salsa and enchilada's were delicious! I would recommend this place to all my friends!", "type": "review", "business_id": "e5kc0CQ4R-PCCDgb274gSg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vMwnJLV3yF07yJ06zdRgoQ", "review_id": "vW37uGFVuXGPv_ugwm870A", "stars": 4, "date": "2012-03-17", "text": "I went to this place two times while I was visiting Phoenix. The first time we had a very large party and the service was great! We were seated quickly and served drinks and our food in a timely manner. Prior to ordering I checked out other Yelp reviews just as you are now and the things that stood out to me we're the chips and salsa and the margaritas. Well, everyone said it and I'm gonna say it too! You must try the chips and salsa (my favorite chip is the wonton chip, a little sweet heat! Yum!) and of course to go with it get the top shelf conmemorativo margarita...so, so, so good! I also got the spinach and portobello mushroom quesadilla and it was good. \n\nIt was so Delish that I brought a different large group of friends back to this place. Unfortunately, the restaurant was much busier and I'm not sure they handled the large crowds very well. We were told 1 hour wait, but after 20 minutes our buzzer went off. When we gathered our group to be seated the hostess told us it was a mistake and asked us to wait off to the side in the dining area. This wait was another hour before we approached the hostess. She was very rude and told us it would be 'awhile' but wouldn't give us a time frame. When we asked if it would be 10? 30? 1 and a half hours? She said it would be at least that! Unacceptable when we were told an hour wait. I asked to speak to a manager and Tony was extremely responsive! He worked it so that we were seated right away! The server  was fantastic as she stepped in to take our large party and we were seated outside her section. The chips and salsa came out quickly and she was great with getting us drinks (of course I had another round of the margarita) and the food was great. This time around I had the salmon. So delish! And the desserts were covered by the server as an apology for our wait. \n\nThe manager Tony was great, responsive and helped me to overcome my disappointment in the rude hostess encounter and he brought me back to a 4 star rating for the great service and food once we were seated. I would definitely recommend this place and the margarita!", "type": "review", "business_id": "e5kc0CQ4R-PCCDgb274gSg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "K7C-duTQBWpjdA1LA8G5NQ", "review_id": "VT7JweNJAtRaSbaCqcJy5Q", "stars": 3, "date": "2012-12-15", "text": "We didn't have a really good experience here, but I don't think it was the fault of the restaurant.  A little misunderstanding with the server on \"gluten free\" food, but otherwise food was good, relatively competitive with others.  Atmosphere wasn't really what we liked, but that is a matter of personal opinion.", "type": "review", "business_id": "e5kc0CQ4R-PCCDgb274gSg"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "W_7aQXf0uC4GKvte4tlewA", "review_id": "ABET4bgRhwZ40hDIioAqHg", "stars": 3, "date": "2013-05-18", "text": "I've been here twice now.  My first visit was great.  The service was perfect.  I was pleasantly surprised by the chips and salsa and the special of the day was excellent.  It was a very interesting mix of Italian and southwest.  \n\nMy second visit didn't go quite as well.  My group was sat at the very back of the restaurant and the servers visits where few and far between.\n\nPerhaps I should stop wearing my \"bearded for her pleasure\" shirt when I eat out...", "type": "review", "business_id": "e5kc0CQ4R-PCCDgb274gSg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Y-dppYjzqvBIgnzu5accng", "review_id": "a-TRpYru7KDzt35RSjzNFQ", "stars": 5, "date": "2014-02-08", "text": "What a great menu and patio... The commemorativo margarita is great...", "type": "review", "business_id": "e5kc0CQ4R-PCCDgb274gSg"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "JkyvCg99SMdfS6OZv2P3RQ", "review_id": "2Htm98G_EzDTHdOdjjeedg", "stars": 4, "date": "2014-02-13", "text": "Great outdoor seating in the Arizona Center. They open at 11am and have a nice top shelf margarita selection.  You get a shaker full of drink so it's more like three drinks in one.  We all had soup and salads. It was a good lunch with  nice variety of flavors.  The chicken pablano chowder was really nice.  End of the meal comes with a little treat of white chocolate pecan in a tamale husk.  Yelp check in gets you a free dessert with entree. I didn't think the soup and salad would classify but our waitress was awesome and said she surely could do one dessert for our table of three. \n\nGreat place for lunch. Plenty of seating. Starting filling up at noon.", "type": "review", "business_id": "e5kc0CQ4R-PCCDgb274gSg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ac7QbXDuYdMdm-oTS2nfqQ", "review_id": "o-sUhKNYtgB1feKjnDr6iw", "stars": 4, "date": "2014-07-13", "text": "We went here for mother's day meal 5/2014 and I was very pleased. It was an excellent day and we were able to eat in the patio area. I remember that the chips, as I had previous read, were great. Some where deep fried, different flavors, and overall a great way to start the meal. I had the carnitas plate and it was very moist and portions were plenty. The flavor was very good. We also took advantage of a yelp check in free desert and the banana burrito was great with banana wrapped in a crispy sweet tortilla topped with ice cream.\n\nThe food was great and vibe was really nice on a nice breezy, summer day. The waitress was very helpful, good service and the chef actually brought out samples of desert that I can not remember the name but it was a nice touch. The only bothersome part that there were pigeons that interrupted our meal a few times but not a big deal. If you are in the area, highly recommended.", "type": "review", "business_id": "e5kc0CQ4R-PCCDgb274gSg"}
{"votes": {"funny": 3, "useful": 4, "cool": 6}, "user_id": "-F32Vl8Rk4dwsmk0f2wRIw", "review_id": "gw7yjb1p_Brj130iFCqXVg", "stars": 5, "date": "2008-02-07", "text": "The best sandwich I've had in my life was one I had at the Teeter House ... the Prosciutto, Salami and Imported Provolone sandwhich.  I was so addicted to it one summer, I walked over there maybe 3-4 times a week to order it.  It was bizzare rolling up in a RVCA tee and a pair of cargos and Reefs while the other partrons were having some kind of Royal Family flashback in their feathery headpieces and pinkys skyward.\n\nBut whatever.  I ALWAYS sat outside under their very large oak(?) trees that shade most of their front area.  This was great for some serious people watching ... mostly tourist wondering why Bianco is closed at noon, but attempting the door anyway.  They would eventually mosey over to Teeter ... good for them!\n\nAnyhow, back to this sandwhich.  Its unbeleivable and pretty large with a side of rosemary potato salad and some fruit.  Teeter house also serves beer and wine, which was always nice.  They have a pretty good selection too.\n\nMy only complaint is that they open too late (for morning coffee -- although once i guess i looked thoroughly disappointed that they weren't open yet early on a Sunday while they were setting up and gave me a free coffee-to-go anyway!) and they close way too early.  If they serve booze, they should mos def stay open til midnight or so, especially with a haunted house for effect.", "type": "review", "business_id": "gBcpDl0quCLABsg5OuSFww"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-570uF5n0afghfwatc-M8w", "review_id": "YoaAPjLFEmrZfLVZGrBJpg", "stars": 1, "date": "2010-05-09", "text": "Business is closed. Signs at front indicate its for sale & phone is disconnected", "type": "review", "business_id": "gBcpDl0quCLABsg5OuSFww"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4D4UzEOu-QG4-jkyfynhPQ", "review_id": "uQ9LfYkc9BaAbfWhMOvVxQ", "stars": 4, "date": "2013-09-29", "text": "Driving down central about to head to another lunch location when the driver starts talking about Burger King and whoppers, so you know we had to find the nearest Bk. The taste of the whopper is so good and unique. Plus I haven't had one in a while. \n\nUpon arriving to this location, it is not busy at all, and the parking lot is empty but that doesn't stop our Whopper journey. It is a dated Bk but playing some good tunage!\n\nThe man who took our order was very nice and seemed happy to have a customer\nWe both got whoppers and I actually opted for the double whopper, don't judge me, haha\n\nI didn't know that they got the new Coca Cola machines. I think they're like \"free style\" super cool and so many flavors. I was happy to see Cherry Coke. \n\nSince the Bk isn't busy our good was made from scratch which is kinda neat\nThe whopper is nice, fresh, and hot \nTotally good\nThe fries are super fresh which is very uncommon at any fast food joint :)\n\nThis was such a good last second choice and a total money saver :)", "type": "review", "business_id": "72N6TdH5MdUWE2YhYRbyxw"}
{"votes": {"funny": 6, "useful": 6, "cool": 5}, "user_id": "WZCAwPXauKtNoAhHK2-pCA", "review_id": "VS8m5CqOVgQ_lAQ1R7gbHg", "stars": 5, "date": "2008-08-28", "text": "Firstly, hat's off to Jenn H. who had the cojones to give this place a lousy review without also coming off as insensitive.\n\nThe story of the various Native American tribes is an incredibly solemn one that is all too often glazed over in your average grade school American History course.  I was blissfully unaware of it until my wife decided to dedicate the rest of her life to studying indigenous cultures and schooled me on the following - For 200 years, Native Americans were seen as uncivilized beasts in need of strict re-education to meet the white man's version of civility.  Not until the 1960's (and as recently as 1990 with the passage of several federal laws including the Native American Languages Act) has the United States finally reversed course and decided to protect the various Native American cultures.  Sad, but true, and something your average American probably doesn't know and likely doesn't want to know or care to know.\n\nThankfully there are places like the Heard Museum which does a brilliant job of telling the story of many of the tribes that were located in the Southwest.  I feel it is unduly categorized as an \"Art Museum\" by many instead of an \"American History\" museum.  Yes, you get the art - in the form of pottery and jewelry and Kachina - but you also get the traditional clothing, the traditional cooking, the language component, and most importantly the history lesson.  If you leave here thinking, \"that was just a bunch of pottery and dolls\" then you've totally missed the point.\n\nThe first floor of the museum has a great flow to it with each section dedicated to a different tribe.  Obviously there are many similarities, but the most interesting things are the subtle differences between the tribes.  It also has changing exhibits on the second floor - when I was there it featured a wonderful exhibit on modern Native American art (sculpture and paintings and jewelry).  There is also a heart-wrenching exhibit on the horrific boarding schools the children were forced to attend, often far from their homes and at extremely young ages, to strip them of their cultural heritage.  My favorite part has to be the hands-on exhibit, likely meant for children but I couldn't keep away from it.  So what if I'm pushing over a 5 year old to get a pipe cleaner and tissue paper to make a flower?  There is even a section of the museum dedicated to other non-American indigenous art and garb.\n\nWhat an excellent excellent museum.  You leave much more informed and with a necessary touch of white guilt.", "type": "review", "business_id": "SG_gEmEXL4ID6RAEinC5Bg"}
{"votes": {"funny": 9, "useful": 17, "cool": 15}, "user_id": "1BW2HC851fJKPfJeQxjkTA", "review_id": "jA8PcY1ABHeCGydhbkjnxA", "stars": 5, "date": "2012-12-14", "text": "The Heard Museum is probably one of the best we have ever been in!\n\nThe history of the indigenous First Nation people in North America is both sad and very compelling.  And, the collection the Heard family has assembled and the museum has added to is incredible.  Yet, it's the little exhibits that move me the most.  I am still brought to tears whenever at the end of touring, I come to the hand crafted dolls of the US Marine WWII Navajo code talkers raising the American flag (See photos).\n\nOn our most recent trip here, we enjoyed the Barry Goldwater Bolo Tie exhibit, and  listening to the tour guide of First Nation peoples in Arizona.\n\nBTW, the best deal is becoming a Member of the Heard by showing your AAA card.  It's a small discount but you get their magazine and newsletter.\n\nEnjoy!", "type": "review", "business_id": "SG_gEmEXL4ID6RAEinC5Bg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XFtR4CccaDyfvVs-ST41tw", "review_id": "1V5UmbY3KbJuYGnbhT88NQ", "stars": 3, "date": "2014-07-11", "text": "Pro:  Absolutely beautiful collection.  A great mix of ancient through modern items.  I especially enjoyed the kachina dolls.  Con:  it cost my family $84 admission (my husband paid before I noticed the price and could say \"NO!!!\").  $15 for a ten year old?  Exorbitant!", "type": "review", "business_id": "SG_gEmEXL4ID6RAEinC5Bg"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "9tXL9eJNIi9SL5pdCYeyZQ", "review_id": "lYtUU51UPZ9P1QiZt7EQDg", "stars": 5, "date": "2013-03-11", "text": "Attended this school from 6th grade through senior year. I credit every success I have in the professional world to what I learned here. Presentation skills, group organization, personal prescence, and still having fun with arts on the side.... what more could you ask for? I would send my children here, my grandchildren here, everyone. It takes a certain sort of driven child to succeed here, so any of the regular \"coast through life\" types need not apply. Work hard, Play hard, Succeed.", "type": "review", "business_id": "Z9GH9bo8SHKx3oOokhHLyw"}
{"votes": {"funny": 2, "useful": 1, "cool": 2}, "user_id": "-tjest9KLtzl_7iselznuw", "review_id": "Y58YzgMxrSuqhIvBBQ8McA", "stars": 5, "date": "2010-02-24", "text": "\"Hey Dan! How's it going?\" \n\"It's going good! You?\"\n\"I'm great! Good game last night.\"\n\"Thanks man!\"\n\nThis is the conversation I had with Dan Majerle the last time I was there. There's NOT a better sportsbar downtown the Majerle's. Great beer selection, great food, great location, and if your luckey you can talk to Dan freaking Majerle! That guy drains 3's and half court shots like a stripper uses her pole. Majerle's is a MUST on game day. Before, after, or both.", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "jLjBtvsSbwjFxv_GPW2ZIA", "review_id": "30xZnPd8mcv21-L-Z6Hjog", "stars": 4, "date": "2010-09-18", "text": "They did have unique items to Majerle's, but for the most part typical sports bar grub. The service was outstanding!! The best I have had ina long time.... Well worth the visit...", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "02mA_muC-5A_Oe_tv8tg0g", "review_id": "4MR6HXH1yT2zcrbYZkV-0Q", "stars": 3, "date": "2011-03-08", "text": "Thought I would try Majerle's Sports Grill for lunch. I haven't been there in about 12 years. I've always liked the atmosphere and it's still nice. Sat at the bar and based on the reviews I've read, I was expecting some great things from the staff. While the service was prompt, it wasn't very friendly. I'm a pretty plain eater, so I had the turkey sandwich, with mayo on the side, The meat was excellent, but the bun was a little disappointing. If I go back, I'll ask for it on white sandwich bread. The prices are a little steep, but with such a location, that's expected (Convention Center across the street and the Suns and Diamondbacks just one block south). For a Monday afternoon, there was quite a crowd there (mostly businessmen and some convention attendees).", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "IkOaRADjz1YxUXpe7BNf4A", "review_id": "SgWmMIAra9D2yvU_fofQpw", "stars": 4, "date": "2011-12-26", "text": "Hamburger bun too big and should be toasted. Meat patty too big for bun and not enough flavor.   Fun and great service", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mR7LQurf_awsKqDK46NRew", "review_id": "-lWaTPAXCLfRO3Z9R0akiw", "stars": 4, "date": "2012-02-01", "text": "Fun to hangout here during Sunday football! Also fun place to watch baseball games on TV. It can get pretty busy before the PHX teams have home games, but other than that it's pretty decent. They have great specials on Sunday morning/afternoons on beer, Bloody Marys and Mimosas. Sandwiches are great. If you haven't tried the Traverse City wings you haven't LIVED! Service is decent, not the best downtown, but certainly not the worst. I find if you sit at the bar you'll get more attention than at a table when it gets busy.", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "TmrLXwR7eTyy0nzxXhdcnQ", "review_id": "nVTu096PW0FPL9oX0nAlKA", "stars": 2, "date": "2013-10-03", "text": "Bar food. Nothing more, nothing less. Had chicken soft tacos. Burgers looked good. Tried some chips and salsa too. Read other  reviews about customer service...spot on. Our party had lots of food left on the table when we left. Coworkers gave it a 'meh' as well. No need to return ever again.", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "J3I2NClEbD1Xr8lOdjxlqQ", "review_id": "d8_F2yjTYtxXzJnLXD3QbQ", "stars": 2, "date": "2013-02-15", "text": "Yellow cab, you suck!\n\nFortunately for you, and my wife, you don't suck as bad as Discount, but it's dang close.  So, when Discount flaked out on us, we called you, same story, four people to the airport with luggage, we're gonna need a big cab.\n\nThe hispanic cabbie shows up, cannot speak english, and has to unload a bunch of shit from his trunk before we can start trying to cram our baggage into his tiny sedan.  I try and explain that we requested a larger cab, because, hello, we're dragging shit for 3 women along.  The language barrier goes up, and cabbie gets on the phone with an animated conversation with somebody.  Meanwhile, we are past our deadline.  The wife says eff it, we'll make it work.  Miraculously, we all cram into the cab and proceed to tell the driver how to get to the airport.\n\n20 minutes of blasting campesino and heater, with my 20-year old daughter in my lap, competing for space with my backpack, we arrive at the airport, and pile out.\n\nWe were too late for our flight.  Yes, partially your fault, but mostly Discount Cabs fault, I'm pretty much put off by cab services period.  Next time, I drive and park in Long term.  Sure, it will cost more, but I can count on the results.\n\nNot happy.  1.5 stars is generous.", "type": "review", "business_id": "yR3U7jOgoD0V0sGovuyt0Q"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "N-D-d1Z4UybdlkK1HxlNPA", "review_id": "vx7g8A_1KV09mvsU3wwWUQ", "stars": 5, "date": "2007-12-02", "text": "Yesterday I saw the Actors Theatre production of \"A Christmas Carol.\" For me, It's just not Christmas without at least one viewing of the Dickens classic, and this version was so good and so satisfying that I may actually forgo my beloved George C. Scott this year. Fezziwig teaches at the same school I do, and told me about the discounted tickets available. Even at the regular price ranging from $20 for children 16 and under to $47.50 for adult tickets, this production is worth every penny.\n\nI was amazed by the quality of the special effects, impressed by the comedic timing, and found myself misty eyed at the end, having fully invested in the actors' performances. Even the kids were great, especially the little girl who played Fan (what a voice!) and the adorable kindergartner who played Tiny Tim (he is also \"Half Day\" in the Subway commercial). And in spite of the fact that I am one of those soulless people who despises most musicals, I found myself tapping my toes along with the songs. \n\nI don't want to ruin the surprises by giving too many details, but I urge you to get your tickets today. This is a show not to be missed!", "type": "review", "business_id": "rrXhjI4YXmWO8GbmX8oGqQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "BkmIUgwHg_5TCkJbdMEiJQ", "review_id": "HANd0lQo2tR2xNz46MJFTw", "stars": 4, "date": "2008-07-27", "text": "I normally don't like chain breakfast restaurants, but since this place is within hang-over walking distance from my house.... I typically find myself walking over for Sunday breakfast before the church crowd gets let out and invades every eatery in town.  Most of the staff here have good customer service skills, and I even see the manager busting his butt busing tables, refilling glasses, seating people and expediting food (leadership by example).  The food is your traditional breakfast chain food, with an emphasis on, guess what, pancakes.  If you're not a fan of the pancake, they'll substitute for toast or English Muffin.  Their bacon isn't quite up to par, but most chain restaurants don't measure up to the thick cut, apple wood smoked bacon that higher end places serve.\nOverall, this IHOP far exceeds any other chain breakfast restaurant in the valley.", "type": "review", "business_id": "P7wKlbSRsoRrfH3DFOY08A"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "WgpyvVqYAc3FOvk-G-Erwg", "review_id": "-kwiYK-Xxvc6I6f03lYK1g", "stars": 3, "date": "2012-01-22", "text": "It's Ihop, good when nothing else is open and you want breakfast.", "type": "review", "business_id": "P7wKlbSRsoRrfH3DFOY08A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZvvxtxeTad9t3ZoxdNYe_g", "review_id": "17RNExP_4VTKyG4vXI_r5A", "stars": 3, "date": "2013-08-08", "text": "Location was clean. Service was fast. Staff was friendly, and at unholy hour of 5:30 A.M, I think that deserves special recognition.  Got big, filling breakfast with coffee for $10+tip.  I have had m