{"votes": {"funny": 6, "useful": 0, "cool": 0}, "user_id": "ZYaumz29bl9qHpu-KVtMGA", "review_id": "ow1c4Lcl3ObWxDC2yurwjQ", "stars": 4, "date": "2009-05-04", "text": "If you like lot lizards, you'll love the Pine Cone!", "type": "review", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "nJ_6gzvBj0mF943eWZ0cSw", "review_id": "DAFwq9T6sKDYiyQHiAzVbQ", "stars": 5, "date": "2013-10-28", "text": "Some times Jane and Michael Stern are on point and other times the story of the place beats the food.  I would definitely return to the Pine Cone.  It's a bakery and diner attached to a truck stop on the Wisconsin highway.  I live in Chicago and work in a famous Mexican restaurant and I get up to Wisconsin for the old school steak and butter as much as possible: it gives me the energy to do my job.  Pine Cone has eclairs and cream puffs the size of my cat.  And I got a pig cookie.  This little truck stop gives me the big energy to get even deeper into steak and butter territory.", "type": "review", "business_id": "JwUE5GmEO-sH1FuwJgKBlQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L5kqM35IZggaPTpQJqcgwg", "review_id": "b3u1RHmZTNRc0thlFmj2oQ", "stars": 4, "date": "2012-05-28", "text": "We order from Chang Jiang often and have never been disappointed.  The menu is huge, and can accomodate anyone's taste buds.  The service is quick, usually ready in 10 minutes.", "type": "review", "business_id": "RgDg-k9S5YD_BaxMckifkg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5SpVLn2FV2V_ORdugExiIg", "review_id": "ely6It59f_aOIDTkQuVJCg", "stars": 2, "date": "2014-06-12", "text": "Needs more books and homeless people. DVD collection didn't include Jingle All The Way and the place feels off putting. One star.", "type": "review", "business_id": "95p9Xg358BezJyk1wqzzyg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rL7XG25E24mErfg9sZ_-wA", "review_id": "dexeF9_xWX_96Zm63Q7zSQ", "stars": 4, "date": "2011-08-23", "text": "We love The Green Lantern. The food is wonderful and the price is great. We have never had a long wait for a table and once we are seated we are always waited on right away. All the staff is very friendly and atmosphere is welcoming. We have taken several friends here for dinner and always have a great time.", "type": "review", "business_id": "rdAdANPNOcvUtoFgcaY9KA"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "V3JTVZR8orDlmfwCZG1WHg", "review_id": "w3nMpet6lmITj8j8p9IE_A", "stars": 2, "date": "2013-08-19", "text": "Stopped here while on a Sunday drive.  Tried sitting outside and the waitress did not make us feel welcomed.  She was rude and careless.  We walked inside to the bar where the bartenders were a lot better.  Unfortunately the same lady came in and started venting about her customers.  Seems like they have enough customers and do not need to be nice anymore.  Too bad because the beer was nice and cold.  Great views too.", "type": "review", "business_id": "_wZTYYL7cutanzAnJUTGMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "clKTx-oACO0rwblV40tpWg", "review_id": "GqLgixGcbWh51IzkwsiswA", "stars": 4, "date": "2014-02-17", "text": "I would not have known about this place had it not been for the Holiday Groupon. I redeemed mine with my bf over the weekend, and the food was delicious and cooked well (see Holiday Groupon pic).\n\nThe restaurant was packed on Saturday night; I'm glad I called in a reservation. Local town folk. Not a huge place but still cozy. The servers were running around and busy but made sure that our table was attended well. Ask for Dee Dee; she's a trip! I'll be back again for more food once the snow has melted to try the other items on the menu.", "type": "review", "business_id": "_wZTYYL7cutanzAnJUTGMA"}
{"votes": {"funny": 3, "useful": 0, "cool": 0}, "user_id": "_xf2ECTRftPV4bzK4mGYEg", "review_id": "-5Wtp9p0jFkAy-eioIbfuQ", "stars": 1, "date": "2009-05-20", "text": "Smoke-filled bathrooms, gross food, even if the burgers are a buck.  Expensive bowling, but on the upside, only one of the bartenders is a tool.", "type": "review", "business_id": "1tkeiIa-daD8LbM6mHm_9A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "LFFOb2_HufbLkXNoBTrKIw", "review_id": "jh8euyAwA6dTGPwf3FEZTA", "stars": 5, "date": "2012-10-17", "text": "Yum!  Party of 7, everyone ordered their own dish and then shared with all.  Started with pot stickers and shrimp ragoon.  Grilled pot stickers were really good, could have just eaten those and been happy.  Appetizers came with a variety of dipping sauces.  Best dishes sampled were crispy orange beef, almond chicken and generals lamb.  Lamb was way tender, excellent choice.  Service was prompt and friendly, great atmosphere.  Ended meal with delicious mango ice cream.  Left happy and very full!", "type": "review", "business_id": "SKLw05kEIlZcpTD5pqma8Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xOe-ZopdYiu8ijimmtdrnA", "review_id": "DavxDAi3EABo4SKWYwXXsg", "stars": 1, "date": "2010-07-29", "text": "Ate here once with a buy one, get one coupon. I won't be heading back. Go to Los Gemelos off of State St instead.", "type": "review", "business_id": "77ESrCo7hQ96VpCWWdvoxg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bIXI5KABBzU1Nt_RaB6Nug", "review_id": "zaGZsJTnQMSXepntO6Vsxg", "stars": 4, "date": "2012-07-13", "text": "I really enjoyed my dinner here. I had a fantastic fajita platter, which included beef, chicken, shrimp, and the requisite peppers and onions, but also whole scallions and tomato wedges. Delicious! The guacamole was decent, though a little bland. And my husband's mole sauce was just OK. But I really liked the spicy salsa they brought to the table when I requested it.\n\nThe service was pretty great; there was a whole team of servers that were constantly checking up on us to make sure we were doing OK. Every time we had a special request (see: the spicy salsa), they were right on top of it.\n\nBut what I REALLY liked was the margaritas; our table had a pitcher of blended strawberry margaritas, and they were absolutely perfect. Blended just right with no big chunks of ice; perfectly balanced strawberry and tequila flavor. I could have consumed that whole pitcher by myself without even putting in too much effort. Yum!", "type": "review", "business_id": "77ESrCo7hQ96VpCWWdvoxg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "s__z7O5ybdky0KmXkA6MZA", "review_id": "-IZnuvii3PkudUtn6xQ-Jw", "stars": 4, "date": "2014-02-10", "text": "My wife and I have played in the volleyball leagues (sand and indoor) and our kids do some of the kids programming.  Facility is very nice and great atmosphere. Instructors have all been really nice and referees do there best, but very nice. :) Only reason I have it 4 stars instead of 5 was because of the high costs. As someone else said in their review, it is more expensive and sessions are shorter. But overall,  very good.", "type": "review", "business_id": "368m5-RtrrYWf4hPM_bMlg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "mur7-hRX-PTZy64QscTw5w", "review_id": "Xj0bl0K4uKa2-ujs_vwkhw", "stars": 1, "date": "2012-07-29", "text": "Went there on Saturday night to get some food to go. On of the worst Chinese Buffets I've seen. Half of the trays were empty and other half were almost empty. Very little selection. The worst pay is the take out prices: $10.50 to get a to go box(should be under 2lb) and 40 cents for every ounce after, WTF is that!!! So we just went somewhere else that night and didn't dine there at all. Bottom line: EAT SOMEWHERE ELSE.", "type": "review", "business_id": "MKsb2VpLB-0UBODcInDsSw"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Yhlx0ob3UDz2PcJRat2QgQ", "review_id": "XcAeUrCABfRy1Xoms42xEA", "stars": 3, "date": "2013-02-21", "text": "I'm soo confused.\n\nAm I in a post office, sit down restaurant, or casual coffee shop? If you were going for the blend of all three, then heck, I guess you nailed it.\nSeriously. There are postal boxes in this joint.\n\nThe best things I can say about this was that the coffee was hot. The breakfast burrito I had was \"meh\". Nothing great, nothing terrible. It was warm but took fooooooooorrrr-eeeeeeev-errrrrrrrrrr.  It was just okay. They don't accept plastic. I can understand your local dive bar or small coffee shop not wanting to accept plastic, but for what (I think) they are trying to do here, I would expect them to accept cards. But they don't. If you think about it, it almost seems like they are going back to the good ol' days of the general store. Middleton's one-stop shop.  You can check your postal box, get your coffee, get your paper, and buy random goods. Besides a hitching post for your horse, what more could you need?\n\nTake it. Leave it. Whatever.", "type": "review", "business_id": "ShEYKerTwb2LSORE5o_s7A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "GB4J5OmTOzYuXPYQfGbSsA", "review_id": "w42Xl54invO2DzX-9zIjMg", "stars": 1, "date": "2014-02-13", "text": "Only thing less disappointing then the food is the staff.   Ordered Chin Wings, Hot & Sour soup and Sesame Chicken to go.. What I get in return is Chin Wings with the wrong stir fry sauce, a cup of hot & sour and lemon chicken.  They charged me for what I ordered, yet they still refused a refund me or to replace my food.. Avoid this place like the plague.", "type": "review", "business_id": "KW6HejC-67KSL9J8Cz1dSw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Jpb5uSnlLKD4RJzk7UGwkQ", "review_id": "2vONxrH0Y_RguMvUCGhzig", "stars": 4, "date": "2012-12-02", "text": "I haven't been to this location as much as I have some of the other locations but I do enjoy this location. Again they are all kind of the same in a sense but its about the interior and the experience. I actually quite like the people who work at this location. I have seen the same people working here for a while now and they always make me feel so welcome. They are usually a couple of early 30's to middle aged women working here that make ya feel like mom is welcoming you home. \"What can I get ya hun,\" \"How's your day going sweety,\" that kind of stuff. And some people may not like that but I enjoy it because it makes you feel way more comfortable to be somewhere. They are always fast and efficient and any extras you may want are stocked plentifully. The one small thing I don't like is that they are tucked away and really have to be looking for it to know where it is and it is sort of a small building. It can get really cramped if there is a line in there and pushed against some of the valuables. Nice place to stop after some shopping if ya know where it is.", "type": "review", "business_id": "3jpKGDkFrCHpjEYVEgcG0A"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "hJbhbqg-x3TFzhvqqwl5RA", "review_id": "Tj_PGLgbJdmYmY9z7IdhdQ", "stars": 4, "date": "2008-09-04", "text": "The Bristled Boar!! Just the name in itself is a sign of class.  With its Barn like exterior, and its huge Boar's head are signs of a true Townie bar the town of Middleton can be proud of.  \n\nAs you walk in, the open area for the pool, Foosball, and darts is a nice area separated from the bar allowing proper game play and competition. Also the boar's Juke has a very nice display of music including some of my personal fav's Shinedown, System of a Down, and Hinder. The bar also has an interesting array of  patron's for the true elderly drunks that have been attending this place from their mid 30's to those of the younger ages just looking to throw a few to many back. It allows for many interesting interactions making an evening here very fun!!\n \nAgreed with other reviews the beer selection is limited but they do have a descent array of hard liquors especially my personal favorite WHISKEY!! The prices from my one time stop seemed reasonable and the drinks actually had some liquor in them instead of just soda or water.\n \nI have yet to try any food or enjoy their volleyball courts but would recommend that anyone interested in a townie atmosphere with the possibility of some excitement to give the place a try. I know I look forward to taking some of my friends to this place to get their opinions of what I like to call Middleton's Best Townie Bar!!!", "type": "review", "business_id": "c5awCF5eu0ZkxUf_i94uPA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-XnKJ4tIT8r9R5n2DHPPWQ", "review_id": "tQt8GZyeJ1KMCE5I3PhSjg", "stars": 4, "date": "2012-10-19", "text": "Free tacos for packer games!  free touchdown shots!  great prices calm atmosphere", "type": "review", "business_id": "c5awCF5eu0ZkxUf_i94uPA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "Jpb5uSnlLKD4RJzk7UGwkQ", "review_id": "A-L86Ox9hl8Pu9F2uLoRSQ", "stars": 4, "date": "2013-06-27", "text": "This place is actually pretty neat. I loved the Boars heads on the wall and the old western type feel to it. The drinks were really good, well made and strong but for some reason I really enjoyed the food. For being bar food it was actually pretty spectacular. Any drink ya like at a cheap price and some cool stuff to look at. Whats not to like? They got big TV's and fast service. (eBay style) A++++++++++++ Great Seller!!!!!! Will do business again!", "type": "review", "business_id": "c5awCF5eu0ZkxUf_i94uPA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "V_7r3XVzPtXJyOSN34xx4w", "review_id": "JDt9s1iaqnwyOHQ_5lcmcQ", "stars": 5, "date": "2009-02-28", "text": "I've been really happy with All Pets.  They have nice, convenient hours and the staff has always been great.  Being open until 6 p.m. on weekdays is really helpful; the extra hour makes a big difference.  My two cats regularly see  Dr. Haroldson and both have seen Dr. Erickson for injuries/infections. \n\nI've had no trouble making appointments for regular check ups and vaccinations.  When either cat has had unexpected problems (eye infection, infected cut, etc.) they've been able to get me in within a day, although I was not picky about what vet I saw.  Both Drs. Haroldson and Erickson have patiently and carefully talked me through what I needed to do for home-care and answered all of my questions.  I've never felt rushed or talked down to.", "type": "review", "business_id": "9874O-3GjXPotxYKNNAz5Q"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "uSlKnryLlnD3mvmG6DIyCg", "review_id": "86-dCOqgEn-Qf-9cK8H4HQ", "stars": 3, "date": "2008-06-27", "text": "The Hody is a pretty solid local bar in Middleton that often has great live music and decent drink specials.  Thursday nights feature Westside Andy & Mel Ford, and that is always a good time.  There are decent taps, though last time I was there I believe they had removed Esser's Best which was my go-to every time there.  Most of the specials tend toward the $1 shot variety, but I especially like that Capital pints are $2 on Wednesdays and you can get pitchers of Spotted on Fridays for a crazy $5.  I also learned that your second drink before noon on Sundays is free, and domestic taps are 50 cents.  More on that later.  The bartenders are for the most part good, but if you're there on the wrong day they seem to forget about you in favor of talking with the regulars.\n\nThe food is pretty standard: not too fancy but good.  Sometimes the food doesn't come as advertised in the menu.  Once I ordered a Reuben that strangely was lacking Swiss cheese, though I didn't notice until halfway through as it was still a tasty sandwich.  I like the bison burger here, but the last time I ordered this it came sans tomatoes, likely due to the salmonella issue at the time.  Also that day my sister found the Hody Chicken's buffalo sauce to be beyond her tolerance for spiciness.  My sister's boyfriend was suitably impressed with the Hody burger, but he thought that they had left of the special Hody sauce.  It might have just been a bad day, because most of the other times I've been here there were no problems.  I do believe that the overall quality depends on the day you stop in.  Some of the bartenders kind of throw things together, while others take their time and do a decent job.  I haven't been there regularly enough to establish a schedule, so it's been hit or miss for me lately.  I've also tried a few of the appetizers and the onion straws and quesidilla wrappers are very good every time I've had them.  \n\nThe main drawback with the Hody is the regular crowd.  On Thursdays when Westside Andy & Mel Ford are playing the crowd is great - a variety of people, young and old, some dancing to the music, some sitting at the bar or nearby tables.  Other nights the crowd can get a bit too townie for my liking.  It can be uncomfortable, especially when half the bar turns to look at you when you walk in.  Sundays can be the worst.  I think that some of those people nearly live there.  The place is pretty open and there is a lot of space, but it still can get quite smoky.  There is a few outdoor tables along Elmwood, and these are perfect for a weekend afternoon.  I would probably return to the Hody more if it weren't for the small inconsistencies in the food and the slight hostile feeling that I sometimes pick up from the regulars, but overall the Hody is a reliably good time.", "type": "review", "business_id": "xbJ9tdGbcVJIUkNgHSCwZQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2nMU77JsSdKGprPmS0X8zw", "review_id": "ayrvwOfbnpp533vRMC0iOg", "stars": 3, "date": "2012-12-09", "text": "Stayed at this Marriott while I was attending some training sessions at Epic. \n\nThe hotel has everything a modern hotel would have. The rooms and decor a bit dated, but that maybe because it's Wisconsin???\n\nThe rooms are good sized. The King single, had a king bed, a 32\" LCD TV, ipod charging alarm clock, but a really small bathroom. I did have troubles with the heating during my stay here. It took the engineers two days just to get some heat into the room, and they continuously had to check on it while I was out during the day. \n\nThere is a breakfast buffet in the morning (not complimentary) and this is where you can have lunch/dinner or enjoy a drink at the bar. The bar had a good selection of local Wisconsin beers as well as your typical domestics. Bar tenders were super friendly and made the stay a little more enjoyable.\n\nIf you're a Marriott Reward member, be sure to have them add your access to the concierge lounge. Here they have free continental breakfast, snacks during the day, and a light meal at night. They have some type of honor system bar too in the evening. Also in the concierge lounge, you can use their computers for Internet browsing.", "type": "review", "business_id": "ckLRf3lYn9DxmNxd-mu2yA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0QH_h9h7tWUN90jrJhw1fg", "review_id": "lILxTmms9hCLcCM2GNHqTw", "stars": 3, "date": "2011-08-08", "text": "I like these hotels, and this one as well.  It was very clean, and modern, and the service was great.  I have ranted before about this, but the breakfast is weird.  It is not free, however, it is kind of presented out in the lobby like it is.  It is a buffet, but there is one or two servers running around making themselves seem overly useful to collect tips.  The breakfast is just very confusing, and unfortunately it is like this across all HGIs.  There is my rant....it really is a great hotel.", "type": "review", "business_id": "MBQc_jlZ3nlMOZy7SUM_5Q"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "g8VbmLMCNAuM2sYqYD4syw", "review_id": "0klVfagyY7NxdGNXLcI6-g", "stars": 5, "date": "2012-11-06", "text": "We love this HGI!  We are from the area, and through business acquaintances, have enjoyed many happy hours and dinners there.  They have, and will also put on the Holiday party for my spouse's firm and they do an excellent job.  We are looking forward to the December party!\n\nLast weekend, we had our 31st anniversary and wanted to do something different, so we checked into a jacuzzi suite, had the lover's package and had a wonderful time.  Premiere shopping is right out there door. along with a variety of eateries and pubs.  The staff helped me to get things to the room early so it could be a true surprise--thank you!\n\nIn our opinion, the staff and the hotel are exceptional!  We look forward to many more casual visits and stays!  Thank you to Carl, Chris and Chris the Bar Manger for many great times--and the rest of the wonderful staff!\n\nJ n C  W of the BB", "type": "review", "business_id": "MBQc_jlZ3nlMOZy7SUM_5Q"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "MTpsx3Fi8rL1Ke8dH_1_KQ", "review_id": "15fSUDCBRYh9NxdZm0R2Ug", "stars": 5, "date": "2013-01-27", "text": "Cozy and Comfy. We were shuttled to and from the airport and to Epic. Convenient to a small shopping center and nearby restaurants. Staff are friendly and professional. Each day I came back to a clean room and replenished towels, shampoo, soap and 2 pieces of chocolates. Thanks Esther! :)", "type": "review", "business_id": "MBQc_jlZ3nlMOZy7SUM_5Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "DAYx7CpojTLZ6CJ-X-yCgQ", "review_id": "G-UhbgLHVVGzZ-7DYJe4Dw", "stars": 4, "date": "2013-06-15", "text": "Had breakfast at Three Sisters a few days ago while at Middleton for a meeting.  Very \"down home\" place.  Mexican flavorful dishes along with midwest-country favorites.  I had some eggs and the Mexican hash browns.  Great way to start the morning.  Friendly staff knew the customers and welcomed new-comers.  Patrons here ranged from seniors in high school to senior citizens.  Very congenial.", "type": "review", "business_id": "X47o6R2rWiqGqvBtC7VS3Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "5SzPVOBJKKftliHSZq5Q3w", "review_id": "wLv4zpC3NjS0_ixUf9fwiQ", "stars": 5, "date": "2010-04-24", "text": "Jen Reid is an awesome stylist!  She does such a great job with my color and is the \"brow-whisperer\".", "type": "review", "business_id": "elBgDynz6UPoSqQgxiggJw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "afHt4_EtFFMpDsXW1IfLgA", "review_id": "bZT5B38aTyvsOA6UBZo2Kw", "stars": 5, "date": "2014-02-28", "text": "I started bringing my Audi here about 3 years ago. The staff is friendly and forthcoming. Generally speaking, car repairs suck but the mechanics here make the process here easier. Most importantly, I feel like I can trust them. I never feel pressured to get more work done than I can afford and they take the time to explain the repairs to me and answer my questions clearly and respectably. They are just stand up guys.", "type": "review", "business_id": "O16EckCLtNoA49hewGht_w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aiNWxSrNrRI3cgwbH4vw0A", "review_id": "htx37hVCEdIQf03QfnL77w", "stars": 4, "date": "2010-03-23", "text": "I like this place because it usually isn't very crowded.  There's a Culver's down the street that always has about five times the business as this place.  The burgers are really good, the best fast-food burgers in my opinion (yes, better than Culvers, gasp), and the fries are excellent as well.  The best part is that if you get there at any time other than lunchtime, you get fresh fries.\n\nThe only thing I don't like is how they put mayo on some of their burgers, but they never have a problem with making one without mayo.  Service is always friendly, but sometimes a little slow.  Oh yeah, you should also stay away from the chicken strips.  They're bad.\n\nThe decor here is awesome, with wood paneling straight out of the 80's and cheap plastic booths.  There's even a sterile-looking wall clock on one of the walls.  If you want to reminisce about a time before fast-food restaurants tried to be all trendy and hip, you should stop in at Hardee's.", "type": "review", "business_id": "KFJ1jBfFkRfyn3AoAUl3YQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VtN-LQRkn6gSkyQjyxkkAg", "review_id": "jzV8LG36h41VJ4bugBV6vg", "stars": 5, "date": "2012-01-12", "text": "I've been living in Middleton for about 9 months now, and I'm giving the Village Green five stars for being excellent at what it is: a small, local bar with great service and interesting patrons.\n\nTo us, the Village Green is the place we go when we want to get out of the house for a drink and some company. Once you've been there a few times, everyone who works there begins to recognize you and seems glad to see you. They have a small menu of yummy fried items (Spudsters!), great burgers and sandwiches, and daily specials (love the French Dip on Wednesdays). All the food is cooked right behind the bar, and they keep their cooking equipment impeccably clean. They make good drinks and have a small but respectable selection of draft beers that meet the needs of both craft beer lovers and Miller Lite-types. Bartenders are not afraid to do a shot of whiskey with you, and many of the regular patrons will buy you a drink if you chat with them. \n\nThe Green is owned by two brothers who are almost always there, cooking or bartending. The place is closed on Sundays, and rarely stays open past midnight - it's just not that sort of bar. Go across the street to Hody for late-night drinking. Any other time though, I promise you'll find the company much more enjoyable at Village Green.", "type": "review", "business_id": "G1qUGBNYNS220jKlPAlFsA"}
{"votes": {"funny": 0, "useful": 4, "cool": 1}, "user_id": "-Z6NkbylDRrNxLzcC4m3Mg", "review_id": "qfDcV2rHfKdoWA2_o1SG-g", "stars": 1, "date": "2014-02-28", "text": "Nuh uh. Nope. No no no. My daughter wanted to eat here for her birthday this year, having eaten at the one downtown successfully 4 years ago. Her birthday, her pick. Plus, she delights in the free mug of soda and balloon. She's a birthday sell-out and I think that must be how they suck you in. \nBut, I digress. Our order took an aggravatingly long time to arrive and our glasses remained empty after having drunk their contents while waiting. There was a Packers game on and many of the wait staff were watching that. I don't know if that was the hold up, but it was a bit irritating. \nWhen our meals finally arrived, my children discovered that the insides of their burgers were very pink. Waaaaay too pink for medium well, which they ordered. It was scary pink and super soft--like raw hamburger generally is. When I told our waiter about it, he was completely uninterested in helping fix the situation, and instead, argued with me about it for quite a while, finally saying, \"That's what medium well looks like\" in a tone that suggested that I was simply too stupid to know the difference. I'm not. Finally I convinced him to humor me and take them back to be cooked through. He did so with a smidgen of contempt.\nAs a side-note, my husband's burger was to be well done and was also pink, though not raw.\nStill no drink refills.\nNo one offered a discount, a refund, a free soda while we waited, and especially not an apology. Obviously we won't be back.", "type": "review", "business_id": "6oDZ78JiSKjXVLcurCpnhw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "2lDxT5vQAKH_EPPbxAACBQ", "review_id": "WzK009V5QtQUVuemDFQz-A", "stars": 2, "date": "2012-09-27", "text": "it was okay.....small place but the food was good....large portions....", "type": "review", "business_id": "q8fD82us6uuGufvI44NoAg"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "xcuxY7TjWZtF5XqGYvEBVQ", "review_id": "9BcptkO2TC2qnVfv1bi80Q", "stars": 1, "date": "2009-01-26", "text": "The wait staff were non-existent, the food was atrocious, the mixed drinks weren't drinkable, and the atmosphere was filthy. What more can I say? Ick.", "type": "review", "business_id": "Nj0vQjUYjaa7qbvZlEr2jQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "7RPQOurtiDWjKNILE9bu1g", "review_id": "CV5N1WcDWmzS_kGfhIo3bQ", "stars": 1, "date": "2011-12-31", "text": "Worst service ever.", "type": "review", "business_id": "pwHZ5uUB3cWis9O-L__hdA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xcuxY7TjWZtF5XqGYvEBVQ", "review_id": "7LQDN7c58tS4dLSGc_4sGg", "stars": 1, "date": "2008-02-26", "text": "First, the good stuff: the staff are really nice.\n\nThat being said, the units are ghetto. Burglars smash and grab in broad daylight. Domestically violent neighbors require police assistance in the night hours. The door locks are a joke. Snow removal seems to be done on an \"at will\" basis. Units haven't been renovated in decades, aside from the incidental balcony that needs to be brought up to code -- seriously, is this carpet original? The water literally takes 5min to rise in temp from frigid to lukewarm, and another 5min to rise to shower temp. All the sockets are so old and worn-out that plugs fall out under their own weight -- WTF?\n\nIt could be worse I guess. I could live next to a crack house.", "type": "review", "business_id": "wVFxEPUy0Pcjr4GI5Cbr4Q"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "Hbq7RBmUFmg-zNSKRkMOnA", "review_id": "bpPhkVBT9pFWXfdnJVMbkw", "stars": 1, "date": "2013-12-17", "text": "1)  The customer service at this store is terrible.  The employees are rude, particularly Scott who works in the plant section.   \n2)  The plants this past summer were infested.  I had to return two mandevillas because of aphids, and Bruce gave me a hard time about refunding me.  Last straw:  the $50 rubber plant I purchased in August came home with some time of mite infestation, I was able to treat the plant successfully, but recently noticed that the plant was ailing.  Upon close inspection, I noticed it was full of aphids.  Disgusting.  I am fortunate that my other plants, which came from different nurseries, were not infected.  Rubber plant went in garbage, and I will never waste another dollar at Bruce Company again.", "type": "review", "business_id": "vknZxEFCHOMidG0OJKYekA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UJBLaPAI7mL60OCZnld5TA", "review_id": "iHGa7vWjKzmsx2LHxmWKDA", "stars": 4, "date": "2008-06-09", "text": "I went on a tour of several breweries last summer and Capital Brewery was one of my favorites. The tour guide was EXTREMELY annoying (very, very peppy) but the tour was still pretty interesting. The best part was the end. The brewery makes several excellent beers (they were rated as the #1 brewery in the US by someone, sometime). I had never been there before but we stuck around after the tasting and ended up right in the middle of an enormous party! Apparently all of Middleton comes out on Friday night after work to relax and have a good time. They don't serve food but several people brought in picnic baskets and I saw a few grills around. Fun place to hang out with friends, I'll be back sometime.", "type": "review", "business_id": "Wn8NhS-L1ck6jbTjX88Kkg"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "3AJI55A0sQL5v9R4_z6ueA", "review_id": "WWwJnxyLKnSkVpBvKS46Sw", "stars": 4, "date": "2012-10-10", "text": "My mind is too often my enemy. Too frequently, when thoughts of something 'inexplicable' or 'unpredictable' come to mind, they're most often associated with negative circumstances. An 'inexplicable' string of bad luck at the craps table. An 'unpredictable' severe weather pattern. It's human nature to associate things that we can't predict or control with the negative.\n\nBut once every blue moon, something inexplicable happens for the good. Such was the case with me stumbling upon Capital Brewery in Madison, Wisconsin - a festive,  local beer haven surrounded by sprawling suburban retail strip malls and chain restaurants. \n\nI only had an hour to kill before a wedding, but that hour was filled with bonfires, live music,  locally crafted dopplebock and conversations with the most knowledgeable beer lovers I've ever met (they know the Brooklyn Brewery folks on a first name basis). \n\nI'm not sure if Capital Brewery is always this way, but on this day, it was inexplicably, unpredictably and unexpectedly welcome.", "type": "review", "business_id": "Wn8NhS-L1ck6jbTjX88Kkg"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "vUiLO-EfTnPzfDuhJMF_rA", "review_id": "_CKiiEnqAoxQRisN6Sxhmg", "stars": 5, "date": "2013-11-27", "text": "My wife's Mini Cooper had to have its engine replaced. She no longer felt comfortable driving that car. We visited Nissan, Honda, Toyota and VW dealerships and ultimately had the best experience with Zimbrick VW in Middleton. Otto was very helpful. He was not pushy and gave us all the information we needed to make a decision.\n\nZimbrick made a very fair offer to trade in the Mini but we ended up selling it ourselves. Once my wife's car was sold, Otto made the process very quick and easy so we had her in her new Passat the same day. He even stayed after closing to walk her through setting up her new car!\n\nWhen I replace my Toyota RAV4, I will definitely consider Zimbrick VW.", "type": "review", "business_id": "uyp8kpTXKfKXvAB8HdJSAA"}
{"votes": {"funny": 0, "useful": 4, "cool": 0}, "user_id": "jqMa8QhylASA1HT_CG9RyQ", "review_id": "jaVHi9aTdvl3g3P7FKH_VQ", "stars": 2, "date": "2009-06-24", "text": "I don't know what it is about this place, but they are slooooooooow. The food is adequate (please don't lecture me about fast food, why are you even reading this review?), but sitting at the drive-in will shorten your life. Or maybe just feel like it. \n\nI prefer some of their stuff to McDonald's (yes, I'm very discerning) but just cannot abide the wait.", "type": "review", "business_id": "3zD6rxB92Mr0jb-LoYFFWw"}
{"votes": {"funny": 4, "useful": 1, "cool": 1}, "user_id": "GIe3fZlWKtnPXTaGqmwl-A", "review_id": "A7VKCrgeGoFUyJOzCVu79w", "stars": 2, "date": "2013-04-26", "text": "What has the world done to the people in this place to make them hate life as they do?  And why does that translate to the mediocre food?  \n\nYou can do better for pizza.  Hell, practically across the street from this place is Salvatore's.  You'll spend a bit more, but it'll be worth it.\n\nThis place slaps grease and cheese on cardboard, wraps it cardboard, and hands it to you with a look on their face that plainly says, \"I should have listened to my teachers in high school.\"", "type": "review", "business_id": "OC8AUJshLVimn_-P_INvJw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "StCV2TbWOuHlvHqKmDdmDQ", "review_id": "cYsrFnnrqKsLuF1dNLvpHQ", "stars": 5, "date": "2009-09-04", "text": "Best chinese I've found so far. Hot and sour soup and their won ton soup are fantastic. Sometimes I'll go and just get the soup.", "type": "review", "business_id": "NDAxF0_RCZBQedVO_d5WnA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YLtDeDZjV6oOTyxy1lRbdQ", "review_id": "e-N-2u49WVSXGAN8mPhaqg", "stars": 2, "date": "2010-08-19", "text": "Meh. It's okay when you want something quick. Not overly impressed. Fried rice is good.", "type": "review", "business_id": "NDAxF0_RCZBQedVO_d5WnA"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "6kp815UUjK--ukUjmDlSCQ", "review_id": "Z0qLdbZSdpu8juvpWKVY-w", "stars": 1, "date": "2013-01-17", "text": "We went here on a Saturday afternoon and no one was at the front counter.  It's obvious that this is a small mom & pop type operation, which is encouraging because this usually means good food.  But we wouldn't know because no one ever came to the counter.  \n\nThere was one couple at a table eating, but no other customers at the time.  There was a dude walking around in the back, he looked right at us, but didn't acknowledge us in any way.  \n\nWe stood there for quite a while and looked over the menu repeatedly, hoping that at any moment someone might come forth and say something as simple as \"I'll be right with you\" etc.  Didn't happen.  \n\nI get the whole idea of them not being fast food, and that good food takes time so on and so forth, but that shouldn't also mean \"we will not acknowledge your presence.  Ever.\"  \n\nThree more people came in behind us and proceeded to wait.  There were then five of us crowding around the counter................waiting...................and waiting...........\n\nHere on Yelp I noticed that one complaint had a response from the business, which gives me some hope, but hey guys, I was there, with money in hand and you dropped the ball.........again apparently.  \n\nWe walked out after waiting a longgggggg time for nothing.   We may try again some day when we have absolutely nothing better to do.  However, if this is standard operating procedure I don't know that they'll still be around for that \"some day.\"", "type": "review", "business_id": "eptljN50_4BpIwc2Op_A_A"}
{"votes": {"funny": 4, "useful": 2, "cool": 2}, "user_id": "Iq9bCnyeB6HASXOouyhLLA", "review_id": "IKwqSgdyh7AQDtfDGCs6Dg", "stars": 1, "date": "2011-04-20", "text": "Blech.  My brother heard this was the best Chinese buffet in Sun Prairie.  Maybe that is true, but it must be the only Chinese buffet in Sun Prairie.\n\nI'm not giving it a hard time for \"authenticity\" or any of that eaither.  I love me some good Americanized, crappy Chinese food.  Here, even the stuff that was out fresh from the kitchen (which was mighty slim picken's) was barely edible.\n\nI was really looking forward to some good old MIdwestern Chinese buffet, too.  The Chinese food options in Portland are actually very lacking, the last really good stuff I had was from a strip mall in Crawfordsville, IN.  Seriously, they can do it right but everyone else serves lukewarm, tasteless piles of mystery?  Gotta be kidding me.\n\nMost options seemed to have been sitting for way too long when we got here, and it was peak dinner eating time.  I should have been tipped off by the low number of patrons at this \"best Chinese\" but I like to give the benefit of the doubt.\n\nYou are better off making Ramen noodles at home and calling it chinese food.", "type": "review", "business_id": "5uxhIGZlJm9g_zfG_83z5Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T1Ju5Uin6Ja3iki17ME6fA", "review_id": "e35h7d4vQq7DdY3CeFok3w", "stars": 5, "date": "2012-09-05", "text": "Best gym in the area.\n\nI have been a member of 3 different gyms in the Madison area and none have impressed me like Prairie Athletic Club. The facilities are clean, staff is friendly and efficient, and they have great equipment!\n\nI love the different workout areas - there are several rooms with cardio and weights equipment so you can find your favorite spot, or rotate through them all of a change of scenery. There are several pools, both indoor and out, saunas in the locker rooms, and a hot tub.\n\nThe group fitness classes are offered at several times throughout the day, so it's easy to find a class & time that fit your schedule. Classes are only included with the most expensive membership, but it is so worth it. The membership is very affordable, especially compared to other gyms that I've tried where you get much less for almost the same price.", "type": "review", "business_id": "h_lhVizdHBJOVNAIgTB3eQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "4Zbk-mQQiy93qv2qqKqUMw", "review_id": "dNjMNKfgfF1HRWBGo5W5XQ", "stars": 4, "date": "2010-12-26", "text": "Stop here! Buy a block of the dill Havarti and try a bunch of samples. I am sure there will be others that you love :)", "type": "review", "business_id": "jpxlSFhdrtbNyxS6vB036A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Bi7FeOkZ37ceBioYHWnBVg", "review_id": "KfUb8PofytcnuOLEKHrhTg", "stars": 5, "date": "2013-04-22", "text": "Free samples of cheese, cheese spreads, and fudge! As good as it gets! \n\nI love this place. We bought about $15 worth of cheese after being pampered and trying about 10 different types of cheese, 5 types of cheese spreads, and 2 types of fudge. \n\nThe store has tons of Wisconsin favorites, which I suppose is in part of attracting tourists to think that they are purchasing purely \"Wisconsin\" delicacies!", "type": "review", "business_id": "jpxlSFhdrtbNyxS6vB036A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "CBz3J2zFpWvwZioEv4oc6Q", "review_id": "2KbSGEr4ftzFcmqPgOe1lA", "stars": 5, "date": "2009-09-14", "text": "Love the drive-through concept (SO much better than Starbucks or McD's!), the coffee, the smoothies and the stickers!  I have a little collection of them.  The staff are always super friendly and patient while I'm making up my indecisive Libra mind.\n\nEdit: they were also extremely accommodating when I picked up coffee there with two vegan friends.  They have a lot of non-dairy, soy-based stuff for the vegans and lactose intolerant among us!  Just one  more reason to love this place.", "type": "review", "business_id": "0ilWo2kWlmP_Nv-P2rcNOA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "GuC8C0jc45fCYrnvh7s8zA", "review_id": "WLbp-pGeacVTUhD_C275oA", "stars": 4, "date": "2010-10-12", "text": "A great alternative.  Nice work.", "type": "review", "business_id": "0ilWo2kWlmP_Nv-P2rcNOA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Dzc2m6O4vaXCF4ztKPjTcQ", "review_id": "GpG1uwlm_sdlOUnjkABX-w", "stars": 4, "date": "2011-04-20", "text": "There service here is AWESOME.  I love coming here mainly for the service.  I don't have a favorite drink, but \"Mocha\" is a place where you can be comfortable enough to ask what a particular drink is and you won't get a snippy answer.  So I always try something different and I've liked every one of the drinks I've had.  I'm excited to try their iced drinks now that the weather is warming up.  \n\nI also like that you can now get a little treat like muffins or different breads.  When I'm in the mood for a coffee and sweet treat, they always pop into mind.", "type": "review", "business_id": "0ilWo2kWlmP_Nv-P2rcNOA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ht43WIt1vNIaodW-u8Xxng", "review_id": "5y49Pki38jyiFtj-nbCRkw", "stars": 4, "date": "2012-10-30", "text": "Pretty good for takeout. The meat is more sound than usual Chinese take out", "type": "review", "business_id": "oX6KamASYXnMIe5kpVhezw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XE-EtNY1ogC6XdLYhYVVFQ", "review_id": "8REkrU4i_UHPB9t5yFGvNA", "stars": 4, "date": "2012-11-01", "text": "My daughter and I stopped in last night for the first time.  I had the Chicken Chop Suey and she had Sweet & Sour Chicken.  We started with an order of Steamed Dumplings.  The dumplings were great.  They had a lot of meat in them.  The Chop Suey was made with a white sauce.  I am used to it being made with a brown sauce.  That did not matter as it was delicious.  The S&S Chicken was wonderful as well.  The S&S sauce that came with it was not laden with all that bright red food coloring.  Very tasty.   She also got an Egg Roll.  It was huge!  We had to split it.  Niiice.  And, even though you order and pick your food up at a counter, the service was great.  I ordered a Chicken Lo Main to go for my son and she asked me if I wanted them to wait a bit before they cooked it.  I like that!  That tells me that they care about our experience after I pay them!!  A plus!  We've passed this place up numerous times.  Not any more.  We'll be back!", "type": "review", "business_id": "oX6KamASYXnMIe5kpVhezw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mUthuPTsJgTdmvwYm0aGyA", "review_id": "SGDl0PuO4AKziL6w9zN_KA", "stars": 5, "date": "2010-12-16", "text": "I love Bongo.  Staff is very knowledgeable and always helpful.  Movies are cheap, especially if you go with the bongo bundle or the prepaid card (I forget the details, but I think it's something like 10 movies for $24 or so).  I prefer Bongo to Netflix because I feel I end up getting movies that I'm in the mood to watch.", "type": "review", "business_id": "NxxplxNZnrNEYXHTgv9h8g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "gDbRpS5KWr1uszRH2AEJvg", "review_id": "rK_C6Q-9Vf5sNQiV3YYXDA", "stars": 3, "date": "2006-03-14", "text": "Used to be a fabulously affordable restaurant with good food, too (and a nice vegetarian plate selection). Then in they suddenly printed new, fancy menus (minus the vegetarian listing), jacked up the prices, and decorated the place up a little more. After that the food didn't taste as good and the service became lackluster -perhaps forgiveable if not for the price increases. Our little group of Laredo's fans was heartbroken.", "type": "review", "business_id": "S4TWo9X6b3gU6uucj4JN3g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uhsQFs68oZHrKVMPinwfrQ", "review_id": "r-nLK5TEZAREjLUeR-cG5Q", "stars": 2, "date": "2011-08-12", "text": "this place is truly awful. the sole reason I come here is to play volleyball... their outdoor sand courts are the only saving grace. they have a terrible beer selection and the majority of their patrons are complete douchebags (read: fat, shirtless guys and snooki wannabes). the parking lot is ALWAYS full, and people seem to think it's cool to park other people in rather than park on the street (and the bar seems ok with this). if you aren't coming to play sand volleyball, don't bother, seriously.", "type": "review", "business_id": "qQvpS262VPEHKZvM6j5uhQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "e__OnblYcyTHxOIA-aTGhQ", "review_id": "zV98VjgDPsFyEs6J3_0Ciw", "stars": 5, "date": "2013-10-05", "text": "Purchased a groupon for this place.  The service was excellent and the deluxe prime rib sandwich and the chipolte burger were fantastic.  You can bet we will visit again wifalsethout", "type": "review", "business_id": "qQvpS262VPEHKZvM6j5uhQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "PFtbOIt89VdJB6OLLNaEGw", "review_id": "23pADIQrF1yizxO2WRXM8g", "stars": 3, "date": "2007-10-04", "text": "Nothing spectacular.  The crab cakes were ok, could have been better but then they could have been much worse.  I decided to venture out of my comfort zone (meaning not drinking wine) and had one of their specialty drinks ... Cheeseburger in Paradise (from the web menu \"An island sized, award winning signature drink that will change your attitude. Layered with Parrot Bay Rum Pia Colada, Myers's Rum Runner, Margaritaville Margarita and Strawberry Daiquiri, each frozen layer is prepared from scratch with fresh fruit and juice, and surrounded by an ocean of Hiram Walker Blue Curacao. Garnished with the Hemisphere Dancer (\"HD\") and your own personal Cheeseburger In Paradise.\")  Not as huge as it sounds (thankfully) and surprisingly very good.   \n\nAs for music, they played the occasional Buffett song and at 7:30PM tonight, there was live music.  \n\nI had started my evening looking for a local eatery, but after driving almost 40 miles (back and forth) to get cheese curds (more on that in my next reviews) I choose the first place that looked remotely interesting.", "type": "review", "business_id": "1hBOR97oX5Xph3J8Tdob7w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Au8zxtMKpouKEfG0GnXo-A", "review_id": "BbdccaSTtEqyJbVxC5HHXw", "stars": 3, "date": "2011-04-07", "text": "During a business trip in Madison, we scoped out some places to do dinner afterwards. After browsing a few online menus and seeing that this place had pitchers of Sangria, we decided to give it a try. \n\nThe experience here was pretty middle-of-the-road. It was a weeknight, and not very crowded, so we had no problem getting seated right away. \n\nWhile the decor and the environment is a bit much to stomach, I honestly enjoyed my cheeseburger and drinks. I would not go out of my way to come here, but if I'm in the area and felt like a cheeseburger, this place would be on the list.", "type": "review", "business_id": "1hBOR97oX5Xph3J8Tdob7w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "QP-MdjpUFejr9apuAWcfQg", "review_id": "2BQzXYtcL3ukyEL3_BSQGg", "stars": 2, "date": "2008-06-21", "text": "Gave it four stars last time.  Food and service has gone down hill since then.  The specials are absolutely atrocious and old standbys we used to like are lower quality.  Skip this place.", "type": "review", "business_id": "ybkWtM1ZnT2ewuquj3A9KQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "voycezivSEz1LiGI3bpLuA", "review_id": "VqopiNaCVm9nMZ4kctE5VQ", "stars": 1, "date": "2013-03-03", "text": "Poor food handling practices!!! I was really excited to try this place as the reviews were excellent. Major disappointment! We arrived just before noon and the place was really busy. They were still serving breakfast but we were interested in lunch. We asked our server to see what the lunch menu to see all our options and she seemed annoyed. We ordered a couple of beers and they were prompt but not really cold. While we waited about 30 minutes in order to be able to order lunch, we had a lot of time to observe things. I was appalled to see the filthy salt, pepper, ketchup, and mustard containers. They looked like they had never been washed. I also watched the bartenders clear dirty dishes off the bar, then dig their hands in the cherry jar. The last straw was watching the woman cooking touch a handful of raw hamburger patties and then immediately touch the buns on the grill. Last I checked, those practices could send someone to the hospital! We will not be going back!", "type": "review", "business_id": "zAsxPh3h9xMQnSDGl41kSg"}
{"votes": {"funny": 1, "useful": 3, "cool": 3}, "user_id": "uSlKnryLlnD3mvmG6DIyCg", "review_id": "cgQ4qPIkk3VmVhUc-CgyRg", "stars": 5, "date": "2008-06-27", "text": "New Orleans Take Out is all around greatness.  I absolutely love this place and everything on the menu.  When I was a kid the best times were when my father would take an afternoon delivery to the east side and swing by NOTO on the way back.  It was always such a great surprise when my sister and I would be called in for dinner, and right away you could smell those spices!  Those are some of my favorite memories, and to this day I get a rush of excitement just walking in to the place when I get that first waft...  It really is the best outside of the Gulf.\n\nI really can't even start on what my favorites are because every time I pick something off the menu it becomes my new favorite.  The po' boys are without exception great.  The roast beef was my first love, and I keep coming back to this one.  The French bread is perfect - crisp and the perfect texture for the sandwich.  It took me a while to try the fried oyster po' boy - I was not so adventurous as a kid - but after trying this I see why this is my mother's favorite.  The Gulf shrimp and the fried chicken are incredible.  This place is a 5 star easily on the strength of the po' boys alone, but the rest of the menu is not to be skipped.  The jambalaya is great for those that can't take too much heat, and even better with a bit of Tabasco for those that can.  The shrimp creole - HOO BOY!  Spicy but not excessive, it has enough heat to get you sweating and the flavors are spot on.  Same for the shrimp etouffee.  The red beans & rice with double sausage is my all-time favorite comfort food.  Most of the time I can't make up my mind, so I hit up the Mardi Gras combo, which gives you all three.  Perfection!  And it all comes with a piece of cornbread to finish it all off.  \n\nI've only been to the Fordem location, though there is another on Monroe Street.  I'm certain that had I not graduated prior to this location opening I would have made it a regular destination.  As it is, I love coming down Sherman then Fordem, and you're suddenly right there looking at the mural on the side of the building.  I call ahead whenever I plan to stop, but about half the time it is straight up impulse that brings me there.  No matter whatever else happens that day, it's always a good day if you've been to New Orleans Take Out.", "type": "review", "business_id": "cpGv6ES2hzPCtCUQgipwXw"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "OtpHvQFGbZ4sONaQAXankg", "review_id": "LlK1KNH-C9x95_UA5g8NiA", "stars": 3, "date": "2013-08-07", "text": "Pedro's really only deserves two stars, but more on that later.  Don't come to Pedro's in search of authentic Mexican food.  But there are some things on the menu that are perfectly fine should you find yourself here for some reason, at a loss as to what to order.  I would suggest avoiding most of the menu, which is essentially Tex-Mex T.V. dinner-type fare, except with molten cheese-drowned portions that could feed a T-Rex.  I would suggest, instead, the carnitas fajitas: the pork is very tender and flavorful, and the sauteed vegetables are tasty.  Not authentic--but perfectly fine.  They do have a good Tuesday/Thursday margarita special, though the drinks are too sweet for my taste.  I met my S.O. at Pedro's: hence the extra star.  It will always have a special place in my heart, and I'll keep coming back most Tuesdays for trivia night.", "type": "review", "business_id": "wPidHd5FxspPRgVqdEQ-Xw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "T18s3Kau2SU78kxNSo_SqA", "review_id": "oOdxd-D1NOqrd0hv3y3oLw", "stars": 3, "date": "2014-01-05", "text": "Food is ok. Fajitas were pretty good. Enchiladas left much to be desired. Service is ok, kind of slow especially if you have 8 or more people. Table is served the standard chips and salsa. Also served fresh tortillas and butter which I have never seen anywhere else and were very good.", "type": "review", "business_id": "wPidHd5FxspPRgVqdEQ-Xw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-hwN2juKYn-KTxa2WBYLnw", "review_id": "8sateabad7g2sH0rsPIqMw", "stars": 3, "date": "2011-03-06", "text": "I am sorry to hear about the bad food some people had here because we have never had a bad meal here. (update, just had a bad meal here.  The shrimp dinner.   one of the worst I have ever had.  They do fish so well but their shrimp was over breaded popcorn shrimp that did not have that country specialness that you expect from CB.  The hushpuppies were also dry and flavorless.)   I have had very good trout and also a very well done steak.   It fits into a narrow country recipe selection but when you are in the mood for that you can't beat the price and the quality of food.  Service has always been good, the environment is pleasant and there is plenty of room.  The bathrooms are very clean.  The gift shop has something for everyone.  We almost always find something and they don't particularly cater to out taste.   In the midst of country craft, bible baubles and kitchen kitch (is there such a thing?)  we have found some nice decorative items, ornaments, candy, and other gifts.\n\nFound a hair in an egg and they immediately remade the entire meal and the manager came out to speak with us.   Good and appropriate recovery.   My pancakes this time around were not as flavorful as the last.  They were still good. \nOn a cold winter day get a seat near the fireplace and have a nice home cooked meal.  The coffee has always been good too.   It isn't fancy stuff but still good.\n\nFolks here are almost always very pleasant and talkative.\n\nUpdate: The French Toast was nothing special.  Third meal I have had here that I didn't care for much.  Avoid it.  Ham was so-so as was the smoked sausage.  Not a good breakfast for me.   Coffee wasn't good this time either.   Staff continues to be great. \nI would suggest the management review all their dishes and step them up a notch.   The meals are underpriced.   Maybe this is leading to less quality dishes.  Stop this.  Raise the prices and improve the quality.", "type": "review", "business_id": "QF14BFUVHRODxGNVflgm3A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "A0TbZ6rVVrPxiLQQDApQcA", "review_id": "xDD8I3RC3995-Llz5DBpmA", "stars": 5, "date": "2012-03-22", "text": "This cab company is the best in the city in consistency.  Consistently polite, clean, reliable, and safe.  I heart Union Cab!", "type": "review", "business_id": "5TQQy_x_ArR3_5L5L0fFVQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VZ7DmRPKsQVJzxxaW4eosQ", "review_id": "yPvsQm1ilJyxRUi43bT4EQ", "stars": 2, "date": "2009-05-14", "text": "I stopped here on the way to my hometown from the airport one of the last times I was in the Madison area. I'm normally a huge fan of the Wisconsin Swiss Melt, but the one I had here was not so good.\n\nFirst, the sandwich was exceptionally greasy. I don't think I've ever had a patty melt-type sandwich that was that greasy in my life. Yeah, I understand this is a joint that specializes in butter burgers, but this was extreme, even for Culver's.\n\nSecond, the size of the burger was pathetic. Admittedly, I've been out of Wisconsin for a few years now, so maybe my recollection of the size of Culver's burgers isn't so good, but the patty on this particular sandwich was seriously thin, and the burger came no where close to covering the bread.\n\nIf you're just passing through the north side of Madison and have a sudden craving for Culver's, I'd suggest you keep going and stop at the location in Waunakee or the location near East Towne Mall, depending upon which direction you're heading.", "type": "review", "business_id": "q83uB6EGF6y2MuR-7VZPRg"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "zee7YpFdx96E2sOUgj7F-Q", "review_id": "UtxruOeT-M7j-8HexyP3vA", "stars": 1, "date": "2012-03-11", "text": "This Culvers gives Culvers a bad name. Ive had excessively slow service, hair in my ice cream and burgers that resemble dog food and that's enough for me. Ive never quite seen a burger paddy so thin and greasy before in my life. You've  got to be desperate to eat there.", "type": "review", "business_id": "q83uB6EGF6y2MuR-7VZPRg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4bsu8DLfDkBV84RKn6UmcA", "review_id": "FZn4XhoHDHwSo_viS_K77Q", "stars": 5, "date": "2009-08-29", "text": "Quick, friendly, helpful service. Love how they have all their repair/installation/service prices posted. Somewhat limited, but quality inventory. Love the cat roaming the establishment too. Any establishment with a cat gets a star automatically.", "type": "review", "business_id": "QMWdcByvCYCrs7-IQyr26w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nqs6Avj7bfyavMUHO0XVBg", "review_id": "mejovfnfYshfksnNxjeOhQ", "stars": 3, "date": "2010-07-04", "text": "I'm still not sure which way to pronounce it, but if you want to meet some real-life northsiders- this is a good stop. And it's not too far away from downtown. Some people say their bloodies are unstoppable, but I didn't love it.\n\nThe decor is definitely influenced by NASCAR and NFL, and they also have a pool table and dart board - with a fireplace. Probably a great place in the winter", "type": "review", "business_id": "hUS4D74YDHobcggC4-YMqw"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "avPELmgrt_GVzuIUdeuIfg", "review_id": "-VtvYCNNHN7ULYtCuabfrg", "stars": 1, "date": "2011-05-22", "text": "A wash may be better priced than others but you'll get what you pay for. My husband brought out 2008 Prius for a wash and vacuum and it doesn't look like anything has been cleaned! The carpet in the hatch and floors are still dirty and none of the interior was wiped down. We will be going to Octopus or we'll just do it ourselves next time.", "type": "review", "business_id": "MFANntSgzNkjStqgB2xtHw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "hrnSxGti9HOHxG2UaPz1rQ", "review_id": "TZR17v3YYMitJt4ltWUhSg", "stars": 1, "date": "2009-10-30", "text": "My folks love this place and I can't imagine why.  I had the chicken wrap and it could not hold a candle to the wraps at the Great Dane.\nThe fries are so overly seasoned they are almost impossible to eat without a huge glass of water.  Don't go there.", "type": "review", "business_id": "JdCFcgw4yk4M1ZRhAhBIag"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "aOyQjWtTSvH1oibZILRDvw", "review_id": "6btyFKduyKjK-8ZPTRhGBQ", "stars": 1, "date": "2009-12-29", "text": "This needs no explanation.", "type": "review", "business_id": "JdCFcgw4yk4M1ZRhAhBIag"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f9wNSAsy9EdZEtxza8mPUg", "review_id": "dMlmcw1Mk4M1mqRyFmmsIA", "stars": 2, "date": "2013-12-02", "text": "I absolutely Love Red Lobster.  I will go out of my way to eat at a Red Lobster for shell fish.  Unfortunately, I have never had a good meal at this Red Lobster.  They do not know how to cook seafood.", "type": "review", "business_id": "v5a-Mj4eO1E--HmgwEWo7A"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "oFhtzLhXS1iENWoBMdWk4w", "review_id": "B1Z0762Q8lE4Ib7p7vmTWw", "stars": 4, "date": "2010-01-22", "text": "Quick Review: If it weren't for the stellar fish fry and the awesome beer selection, this place would be a solid 2.5-star establishment.  Alas, the fish is unreal and the beer selection rivals many (if not most) of Madison's finest.\n\nDetailed Review:\nThe Fish Fry Fanatics stumbled into Dexter's Pub this past Friday and decided to give their fish fry a shot.  The menu selection is vast - we counted at least 6 or 7 solid fish fry options, from shrimp to Lake Perch to Walleye.  \n\nWe put our name in for a table, and were told it would be a 35-40 minute wait, so we ordered some of our customary Old Fashioneds.  We were pleasantly surprised to find that the bartenders muddle their Old Fashioneds, but were disappointed by the inclusion of a huge chunk of orange.  I'm sorry to say, but a Whiskey Old Fashioned Sour should *not* include half-of-an-orange as garnish.  \n\nRegardless, the Old Fashioned was solid - very good, actually.  So much so that when we ordered a second round and requested they drop the orange, it wasn't a problem.  Dexter's recovered nicely, and as luck would have it, our table became available soon after we grabbed round 2 of drinks. \n\nWe immediately ordered cheese curds, salad, and soup.  I went with the vegetable garden soup; others at the table went with chili and salad.  The soup and salads arrived within seconds; the soup was good - not great, but good - and it could've been a little warmer.  I'm told the chili was good as well - not life altering, but good.\n\nThe waiter came back to take our dinner order: two orders of beer battered cod, an order of lake perch, and an order of shrimp.  He said he'd be back in 10 minutes with our fish.  \n\nNearly an hour later, we flagged down a waitress for: refills on our drinks, and to inquire about our curds and fish.  She apologized profusely... curds came out a few minutes later - apparently they forgot about us.  The only benefit to being forgotten was that we had plenty of time to read the beer menu, which features a nice selection of craft beers from microbreweries - Dexter's doesn't strike me as a place that would feature such a wide selection of unique beers, but I guess it goes to prove that you can never judge a book by its cover.  \n\nCurds were excellent - not your typical \"from the bag\" curds, which was a nice surprise.  They were breaded and featured a mild white cheese; they were cooked perfectly.\n\nFish arrived within minutes, and it was well worth the wait.  The cod was phenomenal.  Three huge pieces with a mound of fries - now that's what we're talkin' about.  The batter was light, crisp, and flavorful.  The fish was thick, meaty, and perfectly flavored.  I loved every single bite of it.\n\nI also sampled the Lake Perch and shrimp - both of which were excellent as well.  Huge props to Dexter's for their fish fry - it's definitely a top-10 offering.\n\nIn the end, they also made things good as the waiter comp'ed us our drinks and curds, so we got out of there for under $40.  We tipped well and called it a night.  I'd definitely go back to Dexter's - sure, they dropped the ball, but they did an honorable thing and made everything right by us.  Thanks, Dexter's!!\n\nDexter's = WIN\n\nFood = 4.5 stars (excellent fish; curds and fries were stellar)\nService = 2 stars (they forgot about us, but made up for it)\nValue = 2 stars (would've been over $85 for the 4 of us)\nMisc = 3 stars (the place isn't much to look at, but has an excellent beer selection...)\n\nOh - also, parking is hard to come by, so be prepared to park on the street and/or walk a bit to get there.", "type": "review", "business_id": "HTplzElel_F_U_qhWuDKdg"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "oLFchtcwhj36N0XRWGUKRA", "review_id": "oMm-OgW3TVO2BHnJhx_iYA", "stars": 2, "date": "2011-03-28", "text": "So, I have been to Dexter's before to play some cards a few months ago, but it wasn't until I moved into the neighborhood that I decided to give the food service a shot. \n\n   I ordered a steak sandwich and some fries, it was one of the 3 specials being offered. The fries were decent enough, but the sandwich was bland dry and just quite dreadful, even for a pub. My friend then joined me and we ordered the worst cheese curds I've ever had in my life, and then we had the ironically named \"super\" nachos. The Super Nachos are anything but super. The ground meat (not positive what animal it came from) was again under seasoned and the chips were stale. I thought about sending them back, but I am chalking this up to the back of the house just doesn't give a shit about their job.\n\n   The server was the three P's, Pleasant, Prompt, and Pregnant. She was the reason I will return and give the food another shot, and why this Pub is getting even two stars.", "type": "review", "business_id": "HTplzElel_F_U_qhWuDKdg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "y_FoL3sc9vdjwwzthw8qBA", "review_id": "NBcDVS7yhSMIbM2HMQOreQ", "stars": 3, "date": "2014-06-14", "text": "Dexter's is a nice neighborhood bar with good beer selection, and GREAT drink specials. Always something to drink for cheap. I only discovered this when looking for a place to watch the Stanley Cup playoffs (Go Hawks!). \n\nThe food is pretty mediocre. The pizza is good - they seem to make it fresh. I probably wouldn't go out of my way to come here had I not lived in the neighborhood at the time. The pub quiz seems to be a good pull on Tuesdays, outdoor volleyball too, and the crowd seems fun in general.", "type": "review", "business_id": "HTplzElel_F_U_qhWuDKdg"}
{"votes": {"funny": 2, "useful": 2, "cool": 0}, "user_id": "Nk-itx7fbK6dNgkHlEzbfQ", "review_id": "n-82VUE8GXpOY8J0NEmuNw", "stars": 3, "date": "2012-11-17", "text": "All you can eat for under $10........what is there to complain about?? If you want junk food and you want lots of it oh this is THE place to go! \nYou've got several hungry mouths to feed and  not that much $$ in the wallet....then this is THE place to go.\nOther than that I'm not sure why you would go here....", "type": "review", "business_id": "O5lo-GKCG3cX8X4bh_DR_A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nJqS1Y4svVs0MjgVDeVfpg", "review_id": "pI_nYj01dB6lU9K2JqlILQ", "stars": 1, "date": "2013-05-30", "text": "I had gone to Eagles crest for lunch a few times and decided to take my family, from out of town, one weekend. When we arrived, there was a sign on the front door saying that it was customer appreciation day. We Bought a round of drinks and found a table to sit at. Other patrons were going through the food line which was set up at the pool table.  But my sister-in-law went To get a veggie plate, One of the female staff came from around the bar and slapped the plate out of her hand And told us that we were not welcome there. We finished our drinks and left. As we were leaving we checked the sign on door again to see if it was marked private party, but it was not. After that experience I will never go back to Eagles Crest.", "type": "review", "business_id": "QdSGdvZATzejDkSs435Rdw"}
{"votes": {"funny": 0, "useful": 7, "cool": 3}, "user_id": "lC0KGXmIhyjzghBUlVnkhQ", "review_id": "TbIzIG1X8EVeHzmqyTQOFw", "stars": 1, "date": "2014-06-03", "text": "I usually like to visit a place twice before I review, but there were so many issues with my first visit, it's highly unlikely I'll return. \n\nTo start with, it's hotter than Hades in there! \nIt's a greenhouse. \nIt's summer. \nI get it. \nBut their structure is so small and plants are packed together so closely, that it's really difficult to roam around with a cart and peruse their selection. I felt hot and uncomfortable the entire time, bumping into plants, bumping into other shoppers...\n\nAnd let's talk about the selection real quick, which I was told by multiple sources is the best in Madison. I've since been to several greenhouse and I'm here to tell you, their selection is on par with Felly's in Fitchburg and a few other larger greenhouses around town. They might have a rare item here and there that you won't find elsewhere, but navigating the uncomfortable heat and nearly un-shoppable aisles isn't worth it in my opinion. \n\nAs far as the staff goes, I was pretty bummed that nobody wanted to lend a helping hand when I needed it. I went with a hanging planter and the idea that someone there would be able to point me towards things that would work well on my shaded balcony, but it was like pulling teeth trying to get any answers. And I asked a few folks for their best recommendations, both gave sort of general sort of apathetic recommendations. I certainly could have done some research on my own and gone there knowing which plants to pick up, but for the prices they charge, I think a little knowledge and expertise isn't out of the question. Tell me what I need, tell me how to care for things. That seems reasonable to me.  \n\nI just didn't feel like they wanted to help me or cared to have my business and that's the worst feeling someone dropping close to $100 can have at a business.", "type": "review", "business_id": "a933ecROIB44zhzos11YTg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pv2mIrYhWJOlXvn6d5ZExw", "review_id": "ILJUc5SCn5TjAlmeXoOoww", "stars": 5, "date": "2013-12-14", "text": "Beer selection, meat market and convenience surpassed only by friendly and helpful staff. Produce section vastly proved over the last few years. The anti-Woodman's.", "type": "review", "business_id": "MLD-FXAHLbdiHOcyeoW-Fg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "e4e-IyxRdWBO0Ak88yyacw", "review_id": "wC11DmbJ4jSUaTdQHHzqpw", "stars": 4, "date": "2011-10-03", "text": "This place is huge, and has good food. Lots of different tap beers,pool tables,darts,golden tee, etc. This place can be busy if a Packers or Badgers game is on. Lots of big T.V.'s as well. I like this place during the week when its not too busy.", "type": "review", "business_id": "bAew9nt-tw8YGjjD64gVWQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BqFA2vuPfpbob8_DYSMfnQ", "review_id": "VzX60KUPB7Dv5JeKfrEB9g", "stars": 1, "date": "2013-12-29", "text": "Papa John's is great pizza! Unfortunately, I never had the opportunity to get it delivered. After calling the store I was informed the front door of my residence was past the delivery boundary. My back door is adjacent to the street they deliver to. Didn't matter to the phone operator and never even considered finding a way to make it work. \n\nThe employee's response, \"the boundary has to be set somewhere\" works in theory unfortunately this customer lives in reality. Really disappointed with the service being offered. \n\nI understand there are policies but being 20 feet past an arbitrary boundary is absurd. Thanks Papa!!", "type": "review", "business_id": "7uoxZ35biPZfl8m5w2_XRA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "WDGHEIPGtOfCXNFarC30qA", "review_id": "dzSc6HK1EmyEzY_JgLnnqw", "stars": 1, "date": "2010-09-11", "text": "I would not recommend Joyce for bridal alterations. First and foremost, she is not friendly at all. I put on my dress for the first time since I bought it at her store, and was so excited about it. She made me feel rushed and took away from the moment. Then, she charged me $200 for bad alterations, which I ultimately took to get fixed for $100 elsewhere.", "type": "review", "business_id": "smHuQzYNOkN2CHDjLG8KBA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "-hwN2juKYn-KTxa2WBYLnw", "review_id": "M_UVATSAAsffMgWjxECCRw", "stars": 5, "date": "2011-03-06", "text": "We really like this place.  Cozy, fireplace, really good coffee.  Some nice paintings on the wall but the one is a myth.  It shows Monona Terrace with the sun setting nearby.  ( I think it is the sun- I forget)  Anyway, the terrace sits toward the north and it would be pretty tough to paint the sun there.  Other than that it is a good painting.  The painting of downtown Madison in the rain is fantastic.   I wonder if I could buy that one?\nEnjoy the coffee.", "type": "review", "business_id": "JPFzpR5PvZWqHXQMIZFk2w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "TSMsO7HW5ueBnaIENnXl2w", "review_id": "yxYSBeg0gY9XyXLDvNsvWw", "stars": 5, "date": "2012-07-10", "text": "Absolutely best coffee in Madison, topped with a healthy serving of excellent service. Ambiance is perfect for studying (this is, in fact, my second home), hanging out with friends, reading a book by the fire, or conducting a business meeting. They have an excellent assortment of drinks (caffeinated and not) and food.\nSkip the poor-tasting, cookie-cutter Starbucks and experience some real coffee made by people who actually take pride in their job... and check out the latte art before you put your lid on--they're getting good! :)", "type": "review", "business_id": "JPFzpR5PvZWqHXQMIZFk2w"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C2hVx7POcUGLQZV3hW6_sw", "review_id": "-u8q0z39XYdAdIyFul92dA", "stars": 3, "date": "2007-01-16", "text": "Yeah, it's nice there are a lot of veggie options, but I feel like they are spreading themselves too thin.  No one I went with was really impressed with their food, and the weird thing was that the waitress brought out half the table's food, making a few people wait.  Anyone who's been a waitress knows not to do that.  I do appreciate tempeh, seitan and tofu on menus, but it would be nice if they did it well.", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "SaA0kpMsNDfN_kI1HVK-Xg", "review_id": "-T3royKSmb9OZHRYWxvoJA", "stars": 3, "date": "2007-12-10", "text": "My review would probably be higher, had I not just the other day had one of the worst meals of my life at Monty's Blue Plate diner. My meatloaf sandwich was so salty is almost inedible. At first I thought it was the gravy that had the excessive salt, then I figured it was the meatloaf. After plodding through this sodium-induced nightmare I realized that the whole damn thing was pure salt, like that one episode of the Original Series Star Trek, the one with the salt beast, that's made of pure sodium. \n\nThis place has a varied menu with a good selection of vegan or vegetarian dishes. I would recommend the Palomino or Comet in MIlwaukee, both vegan and vegetarian friendly diners, over this place any day of the week.", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "AUvVtaSCLusTJiTpufZSwQ", "review_id": "S7ScUBfGcizYmKtzyW9TqA", "stars": 5, "date": "2010-09-13", "text": "I've been to Monty's at least once for every meal. The omelettes are to die for, huge in quantity unique in ingredients- highly recommend the spinach and feta. The salads are the same thing, definitely large and delicious. Last night I went for dinner and got the meatless loaf, and now I want the recipe for the cashew gravy (if my memory serves me correctly, it was cashew...) to put on EVERYTHING. Amazing shakes and malts complete the perfect comfort/diner food experience.", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 5, "useful": 6, "cool": 4}, "user_id": "bvJvqYTSnStE8QL5fSJCkw", "review_id": "5M98JjFZSpXzPhGQsMRdTQ", "stars": 4, "date": "2010-12-15", "text": "Okay, I straight up ordered the \"heathen vegans shoplifter's delight\" because of the name.  \n\nI'm not proud of my devil may care attitude when it comes to ordering food, but reckless abandon at Monty's has proven fruitful.\n\nDelightful meal.  Everything about it matched the hippy dippy quarky way of MadCity life.  Service was a shade slow and it wasn't crowded by any means, but I had good company.  Who cares.", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "Uss1qdaOi3P8YjLBo1qyoQ", "review_id": "Z2ZETpHZZHRSq7NnNJcsIQ", "stars": 2, "date": "2010-12-20", "text": "Friendly staff and nice selection of vegetarian options.  Food is just okay, not great.  Makes me wonder why everyone likes Food Fight so much.", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "qpTR-5Ks2cj0tJnwR7UL6Q", "review_id": "b-iZDEnJedUzFkYReVp8yA", "stars": 2, "date": "2010-12-21", "text": "Eh. This place is \"fine\". I'm not terribly impressed with it. I could probably get better breakfast somewhere else. Plus its ALWAYS so so so busy in there. I like that they have a ton of vegetarian options. Which is rare for breakfast places. But meh. Its not amazing food.", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cLi_GrU-Nq0hmUcICMWCBg", "review_id": "q05N3aqpSKh2gJ38IJFepg", "stars": 4, "date": "2011-01-18", "text": "If your vegetarian or not you will LOVE this place...  I think they put crack in their food its so good! I like everything here, but I take it to go.. I hate being the creep lone diner - no Table for One ... There is on weird waiter I must admit but the food is so good .... I like their hash and their tofu scramble ...", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "qOYI9O0ecMJ9VaqcM9phNw", "review_id": "u7B2CgXDrGFTS8-vd_ZgTg", "stars": 3, "date": "2011-02-06", "text": "Service was great and I like the atmosphere but I wouldn't say it's anything special (except for the the shakes and meatloaf - fit for the gods for sure!).", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "g0qtpa3Z5yF1P4mKuU1X8Q", "review_id": "1CwFulzCCGYwAp5o_crQ9w", "stars": 4, "date": "2011-10-31", "text": "One of my favorite brunch spots in Madison.  Good vegan and vegetarian options as well.  I'm a meat-eater and have had one or two of their all veggie dishes and been very impressed (I like the tofu scrambler)  Another favorite is whatever the scrambler of the day is.  Good reuben for lunch too.", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "7D391kOjoqgq5wtQpKpyVA", "review_id": "oEeTu-lBf97tEFUZvzz24A", "stars": 3, "date": "2012-06-18", "text": "Food, decent.   Service, eh.\n\nWe were on the way back from Chicago and decided to eat in Madison.  I found Monty's online so we checked it out.\n\nThe neighborhood couldn't be cuter.  It was noonish on a Sunday, so it was busy.  We waited a short time for our table.  I liked how the person cleaning the table also put the silverware and water down.  It helps turn the tables over quicker and it satisfies those of us waiting.  But don't drink it all right away, you might not get more.\n\nI wanted the egg sandwich, but I also wanted lunch, so I decided on the Roast Chicken, bacon (none for me thanks) and goat cheese sandwich with bean salad.  Dining companion had the Turkey Club with bean salad.\n\nFood arrived pretty quick and my sandwich was excellent!  The bread was toasted perfectly and the chicken was not at all dry and the smear of goat cheese was great.  My dining companion liked his sandwich was well.   The bean salad could double as a chip dip, in fact I have a recipe just like it that I will now be serving as salad.\n\nWhat wasn't great was the service.  The food got dropped off and she never came back.  She was going to bring me more water, but we had with our glasses empty the WHOLE time we were eating.  We never saw her again.  We took out our credit card so if she did swing by she could take it and we could go.  If it weren't for the service we receive I would consider going back.", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 5, "useful": 5, "cool": 7}, "user_id": "lC0KGXmIhyjzghBUlVnkhQ", "review_id": "2mOwSvmsVgxnDfiGevAyCA", "stars": 4, "date": "2012-08-06", "text": "Here's a lil story about SWEET potato corned beef hash. \n\nMonty's will make it for you if you ask nicely. \n\nThe end.\n\nAlright that was the short version for those with an inability to read more than a few lines... here's the lengthier more tasty version! \n\nAfter having some lunchie and being pleasantly surprised by their afternoon eats, I decided it was time to give MBPD a try for brekkie. Holy options batman. This isn't your typical eggs, griddle, sausage type of place. They have some really inspired creations, and it was hard for me to pick between two. The corned beef hash (served with typical white potatoes and the sweet potato hash... more interesting taters but no meat) Hold up, wait a minute, how do you get both? You ask nicely. Really nicely. And low and behold moments later I had a plate of blended potato perfection and some chipped meat. It was rad. Deliciously rad. And served with amazing fruit, not just crappy melon as is typical during morning meal time and the best I'M TALKING THE BEST biscuit I've ever eaten. And I'm a guy who's had a few biscuits in his day, so trust. \n\nNow don't going running over there saying, \"Corey said, Corey said!\" But if you happen to get a nice server and you happen to strike up some nice conversation nicely ask for hot tuber take on their standards. And be nice if they charge you a little more. They're combining two dishes to make you happy after all. \n\nNice.", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VBu-NcNdSfzLT70mz97xQA", "review_id": "uv3SboC2rXWOOQe3jTYYIA", "stars": 4, "date": "2013-07-06", "text": "Stopped here for dinner before going out. Our server was friendly and efficient. The 50's diner motif was cute. Tons of vegetarian and gluten free options if you're into that sort of thing. I had the roasted turkey club and it was tasty. Awesome dessert options too so save room!", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cHHtnBtiItYf-HZ9DPxYgA", "review_id": "Rq7vq8qaFtgFFjEsPjPw0g", "stars": 5, "date": "2014-05-07", "text": "Monty's Blue Plate is a local gem.  Expect unique menu items that focus on tasty, healthy, and fresh.  They have things like burgers that you would expect at any diner but they do their own unique spin on standards.  My latest meal was a burger with carmelized onions, herbed goat cheese, and spinach..  Sooo good.  They are also sort of famous for their bean salad - even my two year old goes for that one.\n\nAfter your meal you have an array of some of the best cakes and pies.  Their carrot cake is the best I have ever had and sometimes we will go there just for that!", "type": "review", "business_id": "fjaQ3Ixkofh8xGhklUtDnA"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "dh1ZXGKbT3tRcDH1Tr-_cQ", "review_id": "RST-8aKbwlBwMZqpcSzQ2w", "stars": 5, "date": "2013-05-20", "text": "Inviting, comfortable, quite, homey, elegant, and friendly are words that come to mind when thinking of our stay at the Speckled Hen.  \n\nMy wife and I came here for our anniversary and we were not disappointed with any aspect.   Upon arrival we were met by the Inn Keeper, Pat who gave us a warm welcome and brief tour of the gust areas and our room.   The guest area, or as they call it, the \"gathering room\" is very warm & inviting.   Here you can sit to meet with others, read a book, select a wine, or enjoy complementary drinks such as coffee, tea or soda with some light snacks available as well.   The freshly baked cookies are awesome.    There is also a computer to use if you wish and there are several binders and folders with local attractions or restaurants to try out.   \n\nOur room, the \"Madison Lakes\" was outstanding.  Large, and outfitted extremely well. You will not be disappointed.  There is a king sized bed, a gas fireplace, nice sized TV, with good cable channels, or use of a DVD (you can borrow DVD's from the gathering room), free wifi, a small fridge, sink, and two comfortable chairs to melt into.   The bathroom is ginormous, with a large whirlpool tub, a huge walk in shower complete with steam and rainfall shower head, all of it being very nice.   \n\nThe grounds of the Inn is really a small farm, with fruits, veggies & fresh laid eggs that find their way into the ingredients for breakfast.    Around the far there are several trails to use, winding you past the barn, sheep, a lama and various beds for wild flowers, herbs and vegetables.   \n\nAs my wife and I walked the grounds and headed back to the Inn, we passed a good sized gazebo which seemed to beckon us in for a look.  Inside there are a few comfortable chairs, wine cooler,  a DVD player (with aux connections) and some wine glasses just waiting to be used.   We sat in there for a while and we actually had plans on going out on the town.  However, this entire scenery before us was extremely relaxing... the woods, birds singing, farm animals grazing about, all made for an extremely, wonderful  relaxing environment we simply could not walk away from.   So, we concluded our evening by enjoying ourselves in this tranquil environment accompanied with some wine.    Ahhh... a very memorable time which we shall cherish for some time to come.   \n\nAfter a sound sleep and outstanding shower, we headed to breakfast where we dinned with two other couples who clearly were enjoying their stay as well.  The breakfast freshly made by the Inn Keepers, Pat & Bob, is made up of several courses; fruit, scones, beacon and eggs, all of which was eaten with delight and a perfect ending chapter of our stay at the Speckled Hen Inn B&B.  \n\nThe attention given by the Inn Keepers, Pat & Bob is perfect.  They have really taken care of many of your needs in advance simply by setting up the Inn & Grounds really well.  They are both attentive and engaging while at the same time not being overbearing.   They really do have it well balanced!   \n\nObviously, my wife & I will be checking back in here again.  So, if you are looking for a place to get away from to unwind, (which is only a short drive from the Capitol Square) or in need of some quite time, then this is the place for you!   \n\nThanks Speckled Hen, for such a relaxing time and creating some wonderful memories!!!", "type": "review", "business_id": "FrT0OQFkUZBtfoW3V1Wpfw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Dzc2m6O4vaXCF4ztKPjTcQ", "review_id": "cuGwE87hHuQEptNx6SuqaQ", "stars": 2, "date": "2011-04-20", "text": "I usually go here because they have some Halal dishes but it's definitely not my \"go -to\" place for Halal.  I find that I have to be in the mood for it in order to really enjoy it.  However, my husband swears by their chicken and I do really enjoy their kefta with rice.", "type": "review", "business_id": "Ryq600aoE3h8_qRQGIed9A"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "hyxZfJkC3UckkDbzBH9clA", "review_id": "o9kBdeBVmqLiymTCLSgAJg", "stars": 5, "date": "2012-07-05", "text": "The donuts are amazing and super-fattening of course, but then I guess you shouldn't be eating donuts if you are concerned with your weight.\n\nI agree it is by far the best gyros in town, I am originally from Chicago and am used to the quality of gyros found all over Chicagoland, this is cut the same, same thickness, same style, the flavor is similar, but has it's own thing going on. Either way, that Parthenon in Madison is crap, people rave about it, what a joke, they have no clue what good gyros is, take a road trip and go eat at Hubs in Chicago, then you will know finally what great gyros is. In the meantime, if you are stuck in Madison, this is by far the best you will find, don't waste your money and calories elsewhere.\n\nFalafel is good, has it's own unique recipe, works for me.\n\nTan Tan Chicken is very good too, highly spiced, which I like, although not spicy as far as heat is concerned. Comes with an awesome garlic dip, which I've only found in Los Angeles at Zankou Chicken, which by the way is the most incredible middle-eastern chicken ever. They even made a \"Curb Your Enthusiasm\" episode about it in 2011. If you get out to LA ever, you must go to Zankou and get the Chicken Tarna with the garlic dip, the hummus is also the best ever. Almost enough to make me want to move back to LA. In fact...\n\nAnyway, People's Bakery is truly a gem in Madison, amongst all the questionable eateries, which some say are great, others say bad, this one is clearly a huge winner. And it is a real Mom & Pop, literally they made all the food for me, super friendly, down to Earth, real people who deserve to have your business. Go there now!\n\nP.S. I also liked a bunch of other stuff there, the hummus, side dishes, veggie mezza, etc. Probably can't go wrong with anything there.", "type": "review", "business_id": "Ryq600aoE3h8_qRQGIed9A"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "C00-yXJR3WJKt8NdCBzqxQ", "review_id": "XrjkdmcShK1LxShRcEqCBw", "stars": 5, "date": "2013-07-22", "text": "So good!!! We went as a group and everyone loved the food they ordered.  The food was very reasonably priced!! Yum!", "type": "review", "business_id": "Ryq600aoE3h8_qRQGIed9A"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "x4y6u3CgY7RzzrWvphcZDQ", "review_id": "ZP_q58L-dqn1OVNxze_ifw", "stars": 4, "date": "2008-09-24", "text": "The patio is as heavenly place to spend a day off in. The appeal of riding my bike up the path right to the patio is fantastic. I love that they offer different varieties of iced tea besides your regular black. My only criticism is that I had to wait a long time for my sandwich - it seemed like the ingredients weren't readily available (tomatoes had to be sliced first). Sounds picky, but I used to work at a coffee shop and it's crucial to have all of your sandwich items ready to go.\n\nEDIT: CLOSING? Nooooo!", "type": "review", "business_id": "UV9c6A16IXXA7JmkTor8Tg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "4bsu8DLfDkBV84RKn6UmcA", "review_id": "0lrfYfYrS5tZdck3U0eKlg", "stars": 2, "date": "2009-10-06", "text": "It's a nice place in a great location, but the coffee is a let down. It's kind of bland, even when you get an extra shot of espresso to toughen it up. I'm not sure if it was me or the coffee, but I had terrible indigestion after having the coffee here. I noticed becaues based on my schedule, I would get my coffee here some days, and other days at McDonalds. Never on the McDonald's days, but always on the Zoma days, my stomach let the world know it wasn't doing too well. It happened too much to be coincidence. Anyhow, I guess if I'm in a bind I'll get my coffee here, but I think for now I'll take a pass :(", "type": "review", "business_id": "UV9c6A16IXXA7JmkTor8Tg"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "9TDqZLPsOgWERXii_etbcw", "review_id": "Qaa8NGV5mDEFxvMFARAZag", "stars": 4, "date": "2014-06-15", "text": "The Duck Blind is where it's at!\n\nFor $33, you get to watch the Madison Mallards while you enjoy unlimited food and beer all night long in the Duck Blind.  Bring all your friends! The duck blind is great for big groups.", "type": "review", "business_id": "4N7dN61pyPfcxmKgXWQPfw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "AXz26iQxhQQF7FFCkDNJ6w", "review_id": "Pz7Qo2rUjJ09QQFPgwkovw", "stars": 5, "date": "2011-07-14", "text": "Amazing free thing to do in Madison.", "type": "review", "business_id": "Q3GGB4ZMajP-Qmtdr1cVZw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "JUUbkAUk9_tR5jYtKcuo4A", "review_id": "zNcwshJSc5weszPkGMwDOg", "stars": 2, "date": "2013-07-23", "text": "Didn't see any roses in the \"rose garden\" and I counted only 5 butterflies in the \"butterfly house\" -- even the feeding trays were completely empty.  Definitely not 1-star, but also not quite up to \"ok\" -- 2 stars.", "type": "review", "business_id": "Q3GGB4ZMajP-Qmtdr1cVZw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lJnv4JUdz1plI-g2S4M6Ng", "review_id": "yyouC2UmAC2J_10ZB6frKQ", "stars": 5, "date": "2013-09-13", "text": "Free and much larger than I expected, this botanical garden was a pleasant surprise.  There are a few corners that are particularly nice, like the Rose Tower and Temple. Meander throughout and try to get lost. Sit a spell on a bench and enjoy the scenery.", "type": "review", "business_id": "Q3GGB4ZMajP-Qmtdr1cVZw"}
{"votes": {"funny": 3, "useful": 1, "cool": 0}, "user_id": "k60yW0XRImeFIGo2JApNsA", "review_id": "pdxIuQ9RKbdpWSDRFxaVXg", "stars": 3, "date": "2011-10-11", "text": "It's like Denny's built a food court at a retirement home.  If fish fry and old fashions is your thing and you want to hang out with grandma and grandpa while you eat your food, this is the place.  The upper crust in Maple Bluff love this place.  The only thing I can chalk it up to is they can get wasted and not drive that far to get home.  Wood paneling decor round out this gem.", "type": "review", "business_id": "68JsiWNLKs8NDCrBCxIWMA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "NY6XBM67dDNMXEy4xmsE0w", "review_id": "_omLyEkvDttTW2-ouu-SDw", "stars": 5, "date": "2013-03-12", "text": "The crew at this store couldn't be more friendly and helpful.  They were very honest and straight forward with what needed to be done with my car and what really was optional.  The pricing was fair and they explained all charges before doing the work.", "type": "review", "business_id": "uQ1YuSiDgHwVwdFVW-nLqA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cQ8IYZCN1WP9S4zuwWGdDg", "review_id": "0MIV5Mm8jn2E6nQhdWqVyg", "stars": 5, "date": "2011-10-01", "text": "Class act here. We in today with our C421 (N21GF)  for college football game. Top of line service for all our needs. Rent car brought out plane-side for our use. Line service very attentive to all our requests and anticipations. Nice lobby for pax and crew needs. One of the better service stops we have been into...ever. Today was a test for all the staff here because of the heavy traffic coming in for ball game. They were on top of things for sure. Thanks folks. Really well done.", "type": "review", "business_id": "AyAJs-XGv2_Cn_LPH1DWyg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "o46EXQpXhenCTs6RU51CSA", "review_id": "gxGuk_EtYbPah6EyAyRDpA", "stars": 4, "date": "2013-09-18", "text": "Great local place in the Atwood neighborhood. Pizzas are amazing, as are the pretzels. Keith and staff do a great job. Plenty of local brews on tap.", "type": "review", "business_id": "KHOHjA8HOcTlFBCtMQFv8A"}
{"votes": {"funny": 0, "useful": 3, "cool": 1}, "user_id": "_gJremOWua3SW1dbXVMHeA", "review_id": "Gbfl8HPpUhQgdhONrWN7Vw", "stars": 4, "date": "2012-09-27", "text": "A true, authentic dive in the most accurate sense of the word. There's neither pretense nor irony, either. This place has cheap-ish beer, decent shots, a great jukebox and patrons with good enough taste to make the right decisions when pumping money into it.\n\nIt's small and I'm pretty sure it's not air conditioned. However, this is a great down-to-earth place to while away some spare time. Nice people. As others have said, Don's a great bartender too.\n\nCash only, 'natch.", "type": "review", "business_id": "pSYCSXgabSKKJrIEJG-FLQ"}
{"votes": {"funny": 3, "useful": 1, "cool": 3}, "user_id": "vVbSw44ES6y42kMSD2QqFw", "review_id": "keK-23A154LoJtxN1HZBSg", "stars": 5, "date": "2013-12-08", "text": "My first ever trip to Woody-Anne's involved a lady at the bar a) showing off a pic that proved ghosts exist cuz of an \"orb\" that is inexplicably present(?), b) flashing me her boobs for a drink that she never actually took me up on, and c) giving me an epicly gross (DRIPPING) wet willy, all in the span of Fleetwood Mac's \"Landslide\" which soundtracked the whole experience.\n\nThe evening ended with me and the bartender watching a M.A.S.H. rerun in what was by then an otherwise empty bar.\n\nNeedless to say, this is my New Favorite Place.", "type": "review", "business_id": "pSYCSXgabSKKJrIEJG-FLQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bptU7Tp3_GZV4O8KRR8DFQ", "review_id": "KKMfdQo0SVolLoM5yA3b9Q", "stars": 5, "date": "2007-02-06", "text": "I've had BBQ across this great land of ours from Austin to Dallas to NYC to LA to St Louis to New Orleans and places in between and I'm gonna share a secret with you - Smoky Jon's is the best BBQ I've ever had.  The ribs and pulled pork are the most tender, perfectly smoky and best tasting i've had.  I'm not an evangelist for dry rub or wet rub or combo - all I want is good tasting grub.  The sauce here is delicious.  The sides here are also some of the best.  The baked beans have little pieces of pork in em and are super tasty.  \n\nIf you're going to the airport its right by the entrance - make a quick stop and you won't be disappointed.\n\nFYI - Jon of Smokey Jon's has won BBQ competitions all over the US.  His BBQ grill is a huge pink pig that he hauls on the back of his truck to competitions.  Jon also is a huge big nice looking man.  He knows his BBQ probably from first hand experience.", "type": "review", "business_id": "HLWtNcf3l-wKb6v9duteMQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RdufJ-Wl0abkMOlE2WNaLw", "review_id": "Vk6m34M7qyjsDCvr7-imTQ", "stars": 5, "date": "2011-08-11", "text": "We tried to go to this place on a Monday; oops, not open. After 10 months of living in the Madison area, we have found THE RIB PLACE. The ribs are great, so is the brisket, the corn, beans...you get the idea. The restaurant is a little small but the service was amazing. Watching my family eat was almost as good as the food, almost. I highly recommend Smoky Jon's #1 BBQ.", "type": "review", "business_id": "HLWtNcf3l-wKb6v9duteMQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "_34ajo82FKow9KoAwQsjnA", "review_id": "V_Lf3PP05QFBpzwKsXLsig", "stars": 5, "date": "2012-09-23", "text": "The ribs, you must try them! My major mistake was getting a 1/3 slab.", "type": "review", "business_id": "HLWtNcf3l-wKb6v9duteMQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "QP-MdjpUFejr9apuAWcfQg", "review_id": "G41yJqThbG39hBpxvbSC-g", "stars": 1, "date": "2012-10-07", "text": "Very frustrating experience.  Our order was very simple but the cashier couldn't get it right.  While waiting for our food I watched the beleaguered manager apologizing to every table.  Every customer had a problem with their food or order.  We waited twenty minutes for our food and decided to leave.   I have never experienced more incompetence.  Never again.....", "type": "review", "business_id": "XIZ259hZ6Yww3C0o97MgUQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "YFWfdR8v3wEoezv-IogLPQ", "review_id": "LpnWDU4Ov2hmI6ECxM_abQ", "stars": 5, "date": "2011-07-27", "text": "Hard to find a good $100 burger (airport restaurant). Had an awesome BLT with great service and an ice tea for $10.90 plus tip. Place really hops at lunch time, for good reason.", "type": "review", "business_id": "j515klfbCAEF3KPiKvHz9g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Opd7i6SJQZiMyWqqgz6JHA", "review_id": "Fs4D6i_FUAzKsIJEJk3zNg", "stars": 5, "date": "2011-04-15", "text": "I found Beckett Tax through Yelp. I saw Brianne, who prepared my taxes. She was friendly, helpful, and professional. Best of all: I ended up paying less for my tax preparation than I had at a different tax preparer (about half as much). I'll be recommending Beckett Tax & Accounting to all my friends. They're even open Saturday and Sunday the weekend before taxes are due! Procrastinators rejoice!", "type": "review", "business_id": "jm3K37BEkL8-a_aytbCXvA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "pbCkI6jwKxgFzbenhC3ilA", "review_id": "H6OQKUUSjl5bw-H4b7v9nA", "stars": 3, "date": "2011-04-08", "text": "Good food but odd that they lost my lunch order. Thanks to those manning the counter who realized I was waiting and filled the order on the spot.", "type": "review", "business_id": "S2x-rEziU3ONR9zO_vpPxA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-hwN2juKYn-KTxa2WBYLnw", "review_id": "XK21BlRx6cUYm-zTC6BJNg", "stars": 3, "date": "2013-01-13", "text": "I have been served Gaylord Catering food more times than I care to remember and have always been disappointed.  Twice I became ill.   I am not exaggerating.   When Gaylord's shows up somewhere I get the coffee and a roll.\nFrom my experience the dishes are always of the lowest quality.   \nNote that everything looks ok but often the hot dishes are not hot. \nThis is not criticism of the staff.  Just the quality of the food is always disappointing.\n\nupdate: I was contacted by Gaylord Catering regarding my review.  I think this shows that the owners care about the quality of their food and service and that they have much more sense that many other businesses out there that seem to ignore their negative reviews and cannot even update and maintain a decent website.  (a whole other topic)\nIn response I want to better describe what I am referring to in my previous review.  Everything has always been neat and clean with Gaylord.  Their food has never had a bad or spoiled taste.  My illness has nothing to do with food poisoning or anything like that.  I have just felt nauseous for a while after eating their catered breakfasts.  I really think they need to change up their eggs, sausage and breakfast potatoes.  Everything looks ok but it never sits well with me for the next hour.\nI have eaten some lunches that have been ok and I never became ill after eating a Gaylord's catered lunch.\nAs I briefly mentioned in my previous review the staff is at no fault.  In fact, Gaylord has always been on time, the staff is neat and professional and everything is presented nicely.\n\nAnyone who is selecting a catering service should taste test a complete meal that is being served before ordering the service.   I have experienced some real nightmares at weddings, funerals and family reunions. Gaylord Catering has never presented a dish like some of the bad dishes I have been served over the years by other catering services.  I have been served raw meat in Milwaukee, spoiled fish in Waukesha, cold and two hour late food in southern Wisconsin, over salted meatballs in West Allis, tv dinner style food in Montana, seriously low quality seafood in Oregon, completely cold food in West Virginia and a 6 dollar meal for the cost of 20 in Madison,  Complaining about disappointing food at a catered meal is bad manners in my book so I just pass the poor servings and eat what I can.  But on Yelp I can express what my real experience was and I try my best to be as constructive and fair as possible.", "type": "review", "business_id": "gzZsvqloSosWREQMHCm75Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "mq4hh_cUna_-rdT2ThZqdQ", "review_id": "RL3AowtL0HvB0lKFbzKWFA", "stars": 4, "date": "2012-06-09", "text": "This was my first visit.  I love the interior decoration of this place.  Clean.  Had a really yummy sundae.  A bit pricey though.", "type": "review", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "tdKPOP1m4XMR-C-5cHay5A", "stars": 1, "date": "2013-09-26", "text": "Please do not ever go here.  This is a public service announcement.  I do not even know you and I like you too much to suggest this place.\n\n1- Prices?!  Are you kidding me?  $6 for a milkshake?  It was tiny.  Not to mention it was not much of a milkshake.  It was a peanut butter cup shake.  They took some peanut butter cups, crushed them and stirred them into custard with some milk.  I saw the whole process.  It was not very impressive whatsoever.  The flavor was ok.  \n\n2 - The food.  I had a chili cheese dog.  This is my standard order when it is available on the menu.  The chili tasted like Hormel.  The hot dog was hot and the chili was warm.  I like that they have shredded cheese on it, rather than liquid cheese.\n\n3 - My dining companion got a burger.  It tasted ok, but it was a very thing patty. He also ordered cheese curds with it.  They were so greasy and lacked any good flavor in the breading.  \n\nOverall, we spent nearly $20 there and I was not satisfied with my meal.  Every talks so much about how great the custard is.  Nope.  Not good.  Go to Culver's!  Seriously, for $6 you can get something TWICE the size with more mix-ins.  Better yet?  Get a cone for you AND a friend.", "type": "review", "business_id": "Jb5SB2OXbRW0e7ErGlMK-Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "r3o-3SVqaFZ1trCDiAHvuw", "review_id": "LXG4DI76XlWgyXUNdPu0Ug", "stars": 4, "date": "2010-08-02", "text": "Sunset at the tiki bar is as good as it gets besides the Union!", "type": "review", "business_id": "IfC3d5YvkdaQ6ZHSpojMyw"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "jp1wMGPTgrRGbBiiYG5VIQ", "review_id": "z_WKWxB34Obu3CNNDmZ1ig", "stars": 5, "date": "2010-07-04", "text": "Dave is a miracle worker. We broke down on Sunday and had our car towed there on the recommendation of a friend. Although we weren't a regular customer, he worked Sunday night (he wasn't supposed to be open) so we could get on our way Monday morning. He did great work for a great price and was completely honest. I couldn't recommend him more highly.", "type": "review", "business_id": "IlE4UouTsBEGiJ_bNrb5ug"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uvjpH-iBQG3hqcuf7ZJ6EQ", "review_id": "vueqSNDQSG-ivWaCG5cIHg", "stars": 2, "date": "2013-08-30", "text": "I've been using Priceline for 8 years almost on a weekly basis. Every once in a while I run across a hotel that treats you like a second class citizen. This is one. They are nearly empty and won't put me in a king room without a $50 up charge.  My room is next to the elevator too.  Why us Priceline if you're going to resent all your customers.", "type": "review", "business_id": "hmYAW7mhIz_o8ArencdkDw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RvweNJFVkR3ttkWsIBy7nQ", "review_id": "8cm5XuWP2kJt60l-IkEKHw", "stars": 2, "date": "2013-08-26", "text": "Wow, kind of let down.  I have been to other locations and always received a pretty good meal.  Most likely between 3 and 4 stars.  On an early Saturday evening, I walked in to an empty restaurant.  I order the combo: two tacos and one quesadilla with rice and beans.  My order was to go.  I live about 7-8 minutes from there.  \n\nWhen I got home my food was room temperature.  It was like they pre-cooked the meat and then just warmed it up quick when I got there.  My quesadilla was a bean taco, yup definitely NOT a quesadilla.  That is it.  Not impressive.  The side of rice was great.  The side of beans was salty.  It is just not what I am used to from other La Bamba visits.  \n\nStep up your game.", "type": "review", "business_id": "U_m1zmeKhRkqOLxHFBXdEg"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "t6zANh_g-WI-YEXiuznQbQ", "review_id": "q0Z-_PYmxfAhKQBEieW7ow", "stars": 4, "date": "2012-04-06", "text": "It's a Starbucks, they're friendly, prompt, and consistant. Easy on/off the beltline. No drive through, but the Fitchburg drive through is a joke anyway.", "type": "review", "business_id": "zUR94L72x2yUit8mGC2tgA"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "MXCrLIjpuLM5l9GJUyXpxg", "review_id": "CWJglpqSggP50etdKu6tOw", "stars": 3, "date": "2012-07-02", "text": "I had an iPod dock put into my SUV. Everyone was nice when\nI called to make the appointment and all my questions were answered. My problem came with having to return 2xs for them to get everything right. The first return we made was because the radio wasn't working AT ALL. My dashboard was put back together incorrectly (an oversight to the person who picked it up for me- he's unfamiliar with my car) so now I have to go back again. I wish I could give a better review, but the inconvenience of having to make so many trips back soured the whole experience. \nThe guys that helped me were super super nice to deal with. They apologized both return trips.", "type": "review", "business_id": "ImBOmnSOb1ajWskhQyaa4Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vU4N-TaRwk5GtAc97_wx9A", "review_id": "7lM4JHh-gzw9uTx5Z-AJSw", "stars": 2, "date": "2013-12-09", "text": "Kind of makes me feel like I' inconveniencing them.  I get left so they can help others.  I don't mind waiting, but when its my turn, then I am the person that should get the help and the other people should be told to wait.", "type": "review", "business_id": "ImBOmnSOb1ajWskhQyaa4Q"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-hwN2juKYn-KTxa2WBYLnw", "review_id": "kz9fzkE9XP7bnEQk3KcM5w", "stars": 2, "date": "2011-09-14", "text": "This is a review on their catering service.   Angelo's catered an event we went to and we were looking forward to a really good meal.  It wasn't Italian food so maybe this was part of the problem but the food was a big disappointment for what we had to pay and there was very little help with the service.  A few of the items were pretty good in flavor but overall it was a lackluster  meal.", "type": "review", "business_id": "Hld3cjWyfPpW5hDcgXfNQA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Jpb5uSnlLKD4RJzk7UGwkQ", "review_id": "63kbRkY8h9TIwKb2Q4BuVg", "stars": 5, "date": "2013-09-29", "text": "I absolutely LOVE Metcalfe's.... I mean come on... who doesn't love low Grocery costs and TONS of samples! The people who work here are incredible and are always really helpful when trying to find something. It's a grocery store so I can't say too much but I always love coming here for some reason to get groceries.", "type": "review", "business_id": "OxR3b_qcMJlzwzGPU5fmdA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kj18hvJRPLepZPNL7ySKpg", "review_id": "RtJAVFsf8lD8Hx_jaMsv8A", "stars": 4, "date": "2011-05-27", "text": "Perfectly nice place with good food (burgers are charbroiled) and very attentive staff. Lots of windows for looking out at part of the Aldo Leopold/wooded area across the way.", "type": "review", "business_id": "cRqZ_w9ImfYYIXTHpJMv0Q"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "kMcmUB2Jw7_8MHqXrTbIDg", "review_id": "nim1Z3U-DkRu3QOYPytoIA", "stars": 1, "date": "2012-10-19", "text": "I was excited to work with Carl at my tasting.  I had some issues finding the place and traffic was bad.  My 30 minute trip turned into a 40 minute trip and I was 15 minutes late.  I figured I could talk to him when I got there (rather than try to find his number while driving) and it wouldn't be a big deal.  I got there and was informed he had left for the day.  Ummm ok.  Kind of shady considering he had my number and could have informed me.  I decided I would give it another shot - maybe there was a good reason.  I called a few days later to reschedule and left a message.  Several days passed with no response.  I get that I was late but I am a customer.  I was left feeling he was very stuck up and unprofessional.  He could have said he has a late policy, wasn't available, or said anything at all.  What a waste of time.", "type": "review", "business_id": "tE8MQ9I7E2_Xvm4AvykXrw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Zgh5rBRRu4GosESrovZhzA", "review_id": "9iVXj9T075fcQ58Hb7Bfmw", "stars": 2, "date": "2014-03-11", "text": "I've eaten slices from three different cakes from Carl's Cakes, and none of them were drop-dead wonderful. In fact, they were all similar: cake pretty average, all topped with a very strange frosting -- buttercream that is TOO buttery, overpowering in both flavor and fragrance, and has an odd, chemical-like flavor to it. \n\nAfter I eat a slice of the cake, I'm not tempted to go back for more. (It's cake! You should be!) Because of the strange buttercream frosting, I've really had enough when I've eaten just one small slice.\n\nEvery instance in which I've had a slice of a Carl's Cakes cake was at my work (someone's birthday or other event). The cakes sat in the kitchen room at my work, ready for staff people to enjoy. The kitchen room itself smelled like butter with the cake sitting in the room. It is a sickly sweet smell and kind of nauseating, I think. (I've never noticed other sheet cakes from other cake bakers that cause the room to fill with the smell of the frosting.)\n\nI hate to be harsh about cakes, but I just have never had an enjoyable experience eating any cakes from Carl's Cakes.", "type": "review", "business_id": "tE8MQ9I7E2_Xvm4AvykXrw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "RntE4WzkBQvMm_8zg7I0Nw", "review_id": "TG6awdYkuo_FQAaLosCHRg", "stars": 5, "date": "2012-12-10", "text": "Tiffany is, by far, the best stylist I've ever had.  I recently moved to DC and have let my hair go for 6 months because I knew I'd be back home in Madison around Christmas and could sneak into Ultimate and get my hair done right.\n\nWhen I first started going to Tiffany, I did what every girl does post-break-up.  I sat in her chair and told her I didn't care what she did with my hair but that I needed something different.  She gave me the perfect cut and color.  I was stopped multiple times by strangers asking me where I had gotten my hair cut.  It was stylish and professional - plus, I could just blow dry it into shape, no need to curl or use a straightening iron.\n\nLove this place!", "type": "review", "business_id": "WfeA7PurZdBOPXcGB27vEA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HAPeOwz8g3D8LNwPDf0aVA", "review_id": "BxLO7QExykdbrJzfW0Z0bA", "stars": 5, "date": "2013-01-05", "text": "The first thing about Fraboni's is what everyone else has said: that second you open the door and breathe in the various food smells. Hey, it's the little things in life! If I want to cook Italian, I HAVE to go to Fraboni's to pick up the ingredients. I usually drop in for their deli and ready-made sandwiches. I think they wave a wand over the sandwiches before setting them out because anywhere else it would be just a sandwich. Theirs are the most fantastic deli sandwiches I've had in Madison.\n\nAnyway, if you haven't gone, go.", "type": "review", "business_id": "ki33_SvM4kPjgA44Re8-zQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "xuaT9c3uEj9itWvWGbBXwQ", "review_id": "a-x4Vc25_Q6xF7vmmdoKKA", "stars": 5, "date": "2012-02-09", "text": "Ken's is great. We rarely have ever got bad meat here - and we've been to Ken's at least once a week for almost 15 years. \n\nVirtually all the steaks are great. People really like the Burgundy Pepper Steaks. The Rib Eyes and NY Strips are my favorites. \n\nThe Sheboygan brats are fabulous. The ribs are great too - nice and meaty. When my family does burgers we always get their sirloin burgers. Really tasty.\n\nThe staff is often younger people - but they are very nice and well trained. \n\nThe only downside would be is that it's pretty expensive - especially the non-meat products. I only get the non-meat things if I really need something and want to save a trip to the regular grocery store (but this is typical of mini-mart type places).\n\nBeware - on nice days they will go through some things early. Don't wait until the last minute. \n\nThey do let you call and make orders, which is nice if you want to guarantee something will be in.\n\nA wonderful place. Highly recommend.", "type": "review", "business_id": "LWmlH8MwUnwMWN5Ma8utnQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "DJbX0XH6Kn3Nm5uo58lu9A", "review_id": "w6lmhnpYnLi6fQSbqeEkbA", "stars": 4, "date": "2009-02-22", "text": "Yay! I finally got a chance to eat here this weekend, and I must say it was fantastic! We went for lunch (takeout) on a very cold day. I ordered the jerk chicken ($6.50) and he ordered the jerk pork ($6.95). We got two orders of plantains ($1.95 each). The decor was very..festive. It was all decked out in yellow and green. I'd really like to try their buffet as it seemed like it had all of the dinner entrees on it. \nOK. Our styrofoam containers were stuffed with food! Our entrees came with a choice of two sides: veggies (a hot carrot/cabbage/broccoli slaw.. very tasty), rice 'n' peas (rice with red beans), or potato salad. We both got veggies, he got potato salad, and I got rice 'n' peas. The potato salad was okay.. it was standard mayo based potato salad. No zip. The rice 'n' peas were alright.. for some reason only my favorite place back home puts some coconut in the rice to cool down the jerk sauce. As far as the meats go, the chicken was great. It was deliciously flavored, moist, and falling off the bone. The sauce was really nice too.. very well balanced. They gave us extra in case we wanted a little more heat. I think they blend their own because there was a bottle with a picture of David on it at the cash register. There were two drumsticks and a small breast in the order. Boy's order of pork was very tender and flavored well again (almost like jamaican bbq, he said because it was pulled). The pork tasted and looked kind of like beef, though we don't recall seeing any jerk beef on the menu.. so maybe our taste buds were off... I love this place.. it is a great deal!", "type": "review", "business_id": "qodyGnpmj1zEfi7nJ534BA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "BSCexEuWtbp2hhO7MMvB6A", "review_id": "kbnaKoezNJngvgVmftLTzQ", "stars": 1, "date": "2013-08-12", "text": "Bad service and even worse \"food.\"  I'll never go back while in the area.  I'd rather eat McDonald's or at some other fast food place - they offer about the same number of \"healthy\" options. \n\nThey get 1 star because of all the adorable old people there.  Other than a hospital/old folks' home - I've never seen so many walkers and oxygen tanks in one place!", "type": "review", "business_id": "JD1uVun5FEF_Ih2PnHCbuA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nZyUVqubGZQujxlGM-sOOQ", "review_id": "AzxYQ74RH5qpMTHFuG6hxg", "stars": 4, "date": "2013-11-07", "text": "This place charms the hell out of me. It's friendly with a familiar old folksy decor. The problem may be that other reviewers don't know a whole lot of stuff about stuff. What I know is that the food is good with big portions, the place is always clean (this aint really a greasy spoon my folks) and the service is EXCELLENT and friendly. Only downside is they aren't open later.", "type": "review", "business_id": "JD1uVun5FEF_Ih2PnHCbuA"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "QP-MdjpUFejr9apuAWcfQg", "review_id": "HBoodec7TGXIjG0ksUgXjQ", "stars": 3, "date": "2008-06-09", "text": "Perkins with only burgers.  I got what I expected.  Good place to bring a kid.", "type": "review", "business_id": "4pZeC9W0EIiBTOJMnwG2vw"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "-59qOh8zgPmc4qsqZ2XTEg", "review_id": "cUMsGokjcSL7bXJT7JYw2g", "stars": 3, "date": "2012-01-13", "text": "Brought the wife and kids here on a Sunday night.  We were seated within 5 minutes or so.   Although the lobby was empty, it turned out nearly all of the tables in the dining room were full.\n\nAs another reviewer said, this place feels loud and chaotic, even on a Sunday night.  It was difficult for the waiter to hear my wife and kids' orders; it seriously felt like a school cafeteria (noise-wise). Not relaxing at all; I cant imagine what it sounds like on a Friday or Saturday night. The acoustics just aren't good in here; maybe carpet and/or a different booth layout would help.\n\nFood was good and reasonably priced.  Came out pretty quickly. Server did a pretty good job, but seemed a little stressed out like he had too many tables.\n\nI might come back, but I really don't look forward to all the noise.", "type": "review", "business_id": "4pZeC9W0EIiBTOJMnwG2vw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "reI1yQImDR-1a55zVZZPHQ", "review_id": "2Ssws3g3joLHnEiI_YBNFg", "stars": 4, "date": "2012-12-27", "text": "Loved this place. Classic Wisconsin supper club with wood paneling. Order your drink, order with a waitress, drink some more, get seated an hour later and enjoy. Great fish fry! \nNot good for Kids who aren't patient but my 6 year old did great! We will be back", "type": "review", "business_id": "FIR1SRvSAMNTO3VvNaJn2g"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "2lLNnEeWDTTVo4wxLuu8Sg", "review_id": "FCJN4WcRwULmOOiMb7Yu-w", "stars": 4, "date": "2013-10-30", "text": "Walking into this place is almost like walking into a time warp. The main lobby was desperately outdated.  I would guess there hasn't been any update to it in 20 years. \n\nThe theater our movie was in was nice though.  I wasn't expecting too much after seeing the lobby but it had stadium seating and seemed updated.  \n\nThe staff we interacted with was friendly but not very chatty.  Overall, I had a good theater experience and would go here again if I'm in the area.", "type": "review", "business_id": "pACm1yLb9Pwc1mOuvC3UDw"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "-M60tkpN6ncFNMtC9Snj_g", "review_id": "pvC01EmBWWPql8mMpr86yQ", "stars": 3, "date": "2014-06-17", "text": "Average theater, seats are old, but they do the job. The food & drink is way overpriced, so bring a big purse with snacks from home.  $5 movies all day Tuesday is a good deal.", "type": "review", "business_id": "pACm1yLb9Pwc1mOuvC3UDw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "l0DYlIF-ldnMsi2B32miEQ", "review_id": "iTRH6q4xnFjUUp_5CQ3TsA", "stars": 3, "date": "2013-09-03", "text": "nothing fancy, but reliable and clean!  The service was fine (didn't blow us away, but wasn't bad).  The view isn't so great, but that's not Marriot's fault, obviously.  It was a big bummer that there was NO dining on-site (except for early morning hours - which we did not go to).  Would have been GREAT to have room service available.  : /  The \"market\" (think seven eleven) was just fine.  Although, since there was no other food source on-site (again, excluding the early breakfast option), I would have loved to see more variety/options in the \"market\" area.  As we were checking out we asked (multiple Associates) about their rewards program and finally got some info.  It was not readily available, and many staff members didn't know anything about it.  I thought that was pretty odd.  If I was in a pinch, I'd stay here again.", "type": "review", "business_id": "CNvF4BsuFEfC-0Ol4cAD3w"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "8ITVDdfK07owxCA1x878Vw", "review_id": "zZExzhkn_2rtYAa8de2htA", "stars": 4, "date": "2007-06-19", "text": "Website updated on the hour.  Clean.  Friendly and knowledgeable staff.  Odd location.", "type": "review", "business_id": "DdaBJ-NJrvXSjfNRhbA71Q"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "bvG-Et9-NxsLIgMAOOS7Uw", "review_id": "7EvyX2xCH6CACuhVHf_Ilg", "stars": 2, "date": "2012-09-29", "text": "Ordered 2 sandwiches w/o tomatoes, when we opened them they had tomatoes and the bread wasn't fresh :(", "type": "review", "business_id": "r5S_wYdu1vKRW1k-7_yOIA"}
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "sgkRdA1a1Vymdp83Qbikig", "review_id": "5virL0N7v9LPcTUv2pTPHA", "stars": 5, "date": "2013-01-20", "text": "Quick, friendly, and thorough. I was in and out in less than 15 minutes and baby Wyatt looked (almost) brand spankin' new again. :P They really do stand by their promise of having your car out of there in under 14 minutes! \n\n$20 for the most inclusive package is not a bad deal at all - especially if you think you'll be back within 3-5 days for another wash because you get a HUGE discount ($2.99/wash if you bring your car back in 3 days or less). I figure I'll pay for the whole $20 shebang a few times a year, and use the basic package in between these washes just to maintain the shine. Seriously, you cannot beat these prices!\n\nRemember to leave a few extra bucks as tip, they deserve it. (:", "type": "review", "business_id": "x7nnNkAXy9aI4KBz6RMerw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lzu5sYkqKRYDHnGGDlHcWw", "review_id": "3w9IoOVjTTWIZeNG13ZGfA", "stars": 5, "date": "2014-06-04", "text": "I have always ordered pizza from dominos and the delivery have been so so. I'll get my food and it'll be okay warm and okay good. That's also might be due to the fact that I always get the same stuff. But TONIGHT I got something different. I got a hot sub, bacon and ranch sub. The delivery was really fast for once but the best part was that the food was super hot. It he food was so hot that u couldn't even touch it. Never have I ever gotten delivery that was super hot.  It was SO good ;-) extremely satisfied with the service and food. Thank you.", "type": "review", "business_id": "x5Mv61CnZLohZWxfCVCPTQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "OIIz0WoudqkFxwqlsRdZBQ", "review_id": "nd0jivV_Xt4bkjUrtuDVYQ", "stars": 4, "date": "2012-11-15", "text": "Found this place on YELP.  I was at a conference at the Dept. of Ed. and saw it was across the street.  Wonderful atmosphere, quiet and good food.  If you are in the area for a meeting and have lunch \"on your own\", I highly recommend.  Nice variety of food and great view.", "type": "review", "business_id": "2ZnCITVa0abGce4gZ6RhIw"}
{"votes": {"funny": 4, "useful": 6, "cool": 5}, "user_id": "aTi0NVrcPJWbN6jAsJVcAw", "review_id": "XsAPP8iVy2-Sos3zMbOqtQ", "stars": 5, "date": "2012-12-22", "text": "I've taken Audrey, my Audi, to Virginia Auto Service a couple times for routine maintenance. I first heard of them through a coupon in the mail, though I'm not sure how they got my address! :)  \n\nBeing new to the area and because the Audi dealership is way up in north Scottsdale, I decided to give them a try. Not to mention because I value the more personalized service of a small business, but that's a longer discussion... \n\nI've been thoroughly impressed with VAS's personal service, their ability to squeeze you in on relatively short notice, the ease in making an appointment, and their communication on what the deal is with your car.  They also have a free ride service to drop you off and pick you up, which is highly convenient! \n\nIf you have a European car, I highly recommend giving these guys a try!  I'm fiercely protective and OCD about my car -- if I trust Audrey to someone, you know you can.", "type": "review", "business_id": "M-MFa0YErVBbFW2IJhGJmw"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "dlIscnAD4-MUljRFtb9m3g", "review_id": "RYbeVRklTIeS_MOJwG4vbA", "stars": 5, "date": "2014-01-02", "text": "The men here have always taken care of my car, which is now getting up there in age. They're patient and always willing to explain what services will be done to my car and give me a fair price. They're not the cheapest in town but they do high quality work. Even when I had to have work done at another shop they called and had the details of the work faxed over to double check and ensure that everything was done properly.", "type": "review", "business_id": "M-MFa0YErVBbFW2IJhGJmw"}
{"votes": {"funny": 0, "useful": 0, "cool": 1}, "user_id": "jGYO8hQ-szCcp-jh1t5eZA", "review_id": "WVr-fEyowTGSjpAMmgucJg", "stars": 4, "date": "2007-12-20", "text": "I like this place. Although it gets really busy around noon. My favorite dish is gapraogui. I love how the kitchen is visable, while you are dining, and you dont smell like the kitchen when you leave. I mostly go for the food, its not a place I would hang out there with people and drink.", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "m-p9ILrmc-g2YN_vfT9WXQ", "review_id": "2ORAOTcdwHeJA5BxInHdbA", "stars": 3, "date": "2008-06-19", "text": "Ok, I had tried this place a month or so ago at lunch and was unimpressed, but the other day a friend said she wanted it for dinner.  I obliged.  I was blown away by the Panang curry.  Rich, thick, spicy.  We had it for take out and it survived the trip home fine.  I now need to go back and try some other dishes just to make sure it wasn't just a freak occurrence.", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZOfpCtE7a6KK8Dj5Bq_4Xw", "review_id": "xkCzifVTXbNPMLgg57yzxQ", "stars": 3, "date": "2008-10-09", "text": "Service is unpredictable. Sometimes it is very good and sometimes it is very bad. The pad thai here is delicious but has way too much chicken. The kiew wan curry is very spicy and very good. The spring rolls are also very tasty. The hot pots are just ok, a little too much coconut milk it makes it a bit too sweet.\nFor dessert the coconut ice cream sprinkled with peanuts is a great ending. It is open Sundays which is rare downtown.", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "fDGhrZ59p4fV2tBMv5HCXg", "review_id": "rhdCc0Rl0RW8S7WAkJmUXw", "stars": 5, "date": "2009-07-31", "text": "Went to Wild Thaiger for the first time last night and enjoyed every aspect.  Had the Wild Wrap and Dragon Eggs for appetizers.  Both had a really good bite to them without losing all of the different flavors in the dish.  That is something that gets lost at many Thai places, everything is so hot you lose the flavor.  Two of us had the Beef Panang for dinner and our friend had the Salmon dish.  All were prepared very well.  The beef panang was a little different than I have had at many places here in town.  More curry & creamy coconut milk than the light broth based panang we have settled for at other places.  It was by far the best panang we have in Phoenix to date.  The beef was fork tender and the sauce flavor was over the top.  \n\nThe restaurant is very cozy and energetic.  It was 7:30 on a Thursday night and the inside was full, with only 1 table on the patio brave enough to weather the 100 degree heat.  Server was very friendly and attentive.  NA beverages were always kept full and she was all over refilling our glasses from the bottle of wine that had been ordered.  Big bonus points for the kitchen design.  It will not blow you away with tons of polished stainless steel and creative wall decor, but it is an open exhibition kitchen with about 10-12 seats at the bar that look in on the action.  Extremely rare to find in a Thai concept.  Love knowing who is cooking your food and that the kitchen is well kept.  We will definitely be back as this will be our new home for Thai in the valley.", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "VJN7o5JgNP1diUaE7iSYlA", "review_id": "JTJjEapjx0IGmJFBNxmutA", "stars": 5, "date": "2010-07-30", "text": "I have been to the Wild Thaiger several times and I decided I should write a review because it is such a great restaurant. I went for lunch this time and the service was great. Although it was slightly loud, the food more than made up for it. Started out with lettuce wraps and ended with pad Thai. It was amazing! Very tasty :)", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "nvPSNKO1H9mwgg3cd2uvpg", "review_id": "6c9E2Ni7e3bfhAMWHgPbyA", "stars": 4, "date": "2010-09-30", "text": "I've eaten at a number of Thai restaurants in the Phoenix area, and this definitely is in the top 3.  The food is great as was the service and it has a cozy patio if you enjoy eating outside or are a smoker.  The price was also reasonable.   They do serve alcohol, although I'm not sure if it was full bar or beer/wine service only.", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "KGQu1on15VSK27U0oGtefg", "review_id": "l01ZGy93Q2HlCKqDCdIqZQ", "stars": 4, "date": "2011-06-13", "text": "Go here for the food, but most importantly, the mango sticky rice dessert. HEAVEN.  I work around the corner so come here once a month or so. The owner is a very sweet lady and the servers remember us which is heartwarming. \n\nI enjoy their pad thai quite a bit and have tried other dishes as well. They're soups are fantastic and so is their iced tea!", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Psh8PaEh8c2Wn8YjwyGVvA", "review_id": "UujwmLE5DB7b8uMKJ0QO_A", "stars": 3, "date": "2011-06-17", "text": "Ample parking in back, but spaces are narrow.\nFood is delicious.\nPrices are a bit higher on average for Thai places I've been to around town.", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "psSxO_7PWbBbUiV2jB6BUg", "review_id": "nLOSh4MMEub6JtP-3EN0iw", "stars": 3, "date": "2013-04-13", "text": "The food here is average at best.  I am a little concerned with the overall cleanliness of the kitchen.  It is very small yet they cut flowers and do other non food related things in the same area your food is being cooked in.  I have had to sit at the bar and wait for a table.  I noticed how small the kitchen is and how they do not clean up immediately after themselves.  Some dishes are really good while others are really bad.  Any substitutions and there is a charge.  Not very friendly at all when you can charge someone $2 for peanut sauce with their meal or $1 to add onions or remove bellpeppers.  It is just a real hit or miss here.", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HJsSXFWaFXpZAVZnwtM5-w", "review_id": "j9_HP_Te9N75rVAH3gsIDA", "stars": 1, "date": "2013-05-27", "text": "The food was okay and the atmosphere was nice. Unfortunately the service was absolutely appalling. It took 30 minutes just for the waitress to take our drink order and another 30 for her to take our food order. She took even longer to collect the bill and run our card. We could see her chatting behind the counter with another employee. My boyfriend had to walk up to the counter to ask her to run our card as we had been waiting for so long. Considering there was only one other table in the whole restaurant this was ridiculous. Extremely disappointed with my experience and I will not be coming back.", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XxDif_HRn_5_wyA2-Wk7Mg", "review_id": "pEAeBhFhsC_eEJzFCzVOdA", "stars": 3, "date": "2014-01-07", "text": "This place was a favorite spot of mine whenever me and my coworkers needed a good Thai meal.  Centrally located, parking always available, and the atmosphere is so relaxed.  I tend to go straight for the Pad Thai (which is a great choice here - you will not be able to eat the entire thing in one sitting, even the lunch portion), but everything else I get I enjoy as well.  The one thing that I would watch out for is time constraint.  My coworkers and I used to work right by the restaurant and were a little more flexible with our lunch hour.  However, sometimes I did have to wait a little longer than I felt I should for my food (although they may have just been very busy those few times).  All in all, a good grub spot!", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Hi7VohxSS5OBt98w4j8t4A", "review_id": "p1cMEorLRNy5e-21T_6DiQ", "stars": 5, "date": "2014-02-22", "text": "Mouthwatering food.\n\nI have been here a few times, as it is walking distance from my office. \n\nThe first time I ordered the vegetarian panang curry. Delicious and spicy. My only issue is I was sweating profusely on the walk back to the office. \n\nThe last couple times I ordered the veggie pad thai. So scrumptious! They plate it beautifully. They use a good variety of fresh veggies... not just the standard broccoli and carrots. Lots of zucchini and cauliflower. Yum. The sauce has a lot of fresh garlic. It is so delectable. May be the best pad thai I have had in Phoenix.\n\nService is prompt and friendly. For lunch I am in and out under 40 minutes. They keep the fresh iced tea flowing...\n\nI can't help but growl when co-workers ask me where I ate for lunch. \"Wild Thaiger... rowl!\"", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "fJ_FMbSeNm9wVOOODRDNBw", "review_id": "KLe80o8qTCBKC_UpZ0tPOw", "stars": 1, "date": "2014-02-28", "text": "IF YOU CAN'T TAKE THE HEAT... \nDon't expect customer service! Don't expect them to answer the phone if they're busy during normal Business hours. They won't! And they won't apologize for it either! \n\nI, along with my co-workers wanted to place over 9 food orders for pick up. After several attempts to call and place our order, Wild Thaiger never picked up their phone. So I drove a few miles to place the order in person only to be told that there was a TWO-HOUR take out waiting time! I wish someone would have picked up the phone at Wild Thaiger instead of wasting my gas and time. \n\nJUST A LITTLE ADVICE Wild Thaiger, ALL your phone-in customer orders deserve the same respect and assistance as your dine-in customers! If you can't handle the heat, then get out of the kitchen! \n\nMy office and I will be taking our business to Thai Hut and Thai Basil!! Maybe that'll help alleviate some of your stress, Wild Thaiger.", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "5WCmTakHXfDQXW4D6hUKBg", "review_id": "QTUeO4Eul_l0l5tJ5aThXw", "stars": 2, "date": "2014-03-01", "text": "Overrated. Service was slow, food was mediocre and a bit pricey for the service/food you get. I had satay chicken and the meat was dry and the sauce was crumbly. Then I ordered the pad-see-ew and it was super salty.", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "aom-4my104ueMEqRBf3log", "review_id": "6sF7XEy7PgaNvyOLBT5a1w", "stars": 5, "date": "2014-06-28", "text": "We went here for a second time with all 3 of our kids last night and it was a big hit. The first time was with just our daughter who was around 1 at the time. It was a pleasant experience with good service. Last night we brought my 9 year old step daughter who is the pickiest eater I have ever seen. She ordered a noodle dish with sweet soy sauce (she tried to get it without soy sauce but the waitress convinced us it would have no flavor). When it came she made a face but then tried it and loved it! I also had some and was very impressed. It had a lot of fresh veggies and a generous amount of chicken. The veggie spring rolls were also a hit with her and my now 2.5 year old and 9 month old. It was kid friendly. The Tom Kah soup was delicious (my fiancé's favorite!) and we split the ribs which fell of the bone and were so tender. The kids fried chicken meal was generous and both kids loved it. The vegetables were all fresh. And the waitress was sweet. We will come back!", "type": "review", "business_id": "KPoTixdjoJxSqRSEApSAGg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Av2lz4oZowjjBabKWouFVA", "review_id": "POIc-yq0mhw9KC5pzYIv7w", "stars": 1, "date": "2014-06-11", "text": "Scheduled an appointment by phone on a Monday for Wednesday @ 4:30pm. Showed up 10 mins early told gentlemen I had an appointment, they said have a seat. Waited with others 20 mins past my appointment, another gentlemen was sat before me with an appt. I let them know mine was 20 mins ago. Guy looks me up. \"No, you're not in the system. I can book you for tomorrow,\".... The place was a mess, not picking up between customers, hair on floor, and the customer service was horrible so at that point I just left. I was going to get the whole deal for $70 and planned on making this my new spot. Guess not. Hopefully the other V's in the valley have a higher company standard than this one. Called the other chandler location immediately after leaving here and got a friendly older gentlemen who booked my appointment and even gave me the name of my barber for when I arrive. That's actual customer service!", "type": "review", "business_id": "OtDcALEX6-LfEOQE0QgHYw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rIP5S5HZumKPx6ubpCN1NQ", "review_id": "ur27WItq0mpMvePwUWIMUg", "stars": 4, "date": "2011-09-14", "text": "This hotel is called the Lexington, although our GPS took us to Best Western. We stayed here as part of our road-trip honeymoon and really liked it. For the money, which is completely reasonable, it's actually very nice. The room was big, had a nice view of the pool (which we didn't use but looked nice), and was in a pretty convenient location. The staff was incredibly friendly and the continental breakfast was yummy and, as far as these things go, pretty expansive. The only thing keeping this from a 5-star (in terms of value) is that you have to walk through a nasty-smelling, creepy looking hallway to get in and out of the parking lot, which isn't that big a deal, but still very gross and upsetting. Otherwise though this place was great and definitely worth the money!!", "type": "review", "business_id": "fpL1qcZ6qbWzC79WU0E-Ug"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "8IKIpm6ztRsep7OpmB05pg", "review_id": "GvYNOCJHxNilxQRdvWlUBg", "stars": 2, "date": "2012-01-05", "text": "I was a little nervous about shopping here after reading the reviews, but since it was closest to our hotel, we gave it a try.  It was fine. Nothing worse than you'd find in the SF Bay Area. Buck up, little campers. Quit being so stuck up.", "type": "review", "business_id": "7Z7IkR_-94AjUuDw0fbI7g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "uq5C5qFHN7iqvdX83VwrlA", "review_id": "kZCGBY4a_D3oB1Q8xuDXJA", "stars": 2, "date": "2009-11-09", "text": "If you're gonna eat tex-mex in the downtown phoenix area, this is your best bet. \n\nI typically go here every time I come to Phoenix, and it's pretty great. the outdoor seating with the Grotto view is really really gorgeous. \n\nThe chips and salsa are FANTASTIC!!!! You get an assortment of chips and they are the best I've ever had. \n\nThe blackened fish tacos set my mouth on FIRE. I had no idea they would be COVERED in chili powder. too extreme for me. \n\nTypically you get, white chocolate wrapped in a tamale leaf to cleanse your pallet after you are finish with your meal, which is one of my favorite parts of dinner ... but our waitress forgot :( ... definitely ask! \n\nI would say this is your typical \"mexican/southwest\" restaurant, where the entire menu is basically variations of taco salad, 10 different variations of quesadillas, and tacos of some sort, and 3 pages of different margaritas and drinks with \"loco\" in the name. \n\nNot too bad, not great either. I personally prefer the Greek place next door :)", "type": "review", "business_id": "e5kc0CQ4R-PCCDgb274gSg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "f6LyQRjgqdZPYK888JHedQ", "review_id": "Dfc8t2HawCFyaJyPkQZ-Gw", "stars": 4, "date": "2010-10-12", "text": "Accommodating to gluten free needs. Fish tacos, chips, & salsa were great. Service excellent.  Also liked the complimentary chocolate tamale dessert.", "type": "review", "business_id": "e5kc0CQ4R-PCCDgb274gSg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "yPXwplqHZbWiS7h9-Ntawg", "review_id": "7fNp6QWorKDewKdwGoUmwA", "stars": 5, "date": "2012-04-21", "text": "Had lunch here. Great food and great service.", "type": "review", "business_id": "e5kc0CQ4R-PCCDgb274gSg"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "n4EqyATij3Vd0bRoFt-djA", "review_id": "SxcCy0OJJpSAvhuH3lhqaw", "stars": 4, "date": "2012-12-07", "text": "I had never heard of this place when i went here for a lunch meeting.  We arrived about noon on a Wednesday and the place was busy, but not packed.  The weather outside was awesome and we wanted to sit outside but the noise from the fountains/waterfalls up against the patio was really loud to talk over so we sat inside.  \n\nThe chips and salsa they brought out was amazing.  The bowl had 4 different types and flavors of chips and the salsa had a good taste and spice without being too hot.  For a meal i picked the Meatloaf and it was a ton of food.  2 huge pieces meatloaf that was seared on a grill after it was cooked came out with corn & mashed potatoes and a roasted tomato BBQ sauce.  I ate the whole thing (even though it was more food that i should have eaten) and i didn't feel bad!.  The meeting was a little hard to pay attention to though since the windows faced the pathway and the women from ASU downtown and all of the businesses kept walking by!!!", "type": "review", "business_id": "e5kc0CQ4R-PCCDgb274gSg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "z29rB7lK6hDr5rF8Ndf1hw", "review_id": "izklKiyFvhMFsritv0vGEA", "stars": 5, "date": "2012-12-17", "text": "The black and blue quesadilla was amazing! And the chips and salsa are to die for! Service was great, too!", "type": "review", "business_id": "e5kc0CQ4R-PCCDgb274gSg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "60dPVZpet7n9Cm0mCioNKg", "review_id": "J9rcL8sHPibgfQYWtxQ3DQ", "stars": 4, "date": "2013-07-27", "text": "Patio is dog friendly.  Very good service. Had the blackened catfish which was good .  The little white chocolate and pecan praline deserts rolled in tamale husks were outstanding!!!", "type": "review", "business_id": "e5kc0CQ4R-PCCDgb274gSg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "lZSbFdSwHj6eEAnSX_6Vxg", "review_id": "UKhsijaMvKNAOX6Cz5nkWg", "stars": 5, "date": "2014-05-15", "text": "Here on business, staying at the downtown sheraton across the street from the restaurant. I've been here twice this week and the food and service have been great. Chips and salsa are a unique blend of sweet and salty and delicious. Great margaritas. Both I can only comment on the fajitas but they are amazing. I'd definitely recommend", "type": "review", "business_id": "e5kc0CQ4R-PCCDgb274gSg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t3K5kc6VpWNoIN1gsmLyDw", "review_id": "PYyBIWPpOPW66JvI4sgd6w", "stars": 4, "date": "2014-05-27", "text": "Good Southwestern food: Addictive chips, efficient service.", "type": "review", "business_id": "e5kc0CQ4R-PCCDgb274gSg"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "JgDkCER12uiv4lbpmkZ9VA", "review_id": "6b8SlFMAbw5AqqbGOy8fkg", "stars": 2, "date": "2008-05-31", "text": "The Teeter House is a trip, like no other. I was drinking with a couple of newly met friends next door at Rose and Crown and they wanted to go here to check it out, so I was a good sport about it. We tried sitting at the \"bar\" but the owner said we cant sit there, because thats the managers seat..... eh? I was definitely surprised to notice they have a full bar, but all the other aspects were very very odd. The plants in the bath tub, the victorian old lady wallpaper, and the same dining room table seats my parents had growing up in the 80's. Maybe it's my generation, but this place did NOT appeal to me whatsoever, and who tells their customers they aren't allowed to sit at the bar?", "type": "review", "business_id": "gBcpDl0quCLABsg5OuSFww"}
{"votes": {"funny": 1, "useful": 0, "cool": 0}, "user_id": "1WETDRBnnaslCNteq4pcIg", "review_id": "Otr9PvcefaRfzynCqVNjaA", "stars": 5, "date": "2009-05-01", "text": "The desire to bring my mom here is damn near overwhelming.  Victorian antiques, kitschy decorations, and brocade wallpaper - and did i mention fantastic scones with Devonshire cream?  I'm not even a girly girl (look for me slurping Irish breakfast tea in a Dramarama t-shirt), but I just can't help feeling frilly and feminine in this place.  Spot on, my good man (translation: 'aw, hell yeah', for those less pasty).", "type": "review", "business_id": "gBcpDl0quCLABsg5OuSFww"}
{"votes": {"funny": 7, "useful": 5, "cool": 4}, "user_id": "YoBgKOdfpGH48LpIDSfoQQ", "review_id": "iCyu-bSlj5paUcaVC7qfgg", "stars": 4, "date": "2008-07-31", "text": "Is it wrong to review a church? Maybe. o well.\nI'm getting maried here next year because I wanted my out of townies to see why i love phoenix. ( or at least what there is to love) I like and appreciate most churches in downtown environments and this place takes the cake. It reminds me of a lot of churches back east, plus its the only basilica in the state. just don't ask me what that means. the building is beautiful, most everyone is nice. And there's less homeless folks milling about than at the older churches back east. Or maybe its just the homeless people here are more well behaved because we have nice churches and good weather?\nwho knows. \nThe only downside to this place is that some parishoners have WAY too many non- well behaved small children with them, who tend to flounce around on the floor and shout. Not cool.", "type": "review", "business_id": "545sP7uSdCcKDZ-reeVOgQ"}
{"votes": {"funny": 2, "useful": 13, "cool": 9}, "user_id": "4ozupHULqGyO42s3zNUzOQ", "review_id": "M-uVMuFi0HhRPkJGO1zicg", "stars": 5, "date": "2011-04-06", "text": "If you are looking for a classic Catholic church in Phoenix, this is it. St. Mary's Basilica has a beautiful sounding choir, wonderful priests and a historically Catholic feel with architecture and structure. I think it has something to do with the fact that Pope John Paul II visited this basilica years ago for World Youth Day. \n\nI've been going to St. Mary's Basilica for years. Ironically enough, Father Vince, who is a priest at St. Mary's Basilica, used to be the priest at St Isidore's in Danville, California which was the church I went to when I was growing up. \n\nDuring the holidays, I make sure I attend mass at St. Mary's Basilica. There's something about the architecture, music, and Mass that makes this a perfect church for those times. However, it's also a great church for Sunday mass. \n\nAround 7 years ago, my sister married her husband at St Mary's Basilica  and I was lucky enough to be the Maid of Honor. The wedding was a full Mass and made it such a special day for my sister, her husband, myself and everyone who witnessed the ceremony. \n\nThere isn't much more I can say about St. Mary's Basilica in this review, but I will end this by saying that each Mass is a different experience and it's based on the person attending, but be sure to visit this church and attend a Mass so see if it's right for you.", "type": "review", "business_id": "545sP7uSdCcKDZ-reeVOgQ"}
{"votes": {"funny": 1, "useful": 4, "cool": 3}, "user_id": "cB30-Og37dzCWFCFzI_ChQ", "review_id": "1hEjJxhkDWvybpDb4oQh5A", "stars": 5, "date": "2007-06-01", "text": "The Heard Museum is truly awesome. It's not huge, but they make the most of their space, including short films, longer presentations, and a huge display of kachinas in telling the cultural stories of Southwestern Native Americans. Importantly realizing that Native American cultures are not dead, the museum contains modern artwork and filmed interviews with members of today's Native American tribes. The amount of information given is detailed but not overwhelming, and I would say that the museum represents an excellent introduction to Southwestern Indian culture.\n\nOne could complain that the Heard Museum doesn't document any of the internal Indian wars or strife, but on the other hand ,considering the racism these groups still come up against, perhaps its for the best that the rest of us just learn about how complex and beautiful these cultures often were and are. \n\nA final note should be given to the beautiful museum itself, which may be the only time I'll ever use the world \"beautiful\" to describe any building in Phoenix. It resembles images I've seen of Roman villas and its courtyard is very mellow, with a nice cafe and pools of running water. I would even recommend coming just to chill out with an ice tea in a stunning courtyard. I mean, where else can you find that in this town?", "type": "review", "business_id": "SG_gEmEXL4ID6RAEinC5Bg"}
{"votes": {"funny": 13, "useful": 3, "cool": 4}, "user_id": "g84VjttN28PWiv_WtdhnSQ", "review_id": "mbPng8JWwMtbht0VTjjLIQ", "stars": 2, "date": "2008-07-22", "text": "Oh for the love of God this place is boring. Pottery and pictures of pottery. \n\nI came here for some tour a few years ago. I was so bored I went outside and took a nap next to giant flower pot. Then I came back here last month for a charity event and also took a nap, this time in the bathroom.\n\nZzzzzzzzzzzzzzzzzzzzzzzzzzzzzzz...", "type": "review", "business_id": "SG_gEmEXL4ID6RAEinC5Bg"}
{"votes": {"funny": 2, "useful": 2, "cool": 2}, "user_id": "VPXgY9lGJF3XC4ZpusxNuA", "review_id": "eMyjgt0D_EN5RFXE2J7T_g", "stars": 4, "date": "2011-11-04", "text": "This was by far the best collection of Native American art that I have ever seen.  Some of the exhibits had really unique items while others had stuff that I had seen before.  I really liked the fusion of art and history.  I learned a lot about the local Indian tribes, past and present.  Sometimes the galleries felt a little disjointed... I think that comes from the fact that most of the pieces were from a private collection that was donated rather than being cultivated and collected selectively as in most museums.\n\nOverall, it's not my favorite museum in the city.  But everyone who lives here should visit at least once.  I think it would be a great place to take out of town guests as well.", "type": "review", "business_id": "SG_gEmEXL4ID6RAEinC5Bg"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Zd9W-pPwQt849Yue7MChIA", "review_id": "MIMFZjNwCj1tQxmQgxiokw", "stars": 2, "date": "2013-03-10", "text": "The Heard Museum in Phoenix seems behind the times in the presentation of its exhibits plus the exhibits provide minimal information. I was there during the native american Fair and that was quite good, except for the food vendors.\nThe exhibit on chocolate and chili was confusing and I could not follow what the exhibit was trying to show.  The other special exhibits also provided little information; the one showing all the native american tribes in Arizona was not informative because by including all the tribes too little space was given to each one. The best exhibit was of the Indian Boarding School Project.\nIn the crush and lack of signage, we completely missed the new native American War Memorial.\nLater, when we got a chance to read the Fair booklet given museum visitors, in that we found more information on the exhibits and artists, but it was too late. The regular museum booklet wasn't helpful.", "type": "review", "business_id": "SG_gEmEXL4ID6RAEinC5Bg"}
{"votes": {"funny": 1, "useful": 3, "cool": 4}, "user_id": "E6H-hJiPwfU5lgP9bFo2Jg", "review_id": "yBHx2Y2giq3w3Aeu0r77MA", "stars": 5, "date": "2014-02-03", "text": "I'm not sure how many times I've been here, but it's a lot.\nI've always had an interest and an appreciation for history. Being a Phoenix native I've been curious about the area's history.  I have two boys (12 and 9) who also like going here there's plenty to keep a child interested especially if you take the time to explain the exhibits in their terms.\n\nHeard never fails to satisfy my history itch.  There are a number of permanent exhibits and they change things up a bit every so often to give you a good reason to return. Visit their website to see what's going on.  I don't know how many artifacts and pieces of Native American and Southwest art they have in their collection, but it's certainly in the thousands.  As you stroll through the museum to see the displays and read a bit about the history you can't help but put yourself in the time period and imagine what life must have been like.\n\nIf you're visiting the Phoenix area from a location that doesn't have something like the Heard and you want to go home with some knowledge of Native American and Southwest art I highly recommend a visit to Heard.", "type": "review", "business_id": "SG_gEmEXL4ID6RAEinC5Bg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "clmbWh5jkEnd8tZQ6VI06Q", "review_id": "zuAqDv1FzhFNPI_Q1vOY6Q", "stars": 4, "date": "2014-04-04", "text": "If you're new to the area, visiting from out of town, or even a native, you need to check this place out.  I have gone twice and have left extremely impressed both times.  The atmosphere is so amazing.  Right away, just walking through the courtyard to the main entrance, there's so much beauty to take in.  You'll walk past the courtyard cafe, cantina, bookstore, and gift shop on the way to the main entrance.  Both times I've gone, I did the museum first and then the shops and cafe afterwards.  \n\nThe entire museum is somewhat of a maze and, if you're not on a guided tour, can be pretty confusing to navigate.  We didn't have a tour guide either time -- they're free and on a regular schedule, but we preferred to wander at our own pace.  The first floor is very large and divided up into sections.  There's a lot of baskets, pottery, and katsina dolls to check out, and some really interesting native american history to take in.  I learned a lot about the local and native history.  The first floor (to me) gets boring kind of quickly.  A lot of the collections are not as old or historic as I had expected.  It seems like the younger visitors enjoyed the first level more than I did.\n\nThe most impressive part of the museum for me was the 2nd level.  I was in complete awe of the Indian Boarding School exhibit.  I learned SO much about the Indian Schools that I had never even heard of before.  I really wish they would have taught us about this experience when I was in school.  It was AMAZING.  \n\nOverall, the museum experience was very good.  We learned a lot and really enjoyed the history, art, and culture.  The only thing I don't like about the museum is navigating through it.  They do give you maps and offer guided tours, but it's fairly difficult to navigate if you don't know where you're going.  I don't like to look at maps, I prefer to wander.  Different areas are not very clearly marked.  You'll see a door in a hallway and wonder what it leads to, then walk through and realize you're entering a completely different part of the museum.  It's kind of hard to explain, but I wish the areas were more clearly marked.  It's not really big enough to get lost in, but we definitely had several occurrences where we weren't really sure where we were or where we were headed.\n\nThe 2nd time I visited, we decided to have lunch at the cafe and we were really impressed.  The service was great and the prices were MUCH more reasonable than we had expected.  We figured it would be pricey, but it was not.  I had the smoked salmon quesadilla and it was outstanding.  \n\nThe museum shop is pretty typical from what I've experienced at other museums -- a few knick-knacks that are in my price range, surrounded by ridiculously high priced pieces of art/pottery/dolls/rugs.  It's REALLY neat to look at but I couldn't imagine buying anything other than a magnet or a coffee mug.  Some of the pieces are thousands of dollars, but it's awesome to just look and admire.\n\nOverall, always a great experience, easy to find (there's a light rail stop right out front), and it's also very close to other touristy places if you're visiting and want to experience Phoenix.  I highly recommend this place.", "type": "review", "business_id": "SG_gEmEXL4ID6RAEinC5Bg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ki71iAFTxsPPQfX430c99Q", "review_id": "CHTTIj3HgvAZQS98hKIqJg", "stars": 4, "date": "2014-05-25", "text": "First Native American museum I have been to. It was interesting to learn more about the Native Americans' history as I have only seen sections dedicated to their culture at NYC museums.", "type": "review", "business_id": "SG_gEmEXL4ID6RAEinC5Bg"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "8p4at4zdzCpueAmSBaorZA", "review_id": "jwT7SqxnSrH71--jUkvLfg", "stars": 4, "date": "2011-02-28", "text": "I wish I lived closer, I know it is not NYC,  but I enjoyed the theater and the performance.  I had a fantastic time watching Ten Chimneys, it was a fun show.", "type": "review", "business_id": "RA2EuX04SHqmayKpLhpNvA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "L3nyH2yeJRNahm0xepL1yQ", "review_id": "15_ah8EQ8uk8NKc7bPVpCg", "stars": 3, "date": "2009-05-23", "text": "Typical sports bar, nothing special here.  Good thing I don't drink, especially after reading some of the reviews.\n\nWe started with TENDERLOIN SLIDERS (thinly sliced Filet Mignon served as a slider, not bad).\n\nI had PETIE'S CROISSANT (A typical croissant sandwich with turkey).  It was good, but nothing special.  \n\nOverall, I wouldn't mind coming back for lunch, but I wouldn't ever go out of my way for it though.", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "XgIhw-aWaq_Fx3ZVQGjnuA", "review_id": "pos-HAnWITIGxIddNgsttQ", "stars": 4, "date": "2009-06-06", "text": "I did not expect to like this place as much as I did!  It was a real treat with good food and a nice atmosphere!\n\nMy son had the kids menu chicken fingers, and they were HUGE!  Three large pieces of chicken and fries, and he was happy.  They were perfectly cooked, not like typical kids fare.\n\nI had a gourmet cheeseburger and it really was good.  Prices were reasonable, and service was spot on.  I would go back in a heartbeat when downtown.\n\nEnjoy!", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "9IDcR7jQ_GdK7RBen2vJnA", "review_id": "2d_WBGl-5ZaHcK6KnARmPA", "stars": 1, "date": "2009-11-04", "text": "Terrible service.", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "1ZFqBoIJLLxx54XS2C09XQ", "review_id": "nwkGVaufIPGqwN80yq8_tA", "stars": 3, "date": "2009-11-27", "text": "Your standard sports bar fare, reasonably priced and served with a smile.  Good for a beer and a sandwich while watching a game.", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "kGgAARL2UmvCcTRfiscjug", "review_id": "fZIKNRMfZ86yrmwWYuib-Q", "stars": 2, "date": "2011-04-15", "text": "Wow, what a disappointment!  I was not impressed with this place.  It was the night of the NCAA BB Finals and the front bar was too packed.  We went to the the back room and small patio area to join some friends who were part of a large party.  \n\nThere was hardly any room back there either and the server ignored us for most of the night.  We had to serve ourselves by going into the bar.  We also had to bus our own tables because nobody came out to clean up.  Also, the back room was very muggy and humid....this can't be the first time they've done large parties, right?!\n\nLike I said, I expected more out of this place and left disappointed.\n\nReturn Factor - 10%", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "pFdYp4jwf7T8B3ZhLDn0LQ", "review_id": "oJSbQPRHiwTCfCWIUfK5TQ", "stars": 3, "date": "2012-04-14", "text": "Good place to just chill.  Love the patio!\n\nBuffalo wings = super spicy.  Not pleasant when you have to regurgitate it at the end of the night due to massive consumption of alcohol all weekend long.\nAsian Chicken Salad, to hold us girls over.  The plate was huge and fed 6 mouths successfully.\nDrinks are average in price.", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "c8OVugJE4n82_iV7j_ODNg", "review_id": "XSfQ9H732L-Xg42vUEYvfg", "stars": 3, "date": "2012-04-30", "text": "This place gets packed for lunch! The menu is extensive and moderately priced. My friend and I both had turkey burgers and both of us were really pleased! I recommend the green chile burger :-). Delish. The fries were great- skinny, shoestring fries. \n\nI only gave this 3 stars because it is your typical sports bar- lots of TVs, nothing special. But the food is great. I would be a repeat customer of I lived in Phoenix!", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "hGu-yHlbpo-H8Y2VMy5dcg", "review_id": "xYGUzTaU_tWS7U1q0G7IJQ", "stars": 5, "date": "2012-05-30", "text": "Always have a great time here.. attentive staff. Good drinks and fun. Nothing else is necessary", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "sPg1Psg3AixLDYCm3lhRlg", "review_id": "3_mt70tlO9pBvbdUcSD-Nw", "stars": 4, "date": "2012-11-11", "text": "Good place for a beer. Excellent boneless wings.", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "D5mlAUZMCQ8yc0PxOgGpsQ", "review_id": "RlI0PNkCcKimXIKCsnPsgA", "stars": 4, "date": "2014-02-09", "text": "With a fun and upbeat bar area, this place is located in downtown Phoenix, close to the US Airways Center. It seemed that the family area was completely separated from the bar area, which I liked. \nThey have plenty of seating but It can get very busy there on a game night. Also, parking can be a problem if you are just there for dinner and drinks. I didn't think of that and ended up paying $10 for parking. \nI ordered the Long Island Iced Tea, it was very potent and tasted great, just the way it the LIIT should taste. My husband got the wings, which I didn't try but he seemed impressed. I got the fish tacos, and they were very good. The cilantro sauce that came with it was  a little thick and tasted more like ranch, but the salsa was ok. \nAll in all, I had a great time there and the bartenders were all very friendly and attentive.", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "zxuq7MORAKtQL6b6LCxojg", "review_id": "m7PUy9j05rI5RH9w2mk5cg", "stars": 4, "date": "2014-04-07", "text": "I have been truant with my Dukedom for far too long. A review is due lest I be usurped.\n\nMajerle's (Mar-lees) is one of downtown Phoenix's great sports bar. It's great for pre-gaming before heading down the street to US Airways Center or Chase Field. It's great for post-game festivities after leaving the stadiums. And it's great for just watching any game with friends on any of the multiple HD TVs.\n\nMajerle's has plenty of beers on tap, a solid HH menu, and serves libations until around 2am every night. It also seems like it's a bonafide occupational qualification to be hot to work here, and there's absolutely nothing wrong with that. \n\nMajerle's is not great with food, however. They shell out the typical pedestrian bar fare, which is highly suitable for the typical Diamondbacks fan, but if your taste buds yearn for something more refined, you're much better off grabbing food at Networks Bar and Grill or The Arrogant Butcher down the street. \n\nIn conclusion, Majerle's is the slam dunk watering hole in downtown on a game night. Check it out!", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rvL6tIP-WT54fVYQqT9N8Q", "review_id": "EUCXzQrL4rKnSojflCUylw", "stars": 5, "date": "2014-04-11", "text": "Good food , excellent service from the hostess to the waiters! Attentive ,friendly ,quality, cleanliness a+", "type": "review", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ"}
{"votes": {"funny": 0, "useful": 5, "cool": 0}, "user_id": "KKDUmNALFMBHLboupjSN1w", "review_id": "-9EaOGqBjztIQ8jfhHOr8A", "stars": 1, "date": "2011-02-13", "text": "Is there a way to give zero stars?? \nI was waiting in a long line for a taxi home from Phx Sky Harbor. When I finally was given a cab I asked if they took credit. The cab driver said if he had to he could but asked if I would be willing to go to an ATM for cash. I explained after a trip all I had was a credit card and he went on to complain about how he was going to get paid less if I used credit.\n\nOkay, that's annoying but hardly the beginning of it. I live about 2 miles from the airport. The driver kept his meter covered by paper. When I asked why, he said I'd be paying $16, which was the minimum. I asked why the sign said the min. was 15, and he said if I was going to argue he'd leave me there at the side of the road...  Well, I wasn't arguing to begin with, but that was enough for me to shut up. I was a girl alone in a cab and pretty intimidated. \n\nI sent my friend a txt trying to explain my situation and he called back to keep me on the phone so I could continuously update him on my location in case the driver decided to be any crazier. Once I was at my destination I decided it would be best for the driver to drop me at the front of my complex so he wouldn't know exactly where I lived. He used a carbon copy device to get my card # and handed me the receipt to sign without giving my card back. I scribbled in a $2 tip worried that he was going to give me a hard time about giving me my card back or allowing me to access my suitcase in the trunk. The driver was completely intimidating the entire time and insisted I leave a phone number with him before he would return my card to me. \n\nWhen I got to my apt, I called the company to complain. The first person I spoke to was very understanding and apologetic for my experience. She took down my acct and said she'd put it through to the road supervisor who would have to do the follow-up. She promised the my information could stay anonymous from the driver upon my request.\n\nAbout an hour later, at nearly 10pm, the supervisor called and asked me to repeat the situation to him. He said he NOT able to keep my information anonymous. That he would deal with the driver tonight to hear his side of the \"story\". That if I felt my personal safety was in jeopardy that I would have to contact the police. \n\nAbsolutely one of the worst cab companies imaginable. I cannot believe any business can successfully run like this. I will go out of my way to never use them again.", "type": "review", "business_id": "yR3U7jOgoD0V0sGovuyt0Q"}
{"votes": {"funny": 1, "useful": 4, "cool": 1}, "user_id": "CTlDhzAtnQnOLAwUCXb3Fw", "review_id": "rcwp3sWzID9JAne9Olce8w", "stars": 1, "date": "2013-01-17", "text": "Booked online for an 8:15 a.m. ride to the airport.  The site gave me a confirmation number.  At 8:18 a.m., we called in, and an automated message said a cab had been assigned and was on its way.  At 8:30 a.m., we called in again and noticed that the automated message said that \"cab zero\" was assigned, which didn't sound good, so we spoke with a human who said that the online submission had not specified a regular or special cab.  I was pretty sure I had specified \"regular cab\"--but if there was some uncertainty, why not call me at the phone number provided, before the time I was expecting a ride?  We ended up having to drive to the airport and park in short-term parking for a week in order to catch our flight.  Discount Cab, by contrast, has always shown up reliably on time when booked via their website, and I will use them from now on.", "type": "review", "business_id": "yR3U7jOgoD0V0sGovuyt0Q"}
{"votes": {"funny": 1, "useful": 5, "cool": 6}, "user_id": "mt3yjgHWkrUmijiLf9VFPA", "review_id": "xcguqIl5o3rHgnyazUrBww", "stars": 4, "date": "2008-09-04", "text": "So... I'm a sucker for ghost stories, I'll admit it. \n\nWhen the boy and I decided to a day of wandering around Phoenix before making our way out to the Grand Canyon for a wedding, we had a hotel choice to make. There's a number of offerings downtown, and in August, let's face it,  not a whole lot of people are visiting this 107-degree town so the options in our budget range were pretty open. \n\nWhat got us to bypass the fancier, but on sale, hotels with their shiny lobbies, fake-scent-pumping ventilation systems and flat screen TVs? The idea that we might wake up to a bump in the night. \n\nAs the story goes, in 1928,  a woman, desperately in love  (and possibly preggers) with a bell boy from a neighboring hotel, took a flying leap from the roof and became a part of the hotel's history. Supposedly the room in which she stayed, 720, is still alive with her presence, as she plays with the TV and glides in shadows across the room. \n\nWe did a little ghost hunting while we stayed, though  Room 720 wasn't \navailable, we were still able to wander the 7th floor and take pictures of the hallways and stairs. Alas, there was no ghost sightings. \n\nNor did we hear the giggles of children who spent their days as students here when an Indian school occupied the property. \n\nHowever, the hotel was still fun, it was like taking a step back in time with pedestal sinks and mosaic floors. And who doesn't like a bottle opener in the bathroom? It was easy to imagine the silver screen movies stars partying until the early hours, even in our no-view room. \n\nIf you're here, make a stop at the pool, where Marilyn Monroe once swam. It's beautiful at night adorned with multi-colored bubble lamps. But you can't swim after 10! (Who's looking ;-P )", "type": "review", "business_id": "_yfprBETaYgySkKyl8ZWMQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "Gj_398oemu73V9DEFSYZjg", "review_id": "t_UZEUpOYCby9hMZgtmxZQ", "stars": 1, "date": "2011-10-27", "text": "The bar was okay but the comedy show was horrible.", "type": "review", "business_id": "_yfprBETaYgySkKyl8ZWMQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "VpURV1vP5Uit5_eHaCmd8w", "review_id": "N8k81QD7x3onWR2ekMro7A", "stars": 2, "date": "2012-03-01", "text": "My husband booked the hotel because it was listed as one of America's Historic Hotel.  It's in need of some TLC.  Bathroom tiles chipped and dirty grout made it seem dirty.  Small room facing the main street (quiet though).  Unless you're going to a baseball or basketball game (both stadiums are within walking distance), downtown Phoenix is dead.  Hotel also mentioned by Travel Channel as being one of the most haunted (Ghost Bar).  Even during the day, little activity in the area.", "type": "review", "business_id": "_yfprBETaYgySkKyl8ZWMQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "bq1fa6fmeFPXa7qe2pU1Hg", "review_id": "iooe_L_GRQtAJ1zrhIYmVQ", "stars": 4, "date": "2013-06-11", "text": "TONS of historic 1920s charm. When looking for a historic hotel I usually want something that is historic inside too, and this delivers.  So often hotels are victim to insensitive remodel